{
  "mhhw2l08o6qo": "欢迎各位关卡创作者（奇匠）使用编辑器和千星沙箱！我们为您提供了一系列教学课程，帮助您更快了解或学习上手原神编辑器。一、声明目前教程中的内容目前还处于持续更新阶段，会不定时的对内容进行补充以及勘误，如果各位创作者在阅读中发现可以优化和建议之处，欢迎通过【千星奇域创作者中心 - 创作服务中心 - 联系客服 - 奇匠学院（综合指南/教程）问题建议反馈】提交反馈建议。二、内容概述完整的学习路径将分为逐步进阶的课程内容、常见问题FAQ和一个功能说明文档：（涵盖编辑器各个功能的解释说明）三、学习路径为降低学习成本，您可根据实际情况筛选并学习匹配的课程内容：【我是新手】若初次接触编辑器，或开发经验较浅，建议按照课程顺序依次学习：【我是大神】若曾经使用过其他编辑器或开发引擎，并且开发经验丰富，可按需阅读查看。",
  "mhj7yf0vk6nk": "编辑器中最基础的界面信息与重要/常用的操作介绍：——介绍讲解编辑器内的各类界面——介绍讲解如何创建一个关卡工程文件，并进行试玩——介绍讲解编辑器功能逻辑制作中，节点图的编写与挂载方法——介绍讲解如何在编辑器内导入、导出存档——介绍讲解编辑器的debug方法，和常见的debug流程",
  "mhlcjxr9duvy": "前言课程说明：原神编辑器当前分为【局内编辑器】和【千星沙箱】2个模块，该课程将分别介绍这2模块中相关的各分支模块及其作用。 **该课程暂不涉及编辑器的功能制作用法，具体模块的使用将在后续课程中进行详细讲解，可根据实际需要学习并了解基础概念即可相关信息：推荐学习顺序：【当前课程】→【综合指南】（按需查阅）**如在课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 关联知识点：课程中将涉及以下基础概念（可优先根据该课程学习，如在学习过程中遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）编辑器进入方式进入游戏界面后，点击左上角派蒙菜单>>>【我的奇域】>>>再点击【新建存档】即可进入局内编辑器功能简述局内编辑器：集成了局内系统设定、自定义物件与造物（怪物）制作、角色/技能/投射物制作、基础数值配置、场景搭建与物件摆放、界面制作、镜头控制等功能的局内工具。 局内编辑器主要包含关卡设置、地形编辑、实体摆放、元件库、战斗预设、界面控件（UI）、主镜头（相机）7个模块。以下将简要概述各模块功能用法：关卡设置进入方式点击局内编辑器左上角（或直接按ESC键）>>>呼出左侧面板-系统菜单，点击>>>即可进入功能简述关卡设置包含以下8个全局系统设置项：● 基础预设：关卡场景范围、人数限制等基础系统信息预设；● 阵营设置：玩家/物件/敌人（怪物）的团队标签、友善/敌对关系，用于默认攻击逻辑与条件判断标签；● 出生点：进入游戏时玩家控制的角色出生点位设置；● 复苏点：玩家控制的角色死亡后复苏时的点位设置；● 人数设置：关卡游玩人数设置、分组设置；● 加载界面：配置关卡加载时的图素；● 结算：关卡结算逻辑；● 地形导航：敌人（怪物）寻路网格体设置。**更多关卡设置信息可自行查阅【综合指南-关卡设置】 地形编辑进入方式点击局内编辑器顶部菜单栏>>>即可切换至地形编辑 功能简述地形编辑：可进行地形绘制、环境设置、物件/造物（怪物）摆放等关卡内场景效果制作● 地形绘制：可在关卡内的网格进行地形布设（如：地块、斜坡s、水体、路径） ● 环境系统：可配置背景、滤镜、天空盒（云层、星光）等环境相关内容● 物件/怪物摆放：关卡内物件/造物（怪物）的初始位置布设，物件的缩放、旋转调整。**更多地形编辑信息可自行查阅【综合指南-地形编辑】物件摆放&编辑进入方式点击局内编辑器顶部菜单栏>>>即可切换至实体摆放 功能简述物件摆放&编辑：可进行物件/造物（怪物）摆放、编辑实体数据。● 物件/造物（怪物）摆放：关卡内物件/怪物的初始位置布设（与地形编辑的摆放功能一致） ● 编辑实体数据：尺寸、碰撞、阵营、战斗属性、组件、节点图等面板配置**更多信息可自行查阅【综合指南-实体摆放】 元件库进入方式点击局内编辑器顶部菜单栏>>>即可切换至元件库功能简述元件库：可编辑属性和功能的物件/造物（怪物）模版，存储为自定义元件后，用于创建游戏中具有相同属性和功能的物件/怪物（类似Prefab/预制体）。● 自定义物件 ● 自定义造物（怪物）**更多元件库信息可自行查阅【综合指南-元件库】 战斗预设进入方式点击局内编辑器顶部菜单栏>>>即可切换至战斗预设功能简述战斗预设：包含玩家与职业、单位状态（BUFF）、技能、本地投射物、道具5个编辑模块● 玩家与职业：可以对【玩家】、【角色】、【职业】进行属性预设、节点图、组件挂载 ● 单位状态（BUFF）：制作具备增益/减益效果的状态 ● 技能：制作由玩家操作交互后施放的主动技能 ● 本地投射物**更多战斗预设信息可自行查阅【综合指南-战斗预设】 界面控件（UI）进入方式点击局内编辑器左上角（或直接按ESC键）>>>呼出左侧面板-系统菜单栏，点击>>>即可进入 功能简述界面控件（UI）：是玩家游玩游戏时，所展示的按钮/弹窗/文字信息等**例如：游戏中的自定义技能按钮、HP/MP等角色信息展示、背包/地图等界面信息展示、操作进度条等信息展示、任务文案/对话文案等界面信息展示等非原生的按钮/信息展示都是利用【界面控件】制作的。**更多界面控件信息可自行查阅【综合指南-界面控件组管理】 主镜头（相机）进入方式点击局内编辑器左上角（或直接按ESC键）>>>呼出左侧面板-系统菜单栏，点击>>>即可进入 功能简述主镜头：控制游戏内玩家视角的工具，影响玩家在游玩时可看到的画面，通过更改镜头模式（官方预设模版）和视野视距等，可实现不同游戏玩法模式效果**更多镜头信息可自行查阅【综合指南-主镜头】 千星沙箱打开方式● 默认打开方式：开启局内编辑器后会默认启动● 关闭后可点击局内编辑器左上角（或直接按ESC键）>>>呼出左侧面板-系统菜单栏，点击>>>即可打开功能简述千星沙箱：区别于局内编辑器的外置工具，可进行资源索引、逻辑功能编写（节点图）和调试。千星沙箱主要包含【资源管理器】、【服务器节点图资源管理器】、【客户端节点资源管理器】、【节点管理器】、【日志】、【服务器信号管理器】、【负载检测】7个模块。以下将简要概述各模块功能用法：资源管理器功能简述资源管理器：索引展示/定位当前游戏内“场景中已摆放的物件”、元件库中“自定义元件/造物（怪物）”等资源，不具有摆放功能 服务器节点图资源管理器功能简述服务器节点图资源管理器：负责运行在服务器的节点图管理，创建并管理【实体节点图】、【状态节点图】、【职业节点图】、【道具节点图】，及外部相关节点图的导入； 客户端节点资源管理器打开方式默认不展示，点击左上角窗口>>>客户端节点资源管理器>>>即可打开功能简述客户端节点资源管理器：负责运行在客户端（本地）的节点图管理，创建并管理【布尔过滤器节点图】，【整数过滤节点图】和【技能节点图】，及外部相关节点图的导入；节点管理器打开方式默认不展示，点击左上角窗口>>>节点管理器>>>即可打开功能简述节点管理器：查看当前节点分类与节点详情，创建并管理复合节点，及外部节点的导入 日志打开方式默认不展示，点击左上角窗口>>>日志>>>即可打开功能简述日志：筛选指定的服务器节点图，在关卡运行时查看该节点图的运行日志（用于排查Debug）服务器信号管理器打开方式默认不展示，点击左上角窗口>>>服务器信号管理器>>>即可打开功能简述服务器信号管理器：添加/修改服务器信号（用于全局通信使用）负载检测打开方式默认不展示，点击左上角窗口>>>负载检测>>>即可打开功能简述负载检测：在试玩时进行游玩负载情况检测，并通过可视化方式展示负载信息**更多千星沙箱信息可自行查阅【综合指南-千星沙箱】",
  "mhcegrr5omvi": "前言课程说明：课程内容：该课程将引导你通过创建工程文件、设置关卡基础参数、保存&试玩三个流程创建关卡存档学习目标：了解如何创建一个基础关卡存档相关信息：推荐学习顺序：【当前课程】→【综合指南】（按需查阅）**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）创建工程文件操作方式创建工程文件（存档/关卡）需【进入存档界面】和【创建工程文件】两步：1、进入存档界面根据场景入口不同，分两种打开方式【未打开编辑器和千星沙箱——从原神游戏内进入】、【已打开编辑器和千星沙箱——从编辑器和千星沙箱内进入】● 【从原神游戏内进入】：进入原神游戏后，点击左上角派蒙菜单>>>【我的奇域】>>>即可打开存档界面●【从局内编辑器内进入】：局内编辑器左上角（或直接按ESC键）>>>呼出左侧面板-ESC菜单栏，点击>>>即可打开 2、创建工程文件（存档/关卡）进入存档界面后点击右下角【新建存档】>>>即可创建工程文件 设置关卡基础参数进入方式点击局内编辑器左上角（或直接按ESC键）>>>呼出左侧面板-ESC菜单栏，点击>>>即可进入 功能简述关卡设置：关联八个与以下关卡流程强相关的设置项，若配置错误会导致异常报错而无法试玩（新建存档后的默认预设可以直接使用，该课程将根据配置项中的重要模块进行简要介绍）● 基础系统预设：关卡场景范围、人数限制等基础系统信息；● 阵营设置：玩家/物件/造物（怪物）的团队标签、友善/敌对关系，用于默认攻击逻辑与条件判断标签；● 出生点：进入关卡时玩家控制的角色出生点位设置；● 复苏点：玩家控制的角色死亡后复苏时的点位设置；● 人数设置：关卡游玩人数设置、分组设置；● 加载界面：配置关卡加载时的图素；● 结算：关卡结算逻辑；● 地形导航：造物（怪物）寻路网格体设置。 基础重要配置项● 运行后场景生效范围：影响关卡边界范围（如果场景中物体世界坐标超出范围限制，会产生报错）● 关卡环境等级：影响原神原生战斗体系中非角色元素反应的伤害数值（仅支持配置后以默认公式计算，不可修改细节数值公式）● 仇恨类型：可配置自定义类型，设置仇恨倍率，影响战斗时造物（怪物）/物件切换首要仇恨目标的规则（该项涉及较为复杂，此处仅做简单介绍，后续会有单独课程进行详细讲解） 阵营重要配置项● 默认阵营对象：影响新建玩家/物件/造物（怪物）后的默认阵营（玩家/物件/造物（怪物）3种默认阵营必须各有一个，否则会产生报错），创建后的阵营可通过节点图进行动态更换● 阵营关系：影响默认战斗规则（如：是否会默认攻击xx）和输出伤害判断（如：造成伤害的目标筛选-敌对阵营） 出生点重要配置项● 应用至角色模版：影响玩家的出生点（每个玩家都需要配置出生点，否则会产生报错） 复苏点功能简述● 复苏点：影响玩家死亡后的复活点位（默认为空，实际配置时根据需要进行设定即可）人数设置功能简述● 分组设置：分为固定人数/自定义人数，可以对关卡游玩人数进行限制● 分组设置：用于关卡分队设置使用，影响在多人游玩场景下的分队展示加载界面功能简述● 封面设置：关卡加载时展示的图片● 标题设置：可以列举你的关卡标题，展示在加载界面的左下角● 简介设置：可以列举说明关卡游玩信息，展示在加载界面的左下角● 预览加载：可预览配置的加载界面效果结算功能简述● 结算界面设置：可修改结算界面的类型和方式● 结算类型：可按照个人或阵营进行结算地形导航功能简述● 网格体：影响造物（怪物）的寻路功能**更多相关信息可自行查阅【综合指南-关卡编辑】 保存&试玩操作方式完成关卡编辑后，点击局内编辑器左上角（或直接按ESC键）>>>呼出左侧面板-ESC菜单栏，点击>>>即可保存关卡>>>再点击>>>即可试玩",
  "mhzu1vi0s3ms": "前言课程说明：课程内容：节点图的编辑/挂载流程学习目标：了解如何编写节点图，学习功能制作的基础思路**该课程主要以节点图编辑流程讲解为主，更多基础概念信息详见【综合指南】相关信息：推荐学习顺序：【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）节点图编辑节点图说明功能简述节点图：是指由创作者自行编写的自定义逻辑，用于实现游戏中的逻辑功能效果 节点图类型：当前分为【实体节点图】、【状态节点图】、【职业节点图】、【道具节点图】、【布尔过滤器节点图】、【整数过滤器节点图】、【技能节点图】七种类型【实体节点图】、【状态节点图】、【职业节点图】和【道具节点图】的逻辑在服务端运行，因此统称为服务器节点图；【布尔过滤器节点图】、【整数过滤器节点图】和【技能节点图】都是在玩家本地（客户端）运行，因此统称为本地节点图（客户端节点图）以上类型的区分将影响节点图中监听/执行规则、具体节点配置和可挂载对象**更多基础概念信息可自行查阅【综合指南-概述】 节点图编写节点图编写思路节点图的有关键三要素【事件】、【条件】、【结果】，通过合理连线串联这三者，可构成完整的节点图（实现逻辑功能），以下为通用拆解思路：1.明确功能实现的触发条件，即【什么事件导致】2.功能执行时是否根据条件判断有不同分支结果，即【什么条件下触发对应的后续结果】3.确认功能执行后的效果，即【最终实现什么效果】 **需要额外说明的是：以上编写思路为适用于绝大多数节点图的通用拆解思路，部分节点图类型（如：本地过滤器节点图等）不一定严格由【事件】、【条件】、【结果】三部分组成，根据实际情况选择使用即可操作流程1.根据所需制作的节点图类型选择对应的节点图页面（教程中以【服务器节点图-实体节点图】为例进行演示） 2.在页面中，点击鼠标右键展开选项列表>>>选择【创建节点图】>>>即可新建一个节点图并打开对应的节点图编辑界面 3.在节点图编辑界面中，点击鼠标右键展开选项列表（节点库）>>>选择对应的节点即可创建 4.完成基础的节点图搭建后>>>点击保存>>>即完成了节点图编写示例中功能为：和某物体进行交互后，如果交互选项为1，则销毁该物体；如果选项为2，则无效果**更多基础概念信息可自行查阅【综合指南-基础概念】节点图挂载操作流程完成节点图编写后>>>在对应的单位上挂载该节点图>>>点击保存即完成挂载（教程中以【元件】为例进行演示）**更多基础概念信息可自行查阅【综合指南-节点图编辑指引】",
  "mhjuwpiubrh0": "前言课程说明：课程内容：编辑器和千星沙箱中存档的导入与导出方法及部分相关设置学习目标：了解编辑器和千星沙箱中关卡存档的导出与导入方法，及与存档相关的部分设置**编辑器和千星沙箱中还可进行各类资产（元件/技能/单位状态/地形/节点图等）的导入导出，在【综合指南】中已有详细说明，该课程不额外赘述相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】（按需查阅）**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）存档相关操作存档页面设置打开方式根据场景入口不同，存档页面分两种打开方式【未打开编辑器和千星沙箱——从原神游戏内进入】、【已打开编辑器和千星沙箱——从编辑器和千星沙箱内进入】● 【从原神游戏内进入】：进入原神游戏后，点击左上角派蒙菜单>>>【我的奇遇】>>>即可打开存档界面 ●【从局内编辑器内进入】：局内编辑器左上角（或直接按ESC键）>>>呼出左侧面板-ESC菜单栏，点击>>>即可打开 功能简述存档页面：可进行存档页签设置、具体存档设置、存档导入导出等存档相关管理操作 其中【新建页签】和【存档重命名】是最常用的两项管理操作，导入/导出将在下方进行详细讲解● 新建页签：可以创建一个新的存档文件夹，用于进行存档分区管理● 重命名：修改存档名称，用于区分和记忆（仅对自己生效，导入已重命名过的存档会以默认格式命名）存档导出操作方式在存档页面中，选择需要保存的存档>>>鼠标悬停后，点击左下角>>>点击弹出列表中的【导出存档】>>>选择对应保存路径即可导出存档**导出时命名的存档文件名与前文所讲的存档重命名互不影响，均可单独设置 最终存档导出文档为【.gil格式的文档】：存档导入操作方式在存档页面中，点击右下角【导入存档】>>>选则对应需要导入的存档文件即可导入",
  "mhxmm9r879a6": "前言课程说明：课程内容：该课程将讲解在编辑器和千星沙箱中进行试玩调试/Debug的流程方式与自检思路学习目标：了解编辑器和千星沙箱试玩调试的操作流程，掌握基础的调试思路**课程中所讲【调试】对象均为节点图功能调试，不涉及面板配置调试（如：配置了面板的坐标/尺寸等参数，表现不符合预期，不在课程所讲范围内）；此外，该课程讲解以【通用】调试思路为主，适用与多数问题情况，如遇到无法自检出的问题，可根据指引进行问题反馈相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】（按需查阅）**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节） Debug调试流程操作流程1、打开【日志】界面在千星沙箱中点击【窗口】>>>选择【日志】 2、选择需要检测的节点图在【日志】界面中勾选需要检测的节点图>>>点击【确认选择】 3、试玩并查看日志运行情况进入关卡试玩>>>触发需要检测的节点图事件>>>检查日志运行情况 4、进入调试模式，查看节点图运行情况点击日志中已运行的节点图>>>即可进入调试模式，查看运行中传输的数据和运行生效/未生效的节点图逻辑**如在下方演示中，可以通过调试模式看到触发事件时，【输出的具体参数】（事件源实体、事件源GUID、选项序号、选择者）；还可以看到节点图中【生效的逻辑树】（执行流-橙黄色连线、运行流-蓝色连线），未生效的逻辑树（灰色连线）**更多相关信息可自行查阅【综合指南-节点图日志】 Debug调试思路问题原因排查思路在实现的功能效果不符合预期时，需要进行节点图调试，主要检查两个情况：1、【阻塞/没运行】是否节点图阻塞没运行；2、【运行了但输出错误结果】是否节点图运行但参数输出错误 排查流程：根据调试流程逐一配置 → 确认问题情况 → 修改调整，再次试玩调试重复上述流程，直至功能表现符合预期 节点图阻塞/没运行问题情况常见问题类型为以下3种，将在后续进行逐一举例说明：①未挂载节点图 或 节点图挂载对象无法监听对应节点图（对象错误 或 未配置相关组件）对应的问题表现：Debug调试流程中，在【日志】勾选对应的节点图后，试玩操作后日志列表为空 ②使用了错误的事件节点 或 试玩时触发事件的操作和配置的事件节点不统一对应的问题表现：Debug调试流程中，在【日志】勾选对应的节点图后，试玩操作后日志列表为空 ③输入了错误的参数，导致条件判断错误，后续的执行节点不运行对应的问题表现：运行节点图的调试模式中存在未生效逻辑树 问题示例1：未挂载节点图问题案例：制作了一个选项交互功能的节点图，【选项卡交互后】触发事件xxx，但没有在对应交互的物件上挂载节点图问题原因：制作了实体节点图，但没有挂载在对应实体上检查&修改方式：检查触发事件的实体是否配置节点图 → 若未配置，则在实体上配置对应的节点图**下图以动态元件为例进行演示问题示例2：节点图挂载对象错误问题案例：制作了一个UI按钮交互后触发执行特定功能的节点图，【界面控件组触发时】执行xxx，但挂载节点图挂给了非玩家的其他单位（该事件仅能被“玩家”监听）问题原因：制作了实体节点图，但挂载对象无法监听到该节点图的事件检查&修改方式：确认所使用的节点图的【事件节点】是什么 → 确认被挂载对象能否监听该事件 → 如果不能，则更换正确的挂载对象**该问题类型涉及不同事件节点的监听规则，此处以类型说明为主，不做拓展讲解 问题示例3：节点图挂载对象未配置相关组件问题案例：制作了一个碰撞某区域触发执行特定功能的节点图，【进入碰撞触发器时】执行xxx，但没有在对应交互的物件上挂载【碰撞触发器】组件问题原因：制作了实体节点图，但挂载对象没配置相关组件，无法正常触发事件检查&修改方式：确认所使用的节点图的【事件节点】是什么 → 确认该事件是否涉及特殊的组件（如：选项卡/碰撞触发区/命中检测等） → 如果涉及但未配置，则在实体上配置对应的组件**该问题属于面板配置问题，并不涉及节点图改动，此处仅作示意说明 问题示例4：使用了错误的事件节点问题案例：预期实现的功能为【选择选项后，执行xxx】，节点图配置的事件为非【选项卡选中时】的事件节点问题原因：使用的事件节点与实际功能所需的不匹配检查&修改方式：确认所使用的节点图的【事件节点】是什么 → 确认该事件是否与预期功能的触发事件一致 → 若不一致，则更换对应的事件节点（如：选中选项触发xxx，使用【选项卡选中时】；进入碰撞区触发xxx，使用【进入碰撞触发器时】） 问题示例5：试玩时触发事件的操作和配置的事件节点不统一问题案例：预期实现的功能为【选择选项2后，执行xxx】，试玩时没有选择选项2问题原因：试玩时操作未正常触发配置的事件节点**该问题属于个人试玩操作失误（非面板配置/节点图错误），此处不做额外演示，仅给出调试排查思路方向 问题示例6：输入了错误的参数，导致条件判断错误，后续的执行节点不运行问题案例：预期实现的功能为【交互选项后，检查玩家身上的变量，如果满足条件则执行xxx】，实际输入变量不符合预期，导致条件判断错误，无法正常执行（预期走【是】的分支）问题原因：节点图编写存在错误，导致运行中输入/输出结果不符合预期检查&修改方式：在日志中选择触发的事件进入调试模式 → 逐一检查运算流中具体输入/输出参数是否符合预期 → 如果出错，修改节点图中相关配置**该问题类型与下方课程的输出错误结果相关，将在后续展开讲解，此处仅作简单示例，提供检查思路 节点图运行了但输出错误结果问题情况常见问题类型为以下2种：①变量类型错误，导致输出错误的结果②运算存在问题，导致输出错误的结果 以上2种类型对应的问题表现均为：在调试模式中输出的参数错误（类型错误、数值错误） 问题示例1：变量类型错误，导致输出错误的结果问题案例：设置的变量类型为【整数】，但节点图中使用了【浮点数】，实际运算流中输出结果错误问题原因：使用了不匹配的变量类型，输出结果不符合预期，无法正常执行检查&修改方式：在日志中选择触发的事件进入调试模式 → 检查运算流中未执行的前置输入/输出参数是否符合预期 → 如果出错，修改节点图中相关配置**节点图是一种【强类型】语言，会严格按照变量类型进行运算和判断，即节点图中的类型与实际面板配置类型不一致就会出错 问题示例2：运算存在问题，导致输出错误的结果问题案例：预期实现的功能为【交互选项后，玩家变量值+1，检查玩家身上的变量=5时，执行xxx】，但连接节点图时选择了错误的入参值，在玩家积分为4时就已经执行问题原因：节点图编写存在错误，导致运行中输入/输出结果不符合预期检查&修改方式：在日志中选择触发的事件进入调试模式 → 逐一检查运算流中具体输入/输出参数是否符合预期 → 如果出错，修改节点图中相关配置",
  "mhjdic0zyw8o": "在该课程中，以包含一个简易地图设计的基础要素进行拆解，着重介绍编辑器中常用/重点模块的大致功能，并通过具体玩法中的功能实例为演示进行教学。",
  "mhumsn9uap96": "前言课程说明：课程内容：【组件-碰撞触发器】和【组件-选项卡】的使用方式学习目标：学会使用碰撞触发器和选项卡发出事件，可用于制作拾取条件判断、触发特效、触发机关等功能（可在触发事件后自由编写，教程中不一一列举）**该课程中涉及【编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读相关信息：推荐学习顺序：【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）碰撞触发器——通过碰撞触发事件功能示例-1：进入区域后，拾取物品1.概念简述碰撞触发器：通过配置触发器和触发检测范围，当特定目标进入/离开某区域后发出事件 2.教学内容功能效果：制作可被拾取的道具，进入拾取范围后自动拾取效果演示：3.操作步骤1.【局内编辑器】添加组件创建一个元件作为交互物（教程以挑战币为例），在面板中点击>>>进入组件页，点击>>>选择【碰撞触发器】即可添加 2.【局内编辑器】添加触发器打开【组件-碰撞触发器】后，默认不含有触发器，点击即可添加触发器（可同时添加多个触发器制作不同触发功能切换的效果） 3.【局内编辑器】配置面板参数为达到预期的功能效果，教程中配置如下：要做的功能对应的配置项仅玩家单位能触发拾取（物件/造物（怪物）进入区域后不会拾取）【生效目标】调整为仅角色有一定的拾取范围【缩放倍率】调整大一些配置完成后，可在当前界面直接预览实际运行时触发区范围效果此外，还可在面板中配置触发器的【是否初始生效】、【触发区形状】、【范围】等规则，实际使用时可根据需求自由调整**配置项说明：初始生效：是否随物体创建时展示（开启后默认生效，关闭后需要通过节点图动态开启）生效目标：可配置角色、物件、造物（怪物）（由于选项卡只能由角色选择，因此无需额外配置） 4.【千星沙箱】节点图配置在实体节点图中，添加并配置该元件的节点图（设置参考见下图），为达到预期的功能效果教程中配置如下： 要做的功能对应的配置项功能进入区域后拾取物品触发场景进入范围后拾取【事件节点】：进入碰撞触发器时（从外部进入，接触到配置的区域时触发）条件//结果拾取金币【执行节点】：使用【销毁实体】制作拾取效果此外，还可以使用其他碰撞触发器节点制作功能（如：制作基地泉水系统，进入回血，离开取消回血等） 5.【局内编辑器】挂载节点图将配置的节点图挂载在该元件上，保存元件设置**该项为基础操作，教学示例仅演示一次，注意不要挂载错误或漏挂载即可 6.【局内编辑器】放置元件，试玩体验将制作好的元件放置在场景中，进入试玩即可体验该功能**更多相关信息可自行查阅【综合指南-碰撞触发器组件】 选项卡——通过交互选项触发事件功能示例-2：交互选项后，开启宝箱1.概念简述选项卡：在碰撞触发器的基础上封装了原神原生的对话选项，即进入选项触发区域后，会弹出选项卡列表；通过配置选项，当玩家交互选项后发出事件2.教学内容功能效果：制作可进行交互的宝箱，进入范围后可进行交互，交互后开启宝箱效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主3.操作步骤1.【局内编辑器】添加组件创建一个元件作为交互物（教程以宝箱为例），在面板中点击>>>进入组件页，点击>>>选择【选项卡】即可添加 2.【局内编辑器】预设状态-交互表现教程中选择的宝箱具有【预设状态】可以用于简便制作开箱效果，查看确认面板中的【预设状态名称】和【状态值】即可**【预设状态】指封装的物件的一种动画状态（如：箱子开关、金币旋转、拉杆开关等），当前仅部分物件具有预设状态，更多相关信息可自行查阅【综合指南-预设状态】 3.【局内编辑器】配置面板参数为达到预期的功能效果教程中配置如下：要做的功能对应的配置项有一定交互引导提示，以“开启宝箱”为例【选项卡列表-选项文案】设置为开启宝箱有一定的可交互范围【触发选项区域-缩放倍率】调整大一些**由于打开【组件-选项卡】后，默认含1个选项和1个触发选项区域，教程中无特殊需求因此不进行添加，实际使用时可根据需要，点击【添加选项卡】或【添加触发区域】可另行添加新的配置项配置完成后，可在当前界面直接预览实际运行时触发区范围效果此外，还可在面板中配置选项卡的【是否初始生效】、【排序等级】、【选项图标】、【触发区形状】等规则，实际使用时可根据需求自由调整**配置项说明：初始生效：是否随物体创建时展示（开启后默认生效，关闭后需要通过节点图动态开启）选项卡：可配置不同选项（如：可配置多个选项用于触发不同的事件，教程中仅配置了1个）排序等级：影响选项的排序顺序（等级数字越大，排序越前；等级数字相等则按添加顺序排序）本地过滤器：通过特殊的本地过滤器节点图，进一步判断选项卡的是否显示（如：对不同玩家展示不同内容） 4.【千星沙箱】节点图配置在实体节点图中，添加并配置该元件的节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：  要做的功能对应的配置项功能交互后开宝箱触发场景交互选项后触发【事件节点】：选项卡选中时（交互选择“任意”选项时触发）条件//结果-1开启宝箱【执行节点】：使用【设置预设状态】制作开箱效果结果-2开启宝箱后不能再进行开启【执行节点】：使用【激活/关闭选项卡】将选项关闭达到无法再次交互的效果 5.【局内编辑器】挂载节点图将配置的节点图挂载在该元件上，保存元件设置 6.【局内编辑器】放置元件，试玩体验将制作好的元件放置在场景中，进入试玩即可体验该功能**更多选项卡相关信息可自行查阅【综合指南-选项卡组件】拓展应用该模块仅作为教学课程所能拓展应用的功能简述，涉及到多模块联动，以操作步骤演示为主，了解进阶用法即可功能示例-3：玩家拾取特定物体后，可开启机关功能说明：玩家进入钥匙碰撞触发区后可获得钥匙，添加自定义变量作为判断条件，交互宝箱时判断玩家是否具有钥匙（对自定义变量进行判断），符合条件则开启宝箱效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主实现步骤：1.在【玩家】上，添加自定义变量，命名为【是否有钥匙】，类型为【布尔值】，初始值为【否】2.创建一个元件A，作为钥匙3.在元件A上，添加【组件-碰撞触发器】，并按需配置触发器和触发区域规则4.配置元件A的节点图（设置参考见下图）5.将元件A的节点图挂载在元件A上，保存设置6.创建一个元件B，作为交互机关（教程中选择珍贵的宝箱，该物体具有开/关箱子的预设状态）7.在该元件上B，添加【组件-选项卡】，配置选项文案、图标等，并配置选项触发区域范围 8.配置元件B的节点图（设置参考见下图） 9.将元件B的节点图挂载在元件B上，保存设置 10.将元件A和元件B放置在场景中11.进入试玩，即可体验该功能功能示例-4：不同条件下展示不同的选项（过滤器节点图的使用，在功能示例-3的基础上进行改造）功能说明：玩家没有钥匙时，宝箱交互项为“需要获取钥匙后才能打开”，有钥匙后，宝箱交互项为“开启宝箱”效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主实现步骤：步骤1~6，9~12与功能示例-3完全一致（不再额外说明），仅7~8有差异1.在【玩家】上，添加自定义变量，命名为【是否有钥匙】，类型为【布尔值】，初始值为【否】 2.创建一个元件A，作为钥匙 3.在元件A上，添加【组件-碰撞触发器】，并按需配置触发器和触发区域规则 4.配置元件A的节点图 5.将元件A的节点图挂载在元件A上，保存设置 6.创建一个元件B，作为交互机关（教程中选择精致的宝箱，该物体具有开/关箱子的预设状态） 7.配置元件B的过滤节点图（设置参考见下图）过滤节点**此处教程使用的是【布尔型过滤节点图】，需要在客户端节点资源管理器中查看，打开方式：千星沙箱内点击左上角窗口>>>客户端节点资源管理器。本地过滤器将读取节点图输出结果的【是/否】。-如果最终输出为【是】，引用过滤节点图的选项卡生效，玩家视角可以看到该选项（展示）-如果最终输出为【否】，引用过滤节点图的选项卡不生效，玩家视角看不到该选项（不展示）**更多过滤节点图相关介绍，可见后续课程 8.在该元件上B，添加【组件-选项卡】，配置选项文案、图标、过滤节点图等，并配置选项触发区域范围 9.配置元件B的节点图（设置参考见下图） 10.将元件B的节点图挂载在元件B上，保存设置 11.将元件A和元件B放置在场景中 12.进入试玩，即可体验该功能课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/拓展功能复刻：制作开关A打开宝箱B进阶拓展：制作简易的任务系统，首次对话接取任务“获取金币-拾取5个金币”，满足条件后可提交任务，不满足条件则展示“当前未完成” 课程回顾：学习如何使用【组件-碰撞触发器】或【组件-选项卡】发出事件，制作各类触发交互机关或道具辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-碰撞与交互】对照学习 ",
  "mhr0zrrfahm6": "前言课程说明：课程内容：该课程主要包括战斗预设中对于玩家/角色/职业三个模块的设置学习目标：学会如何通过面板配置或节点图调整角色的控制和属性变化**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读 相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）绑定职业——改变角色属性功能示例-1：更改绑定的职业1.概念简述在编辑器和千星沙箱中，将与【玩家】与【角色】相关的各项设置，拆分为【玩家】、【角色】、【职业】三项配置【玩家】：一种特殊的抽象实体类型，处理游戏中逻辑层运算，没有物理实体参考：原神中，玩家的队伍中可以最多存在4个角色，这4个角色从属于1个玩家实体**需要额外说明的是，在UGC中，每个玩家至多对应1个角色，而非本篇中1个玩家至多对应4个角色 【角色】：游戏过程中玩家实际控制的走跑爬飞单位，有物理实体参考：实际玩家操控的香菱、行秋、班尼特等，都属于角色实体 【职业】：可以视作是玩家的一个属性，影响玩家的角色的初始属性和技能参考：玩家操控的香菱、行秋、班尼特角色本身没有任何属性和技能，是通过添加香菱、行秋、班尼特的职业实现具有不同的EQ和普攻 2.教学内容功能效果：制作两个属性不同的初始职业（该功能可不使用节点图，仅面板配置实现），可用作非对称竞技玩法中的不同阵营角色（躲猫猫类玩法）；实际应用时可根据需要制作不同移动能力、不同属性、不同技能等的差异化职业效果演示：**演示中职业A、B设置为生命值差异，职业B生命值=1，职业A生命值=10000；查看底部生命值即可看出角色差异 3.操作步骤1.【局内编辑器】添加职业点击局内编辑器顶部菜单栏>>>切换至战斗预设，点击>>>进入玩家设置分页，选择【职业】>>>点击创建职业 2.【局内编辑器】配置面板参数为达到预期的功能效果教程中配置如下：要做的功能对应的配置项职业AB有血量差异【属性-基础生命值】配置不同，职业A=10000，职业B=1此外，还可在面板中配置职业的【等级】、【复苏】、【基础移动】、【镜头与界面布局】、【名称】等规则，实际使用时可根据需求自由调整 3.【局内编辑器】绑定职业在玩家模版中，选择所需的初始职业即可 可变更的属性在编辑器和千星沙箱中，可通过更改职业的以下规则，影响角色的属性等级设置：初始等级、最高等级、升级所需经验等复苏设置：死亡后是否允许复苏、复苏规则等基础移动：是否允许跳跃/冲刺/攀爬/滑翔等移动属性各项属性：基础生命值、攻击力、防御力、体力上限等镜头与界面布局：玩家操作视角、界面所显示的UI控件信息 等级设置操作方式1.面板配置等级设置共有2部分：【玩家】中的等级设置 和 【职业】中的等级设置【玩家】中的等级设置：覆盖初始绑定职业的等级设置，但不影响切换为其他职业时的等级【职业】中的等级设置：首次切换为该职业时，玩家的职业等级如：共有【玩家A-等级1】，【职业A-等级5】、【职业B-等级10】，设置玩家初始职业为职业A；进入游戏后，实际等级为1（玩家覆盖初始绑定职业的等级设置）；在游玩过程中切换为职业B，将以【职业】中的等级设定为准，等级为10（切换为其他职业后以其他职业的等级设置为准） 2.节点图配置节点图中有【更改职业等级】、【提升职业经验】2个节点可调整等级更改职业等级：把当前的职业等级更改为xx级提升职业经验：提供xx经验值 复苏设置操作方式面板配置复苏设置分2部分：【玩家】中的复苏规则 和 【关卡设置】中的复苏点设置【玩家】中的复苏规则：是否允许复苏、耗时、复苏点选择规则等【关卡设置】中的复苏点设置：复苏点列表设定，影响复苏规则中可选择的复苏点 基础移动操作方式面板配置在【职业】中进行配置，通过绑定特定职业来规定操控角色的基础移动属性（跳跃/冲刺/攀爬/滑翔） **需要额外说明的是：角色攀爬需要【职业-允许攀爬】+【攀爬的物体-是否可攀爬】同时设定，才能进行攀爬 各项属性操作方式面板配置在【职业】中进行配置，通过绑定特定职业来规定操控角色的各项属性（生命值/攻击力/防御力/体力值上限等） 镜头与界面布局操作方式面板配置在【职业】中进行配置，通过绑定特定职业来规定操控角色的镜头与界面布局**该配置项涉及其他模块设置，将在后续课程进行拓展讲解，此处仅简单示意职业中的配置位置 拓展应用该模块仅作为教学课程所能拓展应用的功能简述，涉及到多模块联动，以操作步骤演示为主，了解进阶用法即可功能示例-2：交互选项卡后，更改职业功能效果：制作两个不同职业（有血量差异），当玩家交互选项后，如果选项为1，则更改为职业B，如果选项为2，则更改为职业A效果演示：演示中职业A、B设置为生命值差异，职业B生命值=1，职业A生命值=10000；生命值变更时，即切换职业成功**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主实现步骤：1.创建一个元件，作为交互物 2.添加【组件-选项卡】，并配置选项和触发区 3.节点图配置（设置参考见下图） 4.将节点图挂载在元件上，保存设置 5.将元件放置在场景中 6.进入试玩，即可体验该功能功能示例-3：交互选项卡后，更改职业等级为固定等级功能说明：当玩家交互选项后，如果选项为1，则更改为10级，如果选项为2，则提升为20级效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主实现步骤：与功能示例1步骤相同，仅节点图差异，详见下图参考1.创建一个元件，作为交互物 2.添加【组件-选项卡】，并配置选项和触发区 3.节点图配置（设置参考见下图） 4.将节点图挂载在元件上，保存设置 5.将元件放置在场景中 6.进入试玩，即可体验该功能 功能示例-4：交互选项卡后，更改职业等级为当前等级+1功能说明：当玩家交互选项后，当前等级升1级效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主实现步骤：与功能示例1步骤相同，仅节点图差异，详见下图参考1.创建一个元件，作为交互物 2.添加【组件-选项卡】，并配置选项和触发区 3.节点图配置（设置参考见下图）4.将节点图挂载在元件上，保存设置 5.将元件放置在场景中 6.进入试玩，即可体验该功能课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/创新功能复刻-1：在特定区域进行职业切换，切换后角色不可跳跃、不可冲刺（可用于跑酷/解密玩法中，特定场景下限制移动方式进行精准走位）功能复刻-2：制作一个悬崖墙面，墙面上布设藤蔓路径，仅允许角色沿藤蔓路径攀爬，其他墙面位置不可攀爬（可用于跑酷/解密玩法中，沿特定引导路径攀爬移动）课程回顾：学会如何通过更改职业影响角色属性，制作具有差异化（移动能力、属性、技能等）的职业 辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-角色设置】对照学习",
  "mhi2dr0pe60g": "前言课程说明：课程内容：游戏镜头视角的配置方式学习目标：学会如何通过面板配置或节点图调整角色镜头相机设置，实现不同游戏视角切换（如2.5D俯视角、第一人称、第三人称等）**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）主镜头——更改游戏视角功能示例-1：制作不同视角下的游戏镜头1.概念简述主镜头编辑：是游戏中用于呈现玩家视角的工具，可通过定义镜头模板来定义镜头的规则（如：通过更换镜头模式，切换为第一人称/第三人称/俯视角等）2.教学内容功能效果：制作不同的镜头，用于不同视角模式的游戏（教程中以俯视角为例进行演示）效果演示： 3.操作步骤【局内编辑器】更改镜头参数点击局内编辑器左上角（或直接按ESC键）>>>呼出左侧面板-ESC菜单栏，点击>>>进入主镜头编辑界面，即可更改镜头属性（可通过官方预设的镜头模式快捷调整）为达到预期的功能效果，教程中配置如下：要做的功能对应的配置项制作俯视角【基础设置-模式】使用2.5D镜头对职业x生效【默认生效目标】调整为所需更改的职业此外，还可在【职业】中配置镜头（两处配置效果一致，任选一处配置即可）**更多相关信息可自行查阅【综合指南-镜头】 拓展应用该模块仅作为教学课程所能拓展应用的功能简述，涉及到多模块联动，以操作步骤演示为主，了解进阶用法即可功能示例-2：交互选项卡后，切换镜头模式功能说明：制作一个镜头切换装置，当玩家交互选项后，可根据交互选项切换为第一人称或俯视角效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主实现步骤：1.配置2个主镜头，分别对应模式为【第一人称镜头】和【2.5D镜头】（可对镜头名称进行自定义，用于后续节点图配置使用） 2.创建一个元件，作为交互物 3.添加【组件-选项卡】，并配置选项和触发区 4.节点图配置（设置参考见下图）**图中的【镜头模版名称】即为步骤1中进行自定义后的镜头名称 5.将节点图挂载在元件上，保存设置 6.将元件放置在场景中 7.进入试玩，即可体验该功能课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/创新功能复刻：通过切换镜头控制，制作FPS玩法中的倍镜开镜效果课程回顾：学会通过更改相机设置，效果制作不同的游戏视角（如：背越式、2.5D俯视角、第一人称FPS等）辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-镜头设置】对照学习   ",
  "mh93rq9zhueq": "前言课程说明：课程内容：【组件-基础运动器】的使用方式学习目标：学会使用基础运动器，让物体动起来，可用于制作运动的机关装置、道具表现或装饰物等功能（可通过自由编写运动规则实现，教程中不一一列举）**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）基础运动器——让物体以一定规律运动功能示例-1：制作一个持续往返运动的机关装置1.概念简述基础运动器：通过配置运动规则，让物体以一定规律运动（如：匀速直线、匀速旋转等） 2.教学内容功能效果：做一个可以持续进行往返运动的物体（该功能可不使用节点图，仅面板配置实现），可用作跑酷/解密模式中的场景移动装置；实际应用时可根据需要制作大摆锤、过山车等机关装置效果演示： 3.操作步骤1.【局内编辑器】添加组件创建一个元件作为交互物（教程以移动平台为例），在面板中点击>>>进入组件页，点击>>>选择【基础运动器】即可添加 2.【局内编辑器】添加触发器打开【组件-基础运动器】后，默认不含有运动器，点击即可添加运动器（可同时添加多个运动器制作组合运动的效果） 3.【局内编辑器】配置面板参数配置基础运动器的运动规则，确认后保存元件设置为达到预期的功能效果教程中配置如下：要做的功能对应的配置项平台创建后就持续运动（无特殊触发条件）【初始生效】开启平台沿特定路径往返移动【运动类型】路径运动【路点】配置运动位置和运动时间平台持续循环运动【循环类型】调整为循环配置完成后，可在当前界面直接预览当前运动器的效果此外，还可在面板中配置基础运动器的【运动类型】、【运动速度】等规则，也可以组合多个运动器达到复杂运动的效果，实际使用时可根据需求自由调整**配置项说明：运动类型：目前支持【匀速直线】、【匀速旋转】、【朝目标旋转】、【路径运动】4种方式；此外，还可以添加多个不同类型的运动器叠加组合（特殊：【匀速旋转】和【朝目标旋转】不能同时配置） 4.【局内编辑器】放置元件，试玩体验将制作好的元件放置在场景中，进入试玩即可体验该功能**更多相关信息可自行查阅【综合指南-基础运动器组件】 拓展应用该模块仅作为教学课程所能拓展应用的功能简述，涉及到多模块联动，以操作步骤演示为主，了解进阶用法即可功能示例-2：踩到特定平台上，开门；离开特定平台，关门功能说明：玩家踩到特定平台上（进入某区域），打开大门；离开特定平台（离开某区域），关闭大门效果演示：实现步骤：1.创建一个元件A，作为门 2.在元件A上，添加【组件-基础运动器】，添加2个运动器，分别用作开门和关门；配置运动模式均为【匀速直线】，运动时间、速度可根据需求自由调整（设置参考见下图） 3.可点击【预览当前运动】查看运动效果是否符合预期，确认无误后保存设置 4.在元件A上，添加自定义变量，命名为【是否开门】，类型为【布尔值】，初始值为【否】（实际使用时可根据自身需求自由调整）**补充说明：由于仅涉及开/关门两个状态，为避免多人游戏时重复触发开门/关门事件，导致效果出错，因此额外通过自定义变量来管理门的状态 5.创建一个元件B，作为触发物 6.在元件B上，添加【组件-碰撞触发器】，并配置触发区 7.将元件A放置在场景中，查看并记录其GUID（注意是场景中物件的GUID，而非元件ID） 8.配置元件B的节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：  要做的功能对应的配置项功能-1进入区域开门触发场景踩到触发物上时【事件节点】：进入碰撞触发器时（从外部进入，接触到配置的区域时触发）条件当前门没开【流程控制节点】：判断门当前的状态为“未开门”（自定义变量，是否开门=否）结果-1开门【执行节点】：使用【激活基础运动器】-激活开门的运动器结果-2开门过程中/之后无法再次触发开门【执行节点】：设置门当前的状态为“已开门”（自定义变量，是否开门=是）功能-2离开区域关门触发场景离开触发物上时【事件节点】：离开碰撞触发器时（从内部出去，接触到配置的区域时触发）条件当前门打开【流程控制节点】：判断门当前的状态为“已开门”（自定义变量，是否开门=是）结果-1关门【执行节点】：使用【激活基础运动器】-激活关门的运动器结果-2关门过程中/之后无法再次触发关门【执行节点】：设置门当前的状态为“未开门”（自定义变量，是否开门=否）此外，还可以使用其他基础运动器节点制作功能（如：开门后触发xx效果、施放时停技能使物体暂停运动等） 9.将节点图挂载在元件B上，保存设置 10.将元件B放置在场景中 11.进入试玩，即可体验该功能课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/创新功能复刻：制作需要“钥匙”才能开的门进阶拓展：通过多个运动器叠加实现如：钓鱼甩竿、做饭颠锅等组合运动课程回顾：学习如何使用【组件-基础运动区】赋予物件运动效果，让物件以一定规律运动，制作各类运动机关或道具辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-基础运动】对照学习",
  "mh055pi9lit0": "前言课程说明：课程内容：编辑器和千星沙箱中特效的配置方式学习目标：学会如何添加特效，制作游戏过程中的表现效果**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）特效播放器组——让物体呈现不同效果功能示例-1：制作一个持续燃烧的火炬1.概念简述特效：制作各类视觉表现的美术资产（编辑器和千星沙箱内置了一批预设特效）特效播放器组：通过添加特效和特效规则，让物体呈现不同的效果（如：发光的门、爆炸效果、子弹轨迹等） 2.教学内容功能效果：做一个持续燃烧的火炬（该功能可不使用节点图，仅面板配置实现），可用作跑酷/解密模式中的场景装饰物或解密道具效果演示：**物件-火炬本身是没有燃烧特效的，添加特效后可呈现持续燃烧的效果3.操作步骤1.【局内编辑器】添加特效创建一个元件作为交互物（教程以火炬为例），在面板中点击>>>进入组件页，打开【特效播放器组】>>>点击【添加特效】**所有可配置特效的单位创建时都默认含有【组件-特效播放器组】，无需额外添加；如果自己删除了，可以通过添加组件再次添加 2.【局内编辑器】配置面板参数为达到预期的功能效果教程中配置如下：要做的功能对应的配置项特效持续循环【特效资产类型】选择循环特效火焰特效【特效资产】选择合适的火焰类效果火焰的位置在火炬尖端【偏移】调整至合适位置配置完成后，可在当前界面直接预览特效播放效果此外，还可在面板中配置特效【特效类型】、【跟随位置/旋转】、【挂接点】、【缩放比例】等规则，实际使用时可根据需求自由调整**配置项说明：特效类型：分为循环特效和限时特效两种，并且每种类型对应的特效资产也不同循环特效：持续播放；限时特效：播放一次后消失 3.【局内编辑器】放置元件，试玩体验将制作好的元件放置在场景中，进入试玩即可体验该功能**更多相关信息可自行查阅【综合指南-特效播放器组】 拓展应用该模块仅作为教学课程所能拓展应用的功能简述，涉及到多模块联动，以操作步骤演示为主，了解进阶用法即可功能示例-2：制作一个交互点火的开关功能说明：交互物件A，给物件B添加特效（交互机关使火炬点燃）效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主实现步骤：1.创建一个元件A，作为火炬2.在元件A的【组件-特效播放器】中选择要添加的特效和位置等参数信息（此处非配置，而是通过预览确认添加后的效果，实际面板配置为空）**教程中延用功能示例-1的特效与参数配置为例，实际制作时可根据需要灵活调整--循环特效--特效id:189--偏移（0,1.2,0） 3.将元件A放置在场景中，确认其GUID 4.创建一个元件B（教程中选择拉杆机关为例），作为交互物 5.在元件B上，添加【组件-选项卡】，配置选项和触发选项区域范围 6.配置元件B的节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：  要做的功能对应的配置项功能交互后点火触发场景交互选项后触发【事件节点】：选项卡选中时（交互选择“任意”选项时触发）条件//结果-1火炬点火【执行节点】：在元件A上挂载循环特效，特效资产与位置等即为步骤2和3中确认的信息结果-2拉杆机关变化表示交互成功【执行节点】：使用【设置预设状态】制作拉杆效果结果-3使用机关后不能再次使用【执行节点】：使用【激活/关闭选项卡】将选项关闭达到无法再次交互的效果 7.将配置的节点图挂载在该元件上，保存元件设置 8.将元件B放置在场景中，进入试玩即可体验该功能课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/拓展功能复刻：制作开启宝箱后，宝箱发光效果进阶拓展：通过道具运动器+落点特效组合制作技能范围预警效果 课程回顾：学会如何利用特效制作差异化的美术表现效果，可尝试制作各类场景引导、装饰物、道具表现等辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-特效】对照学习",
  "mhr6jorjp77a": "前言课程说明：课程内容：界面控件（UI）的制作与使用案例学习目标：学会如何配置UI，制作游戏中的引导信息或交互按钮等（如：血量、属性、排行榜、文字提示等）**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）（包含该目录下各模版控件内容）界面控件——玩家设备上的UI信息与按钮界面控件：通过配置控件和控件信息，制作在玩家设备上显示的UI信息或按钮（如：弹窗提示、进度条、属性信息、计时器、可交互道具等均为界面控件） 功能示例-1：信息类控件-常驻显示的动态文本框1.概念简述信息类控件：以展示信息为主，可展示配置固定/动态内容（固定-文字引导、动态-进度变化），【文本框】、【弹窗】、【进度条】、【全局计时器】、【计分板】都属于信息类控件**教程中将以【文本框】进行讲解 2.教学内容功能效果：制作一个显示积分信息的UI，拾取金币后积分+1效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 3.操作步骤1.【局内编辑器】添加自定义变量在【玩家】上添加一个自定义变量（命名可自由配置），类型为整数，初始值为0 2.【局内编辑器】制作控件点击局内编辑器左上角（或直接按ESC键）>>>呼出左侧面板-ESC菜单栏，点击>>>进入界面控件编辑界面，在【界面控件组库】中添加界面控件模版>>>选择【文本框】 3.【局内编辑器】配置控件参数配置文本框显示信息，保存设置为达到预期的功能效果教程中配置如下：要做的功能对应的配置项固定显示信息为 积分值说明【文本内容】直接输入“积分：”动态显示信息为玩家自身的积分值变化【文本内容】插入变量为玩家自身-积分值（步骤1添加的自定义变量）让信息看着显眼一些调整【字号】、【位置】、【对齐】等参数**当前局内编辑器界面布局与各机型相关，需要进行逐一配置（教程中以移动端和PC端为例） 4.【局内编辑器】添加控件到界面布局将制作完成的控件添加到界面布局中（在步骤3中调整好各机型配置效果，此处添加后会自动同步，无需额外配置）**界面控件组库中制作的类似元件库中制作的元件，实际游玩时并不显示，需要添加至界面布局中才会显示 5.【局内编辑器】绑定界面控件到具体玩家在战斗预设-职业中，选择布局**此处教程中无玩家展示信息差异化（如：玩家A展示信息A，玩家B展示信息B），直接使用默认配置；如有特殊需要，可对不同职业进行独立配置 6.【局内编辑器】制作可拾取的金币制作金币元件，作为拾取道具，添加【组件-碰撞触发器】，调整碰撞区域**该功能在前置课程-碰撞与交互中已使用，此处不再列举配置项 7.【千星沙箱】节点图配置在实体节点图中，添加并配置金币元件的节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：  要做的功能对应的配置项功能拾取金币增加积分触发场景进入范围后拾取【事件节点】：进入碰撞触发器时（从外部进入，接触到配置的区域时触发）条件//结果-1拾取后增加1积分【执行节点】：使用设置自定义变量设置【拾取后积分值=当前积分值+1】结果-2拾取金币【执行节点】：使用【销毁实体】制作拾取效果 8.【局内编辑器】挂载节点图将配置的节点图挂载在金币元件上，保存元件设置 9.【局内编辑器】放置元件，试玩体验将制作好的金币元件放置在场景中，进入试玩即可体验该功能**更多相关信息可自行查阅【综合指南-文本框界面控件】 功能示例-2：交互类控件-点击后触发事件1.概念简述交互类控件：可以进行点按交互，交互后发出一个事件，【交互按钮】属于交互类控件**实际用法与【碰撞触发器】、【选项卡】类似，都是用于触发事件，区别仅在于交互按钮可控性更强，可随时触发事件，多用于制作主动效果（如：使用道具、主动技能、打开背包等） 2.教学内容功能效果：制作一个主动增加积分的按钮，每次按下时积分+1效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 3.操作步骤功能示例中的积分值UI和变量设置与功能示例-1完全一致，此处仅说明，不额外赘述，以讲解【交互按钮】特殊配置为主 1.【局内编辑器】添加自定义变量在【玩家】上添加一个自定义变量（命名可自由配置），类型为整数，初始值为0 2.【局内编辑器】制作控件点击局内编辑器左上角（或直接按ESC键）>>>呼出左侧面板-ESC菜单栏，点击>>>进入界面控件编辑界面，在【界面控件组库】中添加界面控件模版>>>选择【文本框】和【交互按钮】 3.【局内编辑器】配置控件参数配置【文本框】和【交互按钮】参数**【交换按钮】延用了默认参数未进行额外配置，实际使用时可根据需要调整【按钮位置】、【触发按键】、【使用间隔】、【使用次数限制】等参数 4.【局内编辑器】添加控件到界面布局将制作完成的控件添加到界面布局中 5.【局内编辑器】绑定界面控件到具体玩家在战斗预设-职业中，选择布局**此处教程中无玩家展示信息差异化（如：玩家A展示信息A，玩家B展示信息B），直接使用默认配置；如有特殊需要，可对不同职业进行独立配置 6.【千星沙箱】节点图配置在实体节点图中，添加并配置【玩家】的节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：**特殊：交互按钮对应的事件节点【界面控件组触发时】仅【玩家】能触发  要做的功能对应的配置项功能按下按钮增加积分触发场景点按按钮时触发【事件节点】：界面控件组触发时（任意交互按钮被点按时）条件//结果拾取后增加1积分【执行节点】：使用设置自定义变量设置【拾取后积分值=当前积分值+1】 7.【局内编辑器】挂载节点图将配置的节点图挂载在【玩家】上，保存元件设置 8.【局内编辑器】试玩体验直接进入试玩即可体验该功能**更多相关信息可自行查阅【综合指南-交互按钮界面控件】 拓展应用该模块仅作为教学课程所能拓展应用的功能简述，涉及到多模块联动，以操作步骤演示为主，了解进阶用法即可功能示例-3：信息类控件-占点进度条功能说明：制作一个占点进度条，玩家进入占点区域后，进度条增加，占满5秒可完成占点，提示游戏胜利；中途离开占点区域，则停止占点进度效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主实现步骤：1.在【玩家】上，添加3个自定义变量，分别对应占点进度的【最大值】、【最小值】、【当前值】变量1，命名：【占点最大值】（命名可自由配置）；类型：整数；初始值：100变量2，命名：【占点最小值】（命名可自由配置）；类型：整数；初始值：0变量3，命名：【占点当前值】（命名可自由配置）；类型：整数；初始值：0 2.制作进度条控件，选择合适的【类型】、【大小】、【样式】、【颜色】等参数；配置当前值、最大值、最小值，对应【玩家自身】对应的变量值，保存设置 3.将制作完成的控件添加到界面布局中，并绑定给对应的职业（玩家） 4.创建一个元件，作为占点平台 5.在该元件上，添加【组件-碰撞触发器】，选择合适的类型并配置能覆盖平台的触发范围，生效目标设置为仅角色 6.配置该元件和玩家的节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：元件节点图**由于占点是一个持续增加的进度状态，并且随时间变化而改变值，因此使用【定时器】以一定频率增加进度值（进入区域，启动定时器开始增加占点值；离开区域，终止计时器占点值不再增加）  要做的功能对应的配置项功能-1进入占点区后，可增加占点值触发场景进入圆台范围后触发【事件节点】：进入碰撞触发器时（从外部进入，接触到配置的区域时触发）条件//结果开始增加积分【执行节点】：启动定时器，并挂载在玩家身上由于循环触发，因此选择【循环=是】教程中设置【拼接列表=0.5s】为定时器以0.5s触发一次，可根据实际需要灵活调整（如：0.1s触发一次、1s触发一次等）（功能-2离开占点区后，停止增加占点值触发场景离开圆台范围后触发【事件节点】：离开碰撞触发器时（从内部出去，接触到配置的区域时触发）条件//结果不再增加积分【执行节点】：终止定时器，终止之前挂载的定时器即可 玩家节点图  要做的功能对应的配置项功能按时间增加占点值，如果占点值满则胜利触发场景一定时间频率教程中以每隔0.5s变动一次为例【事件节点】：定时器触发时根据之前设计，0.5s/次进行触发条件//结果增加占点值【执行节点】：使用增加自定义变量改变当前值由于最大值=100，5s可达到满值，因此占点值0.5s涨幅10（新值=当前值+10） 7.将节点图挂载在元件和玩家上，保存设置；将元件放置在场景中，进入试玩，即可体验该功能**更多相关信息可自行查阅【综合指南-进度条界面控件】课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/创新功能复刻：制作交互进度条，显示任务完成进度，如：当前拾取道具数/所需道具数进阶拓展：制作可使用道具，施放后生成具有特效的道具物品并以一定规律运动 课程回顾：学会如何使用合适的界面控件制作所需的信息类UI或交互类UI（如：制作任务进度、交互进度、主动道具等）辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-界面控件】对照学习",
  "mh99bn93wjzu": "前言课程说明：课程内容：阵营系统介绍与使用学习目标：学会如果配置阵营关系，用于攻击时的标签判断与默认攻击逻辑使用（如：默认造物都属于同阵营，可划分部分造物至玩家阵营，做成召唤物的效果；或根据不同玩家划分造物和玩家阵营，制作自走棋/宝可梦等玩法）**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读相关信息：推荐学习顺序：【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）阵营——区分团队的标签，影响攻击逻辑判定功能示例-1：设定和玩家同阵营的造物（怪物）1.概念简述阵营：通过配置不同阵营和阵营关系，用于节点图中的标签判断（是否x阵营），攻击逻辑判定（是否可以自主攻击某阵营单位） 2.教学内容功能效果：制作1个属于玩家阵营的造物（怪物），不攻击玩家而能帮助玩家攻击其他造物（怪物）（该功能可不使用节点图，仅面板配置实现），用于各类玩法中制作友善阵营的造物（怪物）/NPC、召唤物类技能效果演示：**如果在试玩时遇到造物（怪物）无法正常攻击、巡逻异常等问题，可以尝试使用【关卡设置-地形导航-烘焙网格体】3.操作步骤1.【局内编辑器】进入阵营配置页点击局内编辑器左上角（或直接按ESC键）>>>呼出左侧面板-ESC菜单栏，点击>>>在关卡设置中点击【阵营】 2.【局内编辑器】配置面板参数按需配置阵营与阵营关系**教程中沿用了默认未进行更改，仅做概念说明**配置项说明：默认阵营对象：未进行过阵营修改的单位初始创建时的默认阵营阵营关系：分为【敌对】和【友善】2种，可配置其他阵营对自身的关系和自身阵营对其他阵营的关系（如：阵营1对阵营2友善，阵营2对阵营1敌对，则实际游玩时，阵营2会攻击阵营1，但阵营1不会攻击阵营2） 3.【局内编辑器】创建同阵营造物（怪物）创建一个造物（怪物）（教程以普通丘丘人为例），在面板属性-阵营中，改为【初始玩家阵营】，保存设置**教程中无额外功能需求，玩家为同一阵营，此处选择初始玩家阵营即可；如果玩家分为不同阵营，则需要额外考虑造物（怪物）具体归属是哪个阵营 4.【局内编辑器】放置造物（怪物），试玩体验将我们创建的造物（怪物）和常规造物（怪物）放置在场景中，进入试玩即可体验该功能**如果在试玩时遇到造物（怪物）无法正常攻击、巡逻异常等问题，可以尝试使用【关卡设置-地形导航-烘焙网格体】**更多相关信息可自行查阅【综合指南-阵营】 拓展应用该模块仅作为教学课程所能拓展应用的功能简述，涉及到多模块联动，以操作步骤演示为主，了解进阶用法即可功能示例-2：阵营切换台，切换玩家阵营功能说明：玩家交互后，根据选项切换自身阵营效果演示：演示中放置了一个造物（怪物），根据造物（怪物）是否攻击玩家判断阵营切换是否成功**演示中的文本显示，需达到Lv.3后解锁【自定义文本外显】功能，教程中以效果展示为主 实现步骤：1.创建一个元件，作为交互物 2.在该元件上添加【组件-选项卡】，并配置选项内容和触发选项区域范围 3.配置该元件的节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：  要做的功能对应的配置项功能交互选项后切换阵营触发场景选择选项后触发【事件节点】：选项卡选中时条件具体选了哪个选项【流程控制节点】：判断选项序号结果-1切换为造物（怪物）阵营【执行节点】：修改实体阵营为造物（怪物）阵营结果-2切换为玩家阵营【执行节点】：修改实体阵营为玩家阵营 4.将节点图挂载在元件上，保存设置 5.将元件放置在场景中，并放置一个造物（怪物）作为检测判断，进入试玩即可体验该功能课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/拓展进阶拓展：制作捉宠技能，可以将敌对阵营的造物（怪物）改为自身阵营的造物（怪物） 课程回顾：学会如何添加配置阵营和阵营关系，用于团队标签判断和攻击逻辑判断（如：团队1/团队2积分，友善阵营的召唤物等）辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-阵营设置】对照学习",
  "mh0apmie08e4": "前言课程说明：课程内容：技能的制作流程学习目标：学会制作技能的完整流程，让角色能施放攻击，可用于制作施放魔法弹、圆形AOE、召唤小怪、添加状态等技能效果（可通过自由编写技能范围、伤害数值、技能效果等实现，教程中以基础攻击为例，不一一列举）**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节） 技能——让角色执行特定行为功能示例-1：施放普通攻击1.概念简述技能：通过配置技能动画、冷却、索敌等规则，让角色执行特定行为（如：挥剑攻击、抬手施放火球、蓄力重击等）在编辑器和千星沙箱中，技能由【技能基础设置】【角色动画】【技能效果】3部分组成，教程后续也将以这3部分展开讲解 2.教学内容功能效果：制作挥剑普通攻击效果演示： 3.操作步骤1.【局内编辑器】添加技能进入【战斗预设】Tab，选择>>>进入技能页，点击>>>设置技能名称后，即可添加（教学中直接命名为普通攻击，实际可自由配置） 2.【局内编辑器】配置【技能基础设置】可在该页面中配置技能的【技能类型】、【基础设置】、【冷却】、【使用次数】【技能消耗】等参数**教程中全部使用默认参数，未进行修改，此处仅示意，实际使用时可根据技能效果调整**配置项说明：技能类型：目前有【普通技能】【瞬发技能】【长按技能】三种瞬发技能：点按施放技能；没有动画；施放后，一次性执行所有技能效果普通技能：点按施放技能；仅支持一次性技能动画；可在动画中任意帧插入技能效果（如：武器挥砍时才攻击）长按技能：长按施放技能；可使用循环技能动画；可在动画中任意帧插入技能效果（如：蓄力重击循环0.5s造成1次伤害） 3.【千星沙箱】节点图配置【技能效果】在【客户端节点图资源管理器-技能节点图】中，添加并配置技能的节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：**特殊：技能节点图无需额外配置触发场景（开端固定包含【节点图开始】），施放技能就代表可触发，在后续设置的技能动画编辑中将再说明  要做的功能对应的配置项功能以扇形范围，打出AOE伤害，有击中特效触发场景//条件//结果触发攻击【执行节点】：使用【特定位置打攻击盒】制作攻击伤害效果**攻击盒配置项逻辑说明（更多详细说明可自行查阅【综合指南-能力单元效果】）：伤害范围攻击位置获取自身位置和旋转，攻击点为玩家施放技能后角色当前位置攻击范围【攻击盒类型】选择了扇形，设置其高度、角度、半径等范围参数即可伤害目标和形式攻击对象为除了自己以外的其他人【目标阵营筛选】选择需求的受击目标范围内AOE选择【触发类型】为每个实体只触发一次（范围内所有单位都会造成一次伤害）伤害值攻击有一定伤害伤害值=伤害系数*攻击力+伤害增量（实际伤害与防御力有关，此处不拓展讲解）教程中为了便于展示效果，仅设置伤害增量，并设置该次伤害为【绝对伤害】**绝对伤害，忽略防御值，仅以伤害增量直接造成伤害命中时的其他效果攻击命中有特效提示【命中特效】配置一个合适的特效资产即可，并配置合适的【特效缩放】和【偏移】可以看到伤害数字【是否屏蔽伤害跳字】=否此外，还可以使用其他技能节点制作功能（如：回血、转向、发射子弹等） 4.【局内编辑器】配置【角色动画】点击【动画编辑】进入动画时间轴编辑页，为达到预期的功能效果教程中配置如下：要做的功能对应的配置项角色有挥剑动作选择动画合适的动画资产，教程中以单手剑普通攻击为例挥剑中途才造成伤害（即拔剑时没有伤害，挥出时才造成伤害）【节点图事件轨道】找到需要的动画对应的具体帧，添加步骤3中配置的技能节点图角色有挥剑动画【状态轨道】添加特效，选择单手剑，配置挂接点【GI_WeaponR】挂点可在【角色】-【组件-自定义挂接点】查看配置完成后，可在当前界面直接预览技能动画和伤害范围效果此外，还可在配置【允许打断】、【可悬浮移动】、【允许转向】等规则，实际使用时可根据需求自由调整**更多相关信息可自行查阅【综合指南-技能】 5.【局内编辑器】给角色添加技能在所需【职业】上添加技能，并绑定给对应【玩家】 6.【局内编辑器】放置造物（怪物），试玩体验放置一个造物（怪物）作为伤害测试目标，进入试玩即可体验该功能 拓展应用该模块仅作为教学课程所能拓展应用的功能简述，涉及到多模块联动，以操作步骤演示为主，了解进阶用法即可功能示例-2：召唤技能功能说明：召唤技能，施放后召唤一个友善阵营的火斧丘丘人，可以协助玩家攻击其他单位效果演示：**如果在试玩时遇到造物（怪物）无法正常攻击、巡逻异常等问题，可以尝试使用【关卡设置-地形导航-烘焙网格体】实现步骤：1.添加自定义技能，并进行基础的技能相关预设（CD、使用限制等） 2.【技能】节点图配置【技能效果】（设置参考见下图），为达到预期的功能效果教程中配置如下：  要做的功能对应的配置项功能使用技能后召唤小怪触发场景//条件//结果召唤小怪【执行节点】：通知服务器节点图**由于客户端节点图无法直接创建，部分功能是从客户端发出，由服务器接收并运行（详见步骤3） 3.【角色】节点图配置接收到客户端参数后的效果，（设置参考见下图），为达到预期的功能效果教程中配置如下：  要做的功能对应的配置项功能使用技能后召唤小怪触发场景//条件//结果-1召唤小怪【执行节点】：使用创建元件，在使用技能的角色位置创建一个小怪结果-2小怪为同阵营小怪【执行节点】：直接修改被创建实体的阵营**此处前置将小怪配置为同阵营则无需这一步骤 4.将【技能】节点图配置在【技能】内，将【角色】节点图挂载在【角色】上，保存设置 5.将制作完成的技能，添加至所需【职业】，并绑定给对应玩家，进入试玩即可体验该功能课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/创新功能复刻：制作朝角色面向位置发射子弹的技能进阶拓展：制作风场技能，施放后可以在原地生成风场持续攻击小怪并往中间牵引 课程回顾：学会如何通过基础设置、动画编辑、技能节点图组合不同效果的技能，可制作更丰富的差异化技能（不同的技能效果、不同的技能表现等）辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-技能设置】对照学习",
  "mh09qf0mc628": "前言课程说明：课程内容：角色扰动装置组件的使用方法学习目标：学会制作常用的角色扰动装置，让角色受到持续或瞬间力的作用，可用于制作弹床、风场、牵引装置等效果。**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读相关信息：推荐学习顺序：【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）角色扰动装置——让角色受到力的作用功能示例-1：进入区域后，垂直弹射1.概念简述角色扰动装置：当靠近一定区域后，角色将会受到设定的力的作用而改变运动状态**角色扰动装置仅对【角色】生效 2.教学内容功能效果：制作弹弹菇，进入特定区域后受力的作用垂直弹射效果演示： 3.操作步骤1.【局内编辑器】添加组件创建一个元件作为可弹射的物体（教程中以弹弹菇为例），在面板中点击>>>进入组件页，点击>>>选择【角色扰动装置】即可添加 2.【局内编辑器】添加角色扰动装置打开【组件-角色扰动装置】后，默认不含有角色扰动装置，点击【+】即可添加 3.【局内编辑器】配置面板参数添加【角色扰动装置】后可对装置类型、扰动规则、触发区域等进行调整，为达到预期的功能效果教程中配置如下：要做的功能对应的配置项进入区域后触发【触发区域】调整为球形，并配置合适的中心点与半径**实际制作时可根据需要灵活调整将人物弹射升空【装置类型】调整为弹射器弹射方向为垂直向上【扰动方向】设置为指定方向，并设置Y轴的方向向量与速率**实际制作时可根据需要灵活调整**配置项说明：稳定阶段时长(s)：角色持续受到角色干扰装置的时间，在此期间维持速率衰减阶段时长(s)：角色受到的角色干扰装置，在扰动时间结束后，力的作用逐渐减少至0的时间 4.【局内编辑器】添加组件（**此处配置仅加强表现，与实际功能作用无关）为了使弹射效果更加生动明显，玩家每次进入碰撞触发区弹射时，弹弹菇也有挤压弹射的变化；添加【组件-碰撞触发器】并调整为合适的大小（与角色扰动装置触发范围一致即可） 5.【千星沙箱】节点图配置（**此处配置仅加强表现，与实际功能作用无关）在实体节点图中，添加并配置该元件的节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：  要做的功能对应的配置项功能-1玩家进入碰撞触发区弹射时，弹弹菇有挤压弹射的变化触发场景玩家进入碰撞触发区后，触发事件【事件节点】：进入碰撞触发器时条件//结果-1弹弹菇挤压弹射【执行节点】：设置预设状态为变化值功能-2玩家离开碰撞触发区后，弹弹菇恢复触发场景玩家离开碰撞触发区后，触发事件【事件节点】：离开碰撞触发器时条件//结果弹弹菇恢复【执行节点】：设置预设状态为初始值 6.【局内编辑器】挂载节点图将配置的节点图挂载在该元件上，保存元件设置，将制作好的元件放置在场景中，进入试玩即可体验该功能**更多相关信息可自行查阅【综合指南-组件-角色扰动装置组件】 拓展应用该模块仅作为教学课程所能拓展应用的功能简述，涉及到多模块联动，以操作步骤演示为主，了解进阶用法即可功能示例-2：特定阵营玩家进入区域后，进行牵引传送功能说明：制作仅对特定阵营生效的角色扰动装置（传送器） 效果演示：**教程为了方便演示增加了UI显示角色当前阵营（此处暂不拓展讲解）**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 实现步骤：1.创建一个元件，作为交互物，添加【组件-角色扰动装置】，对装置类型、扰动规则、触发区域等进行调整，为达到预期的功能效果教程中配置如下：要做的功能对应的配置项进入区域后触发【触发区域】调整为正方体，并配置合适的中心点与缩放尺寸**实际制作时可根据需要灵活调整将人物牵引传送到某区域【装置类型】调整为牵引器牵引方向为X方向【扰动方向】设置为指定方向，并设置X轴的方向向量与速率**实际制作时可根据需要灵活调整牵引中途可打断【跳跃可打断】选项打开 2.【客户端节点图-过滤节点图】配置按照阵营过滤效果，为达到预期的功能效果教程中配置如下：  要做的功能对应的配置项功能玩家为阵营1时，可被传送，玩家为其他阵营时无效触发目标查询进入角色扰动装置触发区的实体的阵营【目标实体】=进入角色扰动装置触发区的实体**该实体为角色，切换为玩家再查询阵营条件判断进入角色扰动装置触发区域的玩家属于阵营1运算节点：【是否相等】判断目标实体阵营是否为阵营1**注意检查变量类型是否为【阵营】哦~结果// 3.制作玩家切换阵营的功能（**此处配置仅用于单人测试演示不同阵营效果，对原功能无影响）此处以玩家施放技能切换进行简要演示说明添加【技能】，对技能类型、动画编辑等进行调整，由于无动作特效等需求，因此使用【瞬发技能】 4.制作玩家切换阵营的节点图功能（**此处配置仅用于单人测试演示不同阵营效果，对原功能无影响）【客户端-技能节点图】配置一个通知服务器节点图，将其添加至技能中 5.将【技能】绑定在对应职业上 6.制作玩家切换阵营的节点图功能（**此处配置仅用于单人测试演示不同阵营效果，对原功能无影响）【服务器-实体节点图】技能施放后切换阵营为达到预期的功能效果教程中配置如下：**该节点图挂载对象为：【角色】  要做的功能对应的配置项功能施放技能后切换阵营触发场景施放技能后【事件节点】：技能节点图调用时（接收客户端发送【通知服务器节点图】时触发）条件-1判断玩家当前阵营【流程控制节点】：使用双分支对“玩家阵营”进行判断结果-1玩家阵营为1时，切换为2【执行节点】：【修改实体阵营】将【玩家】阵营改为2结果-2玩家阵营不为1时，切换为1【执行节点】：【修改实体阵营】将【玩家】阵营改为1结果-3修改自定义变量【执行节点】：设置自定义变量，将UI显示的玩家阵营切换为最新的阵营**此处仅显示，与功能无关 7.将节点图挂载在各对应元件/角色上，保存设置 8.将制作完成的元件摆放在场景中，进入试玩即可体验该功能课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/拓展功能复刻：制作原神中的风场，受力的作用持续使玩家处于上升/悬浮 课程回顾：学会根据不同场景需求制作特定的角色扰动装置，制作例如：风场、投射弹床、牵引传送门等效果辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-角色扰动装置】对照学习",
  "mhw64cr51fue": "前言课程说明：课程内容：该课程主要讲解关卡环境配置制作与使用案例。学习目标：学会如何配置天空盒，滤镜以及点光源，提升关卡整体氛围表现。**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读。相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅）关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）环境配置——改变天空背景相关参数功能示例-1：通过环境配置制作夜晚场景效果1.概念简述环境配置：可以对关卡的天空盒、滤镜、光源等进行设置 天空盒：指关卡内的天空背景，光照色彩、角度等。效果可见下图：滤镜：指可在关卡中生效的色彩滤镜，增强画面质感。效果可见下图： 光源：指可照亮局部场景的光源，如点光源、聚光灯等效果。效果可见下图： 2.教学内容功能效果：使用环境配置制作一个夜晚场景效果演示： 3.操作步骤1.【局内编辑器】进入环境配置在【地形编辑】面板左侧的环境配置中点击>>>进入详情配置页。2.【局内编辑器】配置时间为夜晚可以在标签页中对天空盒参数进行设置。为达到预期的功能效果，教程中配置如下：要做的功能对应的配置项天空盒对所有玩家都可见【生效目标】选择“所有”天空背景为默认颜色【背景设置】选择“正常”在关卡过程中，昼夜不会随着时间流逝而变化【随时间自动切换】选择“关闭”**如需配置昼夜随时间变化，可以开启后，在ESC菜单的关卡设置——基础中设置关卡的初始时间点和时间流逝速度，教学不做赘述。天空盒时间为夜晚【设定时间点】设置为“00:00” 3.【局内编辑器】配置环境要素参数，增加星星和云打开环境配置详情页后，可以在【环境要素】中对天空中出现的星星和云朵进行进一步设置，为达到预期的功能效果，教程中配置如下：要做的功能对应的配置项天空中有明亮的星星且密度较高【星星】——开启【密度】——100.0【强度】——0.5天空中能看到银河【银河】——开启【强度】——0.5【受光颜色】——默认天空中还有较密的云层【云】——开启【强度】——1.00【类型】——全部 4.【局内编辑器】配合光源配置制作灯具在黑夜中，为了增加环境氛围效果，我们还可以添加点光源。（教程演示中放置了静态单位：木质路灯，在静态路灯处设置了点光源，创作者可根据自身关卡实际需要来放置单位，也可以不放置单位直接配置光源）打开环境配置详情页后，可以在标签页中对光源参数进行设置。点击【添加光源】>>>【打开光源工具】>>>【新建光源】即可对光源进行设置。在光源管理中，可以对光源进行详细设置，为达到预期的功能效果，教程中配置如下要做的功能对应的配置项制作的是路灯的光源【位置】调节到路灯实体位置光源跟随黑夜环境生效【归属文件】选择“环境配置”（为上文配置的黑夜文件）归属是指光源在什么环境下生效，如果不进行配置，光源默认不生效。光源为圆型橙色点光源【光源类型】选择“点光源”【颜色】设置为“橙色”【半径】设置为“10.0”【强度】设置为“3.0”**实际制作时可根据自身需要灵活调整光源效果光源在一定距离外也显示【生效范围】设置为“100.00” 5.【局内编辑器】试玩体验 功能示例-2：通过节点图事件快速切换环境设置1.教学内容功能效果：通过事件快速切换环境设置。效果演示： 2.操作步骤1.【局内编辑器】新增环境设置在【地形编辑】面板左侧的环境配置中点击>>>点击新建一个环境，进入新环境详情配置页。 2.【局内编辑器】配置背景和环境要素整体的配置方式和功能示例1一致，在本教学中，需要配置2个环境用于切换。环境1的配置和上文功能示例1完全一致，故不赘述；环境2的配置为达到预期的功能效果，教程中配置如下：要做的功能对应的配置项不初始生效【生效目标】选择“无”天空背景为紫色【背景设置】选择“蓝色”在关卡过程中，昼夜不会随着时间流逝而变化【随时间自动切换】选择“关闭”天空盒时间为正午【设定时间点】选择“12:00”天空中有云且密度较高【云】选择“开启”【强度】选择“1”【类型】选择“全部”**实际制作时可根据自身需要灵活调整环境效果**配置完成后请确保有两个环境配置供切换，如下图： 3.【局内编辑器】配置携带触发器组件的动态元件接下来需要配置一个动态组件以发出事件（教程中以石质功能平台为例），在元件库中创建元件后，挂载触发器组件；具体配置方式可以参考往期教程：碰撞与交互。为达到预期的功能效果，教程中配置如下： 4.【千星沙箱】节点图配置在实体节点图中，添加并配置该元件的节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：**该节点图挂载在【物件元件】上  要做的功能对应的配置项功能交互后开宝箱触发场景进入碰撞区后触发【事件节点】：进入碰撞触发器时条件//结果-1切换环境配置【查询节点】：使用【获取在场玩家实体列表】获取在场的所有玩家【执行节点】：使用【修改环境配置】制作环境切换效果**环境配置索引在环境配置详情页中可以找到 5.【局内编辑器】挂载节点图将配置的节点图挂载在机关元件上，保存元件设置。 6.【局内编辑器】放置元件，试玩体验将制作好的元件放置在场景中，进入试玩即可体验该功能课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻功能复刻：制作清晨或傍晚环境的关卡进阶拓展：制作可以通过节点图动态切换的环境。 课程回顾：学会如何进行环境设置，提升整体关卡氛围表现。辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-环境配置】对照学习     ",
  "mhv3ufrgotny": "前言课程说明：课程内容：关卡结算流程的制作学习目标：了解在游戏设计过程中，如何设置完整的结算条件与结算流程。通过特定事件触发结算判断，结合获胜条件，制作例如：击败BOSS后获胜、进入领奖台获胜、打败其余全部玩家获胜、获得xxx金币获胜等功能（可在触发事件后自由编写，教程中不一一列举）**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）关卡结算——游戏结束，进行全局结算功能示例-1：交互不同选项卡后触发不同的关卡结算1.概念简述关卡结算：整体游戏流程的最后一步，代表玩家完成该局游戏（也可以根据需要进行中途结算等），并根据游玩结果获得胜利、失败等结算结果。**关卡结算是一个预封装的节点，可根据实际结算操作、结算条件灵活配置使用。 2.教学内容功能效果：玩家交互选项卡后，进行关卡结算，根据不同选项触发不同结算（以下以成功结算、失败结算分别演示）效果演示：成功结算**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主失败结算 3.操作步骤1.【局内编辑器】制作结算触发物件创建一个元件作为结算操作的物件（教程以元素火炬为例），在面板中点击>>>进入组件页，点击>>>选择【选项卡】即可添加 2.【局内编辑器】配置面板参数添加选项卡后可对选项卡列表、选项触发区域进行调整，为达到预期的功能效果教程中配置如下：要做的功能对应的配置项设置两个选项卡，用于触发不同的结算结果【选项卡】分别设置为“成功结算”、“失败结算”**名称不影响其效果，记住选项卡“序号”即可触发区域稍微大一些【触发选项区域】调整缩放倍率 3.【千星沙箱】节点图配置在实体节点图中，添加并配置该元件的节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：**该节点图挂载在【结算操作元件】上  要做的功能对应的配置项功能玩家对结算操作元件交互后，检测交互项，执行不同结果的结算触发场景选择选项卡后，触发事件【事件节点】：选项卡选中时条件-1根据不同的操作，执行不同的效果【流程控制节点】：使用多分支对“选项序号”进行判断**该教程中，选项序号分别对应：序号1-成功结算序号2-失败结算结果-1根据不同的操作，设定玩家结算状态【执行节点】：使用【设置玩家结算成功状态】，调整玩家的结算状态分别为“成功”、“失败”结果-2结算关卡【执行节点】：使用【结算关卡】进行游戏结算**结算关卡后会立即结束游戏，通常都是作为流程中的最后一个节点 4.【局内编辑器】挂载节点图将配置的节点图挂载在该元件上，保存元件设置 5.【局内编辑器】放置元件，试玩体验将制作好的元件放置在场景中，进入试玩即可体验该功能**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主拓展应用该模块仅作为教学课程所能拓展应用的功能简述，涉及到多模块联动，以操作步骤演示为主，了解进阶用法即可功能示例-2：玩家拾取特定物体后，引导玩家可进行关卡结算功能说明：开箱获取特定通关道具后，引导玩家当前可进行关卡结算，交互后检测是否有通关道具，有则进行结算。**对于关卡结算的使用相对容易，更重要的如何引导玩家获取关键道具并正确进行关卡结算，以下将通过特效、气泡、界面空间（UI）的组合运用进行演示。 效果演示： 实现步骤：1.【局内编辑器】制作交互物-宝箱，交互后获得通关道具创建一个元件作为交互物（教程中以宝箱为例），添加【选项卡组件】，并配置合适的选项文本与触发选项区域大小 2.【局内编辑器】制作交互物宝箱的提示引导信息在宝箱的【特效播放组件】中添加循环特效，作为引导玩家与宝箱交互的指引，教程中以【箭头特效为例】，配置参数见下 3.【局内编辑器】制作玩家自定义变量，用于通关条件判断与界面控件（UI）信息展示给【玩家】添加1个自定义变量，用作判断能否通关的条件，设置参数如下：变量名称：是否有钥匙变量类型：布尔值初始值：否 4.【局内编辑器】制作UI提示信息制作界面控件（UI）作为是否有钥匙的提示信息，保存并添加进界面布局中文本框内容为：当前是否有钥匙：【玩家自身变量-是否有钥匙】**通过插入变量→玩家自身-是否有钥匙实现 5.【局内编辑器】制作交互物-通关机关制作一个元件作为通关交互物（教程中以元素火炬为例），添加【选项卡组件】，并配置合适的选项文本与触发选项区域大小 6.【局内编辑器】制作通关机关的引导效果给通关交互物添加【文本气泡组件】，用于指引玩家进行交互结算，并配置合适的文本与位置**为了引导玩家在获取道具后才可以进行交互，设置文本气泡初始不显示 7.【千星沙箱】交互物-宝箱节点图配置在实体节点图中，添加并配置元件的节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：**该节点图挂载在【交互物-宝箱】上  要做的功能对应的配置项功能玩家交互宝箱后，获得钥匙，并提示引导可以进行通关机关交互触发场景选择选项卡后，触发事件【事件节点】：选项卡选中时条件//结果-1宝箱不可以重复交互【执行节点】：使用【激活/关闭选项卡】，关闭选项结果-2宝箱打开【执行节点】：使用【设置预设状态】制作宝箱打开的状态效果结果-3关闭宝箱的特效引导提示【执行节点】：使用【根据特效资产清除特效】关闭特效结果-4玩家获得通关道具【执行节点】：使用【设置自定义变量】改变交互的玩家身上的自定义变量，用于后续结算判断结果-5给交互物-通关机关添加引导提示【执行节点】：使用【挂载循环特效】给通关机关添加特效；【执行节点】：使用【切换生效的气泡对话】把之前制作的气泡对话打开 8.【千星沙箱】交互物-通关机关节点图配置在实体节点图中，添加并配置元件的节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：**该节点图挂载在【交互物-通关机关】上  要做的功能对应的配置项功能玩家交互通关机关后，检测玩家身上“是否有钥匙”，有钥匙则成功结算触发场景选择选项卡后，触发事件【事件节点】：选项卡选中时条件判断玩家是否有通关道具-钥匙【流程控制节点】：使用【双分支】对交互的玩家身上的自定义变量进行进行判断结果-1设定玩家结算状态【执行节点】：使用【设置玩家结算成功状态】，调整玩家的结算状态为“成功”**不进行结算状态预设，直接使用结算关卡，默认会以“成功”结算，此处仅作为教学演示结果-2结算关卡【执行节点】：使用【结算关卡】进行游戏结算**结算关卡后会立即结束游戏，通常都是作为流程中的最后一个节点 9.将节点图分别挂载在元件上，保存设置 10.将制作完成的元件摆放在场景中，进入试玩即可体验该功能课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/拓展功能复刻：多人游戏中的争夺宝物机制，交互后获得王冠，最早交互王冠的玩家获胜，其余玩家失败进阶拓展：制作简易的任务系统，引导玩家击败xx怪物并获得xx道具，在玩家击败怪物获得道具后，交付任务成功结算课程回顾：学习如何使用关卡结算相关的节点图进行结算状态设定与结算流程设置，制作不同情况下的游戏完成逻辑辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-关卡结算】对照学习",
  "mhjzq00hlql4": "在该课程中，以包含一个简易地图设计的基础要素进行拆解，着重介绍编辑器中常用/重点模块的大致功能，并通过具体玩法中的功能实例为演示进行教学。",
  "mhflri07dzd4": "前言课程说明：课程内容：【组件-自定义变量】的使用方式学习目标：学会使用自定义变量给元件/造物（怪物）/角色/玩家等添加标签，用于特定条件判断下的效果执行（如：玩家具有变量-布尔值“是否装备物品”，根据变量判断玩家能否拾取道具；土壤具有变量-整数“土地等级”，根据不同土地等级可进行不同操作，等级0只允许耕地，等级1只允许播种）**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读相关信息：推荐学习顺序：【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）自定义变量——添加一个特定标签功能示例-1：土地升级顺序检查，判断当前土地等级，不同等级下只能进行特定操作1.概念简述自定义变量：是规定的特定值，用于存储数据值，在节点图中进行数据传输调用。变量具有不同的数据类型，决定了变量可以存储的数据的类型和范围。例如，整数型-Int（1、2、3.....）、浮点型-float（1.0、1.1、1.2...）、字符串型、布尔型-bool（是、否）等，变量也具有列表类型，为一系列变量的集合。 2.教学内容功能效果：制作一个可进行种植的土地地基，土地地基可按照“未开垦→已开垦→已播种→已浇水”进行升级，不同等级下具有不同表现，升级具有固定顺序（如：不可从未开垦直接跳至已播种）效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主3.操作步骤1.【局内编辑器】添加组件**组件-自定义变量默认自带，此处仅演示误操作删除后的添加方式创建一个元件作为可种植土壤（教程以空物件为例），在面板中点击>>>进入组件页，点击>>>选择【自定义变量】即可添加 2.【局内编辑器】添加自定义变量打开【组件-自定义变量】后，默认不含有自定义变量，点击下方新增变量即可添加（按需选择添加数量与变量类型即可） 3.【局内编辑器】配置面板参数添加变量后可对变量的名称、类型、初始数值进行调整，为达到预期的功能效果教程中配置如下：要做的功能对应的配置项变量名设置，用于节点图配置使用【变量名】调整为“土地等级”**变量名称不影响其效果，仅作为节点图配置和索引使用，以自己方便记忆的命名配置即可土地共具有“未开垦→已开垦→已播种→已浇水”4个等级【变量类型】调整为“整数”**使用“浮点数”“字符串”等均能满足需要，此处仅为了方便计算使用，可按照自己喜好配置即可土地初始为“未开垦”状态【初始数值】调整为0 4.【局内编辑器】选择土地升级后的效果表现教学中演示的做法为，在空物件位置生成不同的其他元件或特效，用于表示土地升级效果，实际制作时可根据需要自行选择所需元件或特效配置。**记住元件ID和特效ID即可，用于后续的节点图配置教学中的配置参考：土地等级0：仅空物件土地等级1：创建元件-生成土壤土地等级2：创建元件-生成种子土地等级3：添加特效-已浇水状态 5.【局内编辑器】添加【组件-选项卡】作为土地升级的触发事件此处选择【组件-选项卡】仅方便教学示例演示使用，实际制作时可灵活调整（如：使用特定道具时触发升级，耙子可以升级土地未开垦→已开垦，种子可以升级土地已开垦→已播种，水壶可以升级土地已播种→已浇水）为达到预期的功能效果教程中配置如下：要做的功能对应的配置项土地升级具有“开垦”、“播种”、“浇水”三个触发事件【选项卡】设置数量为3，分别对应三个操作进入一定区域范围后可选项操作【选项触发区域】配置一个合适大小即可 6.【千星沙箱】节点图配置在实体节点图中，添加并配置该元件的节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：**该节点图挂载在【种植格元件】上  要做的功能对应的配置项功能玩家对土地进行操作后，检测操作是什么，检测土地等级，均符合后提升土地等级触发场景选择选项卡后，触发事件【事件节点】：选项卡选中时条件-1根据不同的操作，执行不同的效果【流程控制节点】：使用多分支对“选项序号”进行判断**该教程中，选项序号分别对应：序号1-开垦土地序号2-播种序号3-浇水条件-2土地升级有固定顺序，不可跳级进行【流程控制节点】：使用双分支对当前的自定义变量“土地等级”进行判断，符合条件的土地才可以进行升级操作（即0级土地只能开垦，1级土地只能播种，2级土地只能浇水）结果-1根据不同的操作，调整土地表现【执行节点】：使用【创建元件】或【挂载特效】制作土地升级表现结果-2根据不同的操作，调整土地等级【执行节点】：使用【设置自定义变量】将土地上的自定义变量“土地等级”改成下一级 7.【局内编辑器】挂载节点图将配置的节点图挂载在该元件上，保存元件设置 8.【局内编辑器】放置元件，试玩体验将制作好的元件放置在场景中，进入试玩即可体验该功能**更多相关信息可自行查阅【综合指南-组件-自定义变量】 拓展应用该模块仅作为教学课程所能拓展应用的功能简述，涉及到多模块联动，以操作步骤演示为主，了解进阶用法即可功能示例-2：拾取道具判定，拥有道具时无法拾取，只能切换道具功能说明：3种道具分别可进行“拾取”和“切换”，没有道具时可以拾取，已拾取道具后只能切换效果演示：示例仅初步效果演示，成功拾取/切换的效果通过UI文字展示，实际制作时可灵活考虑添加特效或道具跟随表现**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主实现步骤：1.制作3个不同道具物件，添加【组件-选项卡】，配置选项“拾取”与“切换”，配置合适的选项触发区域 2.【玩家】配置【组件-自定义变量】，添加2个自定义变量，参数如下：变量1-是否有工具，用于判断玩家能否“拾取”或“切换”道具变量2-装备的工具是，用于判断玩家当前身上的道具，“切换”后将原装备的道具放在原地 3.节点图配置“拾取”/“切换”道具效果（设置参考见下图），为达到预期的功能效果教程中配置如下：**由于3个道具功能逻辑一致，仅判断玩家身上道具后，生成的道具和切换当前装备的道具差异，教程以其中之一（耙子）示例  要做的功能对应的配置项功能没有道具时可拾取；已拾取道具时仅切换，将原拾取道具放下触发场景进行交互操作后【事件节点】：选项卡选中时（交互选择“任意”选项时触发）条件-1判断玩家的操作是什么【流程控制节点】：使用多分支对“选项序号”进行判断**该教程中，选项序号分别对应：序号1-拾取序号2-切换条件-2判断玩家是否已拾取道具【流程控制节点】：使用双分支对【玩家】变量“是否有工具”进行判断结果-1没有道具时直接拾取，拾取后道具消失【执行节点】：将【玩家】变量“是否有工具”改为“是”，“装备的工具”改为“耙子”【执行节点】：将拾取的道具销毁条件-3切换时，根据玩家已拾取道具生成旧道具【流程控制节点】：使用多分支对【玩家】变量“装备的工具是”进行判断结果-2有道具时切换新的道具，切换后道具消失，在原地生成旧道具【执行节点】：使用【创建元件】在原地生成玩家装备的工具对应的元件【执行节点】：将【玩家】变量“装备的工具”改为“耙子”【执行节点】：将拾取的道具销毁 4.将节点图挂载在各对应元件上，保存设置 5.将制作完成的元件摆放在场景中，进入试玩即可体验该功能课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/拓展功能复刻：制作需要钥匙才能开的门进阶拓展：制作耙子、种子、水壶3种工具，可对土地进行不同的操作（开垦、播种、浇水），当玩家拥有特定工具后才可以进行对应操作 课程回顾：学会通过设置不同类型的自定义变量做对应的标签，可制作更复杂的条件判断辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-自定义变量】对照学习 ",
  "mhq8ew91dx8i": "前言课程说明：课程内容：定时器的使用方式学习目标：了解使用定时器发出事件，可用于制作延时触发机关（每隔一段时间触发xx效果）、植物生长效果（每隔x段时间生长）等**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）定时器——通过自定义时间，在特定时间触发事件功能示例-1：每隔一段时间，植物升级1.概念简述定时器：通过配置时间列表，在对应时间发出事件**定时器无需通过局内编辑器配置，全部通过节点图控制 2.教学内容功能效果：制作植物，放置后每隔2s成长1次效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主3.操作步骤1.【局内编辑器】制作一个种植格用于种植物的触发事件创建一个元件作为交互物（教程以空物体为例），添加【组件-选项卡】配置选项卡及选项触发区域**教程中选择空物体和【组件-选项卡】仅为了方便演示示例，实际制作时可根据自身需要更换其他触发事件由于教程中将使用“删除旧的种植物，生成新的种植物”制作植物生长表现，需要在种植格上保存旧的种植物，因此添加【组件-自定义变量】，类型为【实体】 2.【局内编辑器】选择植物生长后的效果表现教学中演示的做法为，在空物件位置生成不同的其他元件，用于表示植物生长效果，实际制作时可根据需要自行选择所需元件配置**记住元件ID即可，用于后续的节点图配置教学中的配置参考：种植物-种子期~生长期：仅元件模型不同种植物-成熟期：模型元件不同，同时添加了循环特效表示此时的果实已成熟 3.【千星沙箱】节点图配置在实体节点图中，添加并配置该元件的节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：  要做的功能对应的配置项功能-1进行种植操作后，种下植物，植物开始生长触发场景进行种植操作后【事件节点】：选项卡选中时条件//结果-1种下植物【执行节点】：使用【创建元件】在种植格的自身位置生成种子期的种植物结果-2确认种植的植物是哪个（制作生长表现使用）【执行节点】：使用【设置自定义变量】将生成的种子期的种植物保存为变量结果-3植物开始生长【执行节点】：使用【启动定时器】挂载在种植格上，配置定时器序列为：2、4、6**定时器序列即为定时器运行多久后发出一次时间，由于植物生长是单次且不循环的，因此配置第2/4/6s生长1次功能-2每隔2s植物生长1次触发场景每隔一段时间【事件节点】：定时器触发时结果-1销毁当前种植的植物（教程中通过销毁旧的，生成新的种植物制作植物生长效果）【执行节点】：使用【销毁实体】销毁当前保存的种植物变量条件2、4、6s植物生长状态不同【流程控制节点】：使用【多分支】对定时器阶段进行判断，特定时间进行不同等级的成长结果-2植物生长变化【执行节点】：使用【创建元件】制作植物生长表现结果-3确认种植的植物是哪个（制作生长表现使用）【执行节点】：【设置自定义变量】将生成的种植物保存为变量**定时器跟随挂载目标运行，如果挂载目标被移除/销毁，定时器会默认终止**定时器使用的【拼装列表】是以“第x秒”的顺序逻辑触发，不能输入相等的两个数字，也不能后序数字小于前面的数字 4.【局内编辑器】挂载节点图将配置的节点图挂载在该元件上，保存元件设置 5.【局内编辑器】放置元件，试玩体验将制作好的元件放置在场景中，进入试玩即可体验该功能**更多相关信息可自行查阅【综合指南-定时器组件】课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/拓展功能复刻：制作每隔一段时间可交互的道具，同时不同状态下的特效表现不同 课程回顾：学习配置定时器的方法，可用于制作循环或非循环的各类延时机关道具 或 触发特定事件（每隔x时间触发xx效果）辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-定时器】对照学习",
  "mhz70x0ra8u8": "前言课程说明：课程内容：【组件-跟随运动器】的配置和使用方法学习目标：了解使用跟随运动器制作吸附或定速跟随的道具，可用于制作角色拾取武器、施放跟随性放置技能、吸收掉落物等效果**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读相关信息：推荐学习顺序：【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）跟随运动器——让物体吸附或跟随功能示例-1：角色进入一定范围后，自动拾取附近的物品1.概念简述跟随运动器：通过配置跟随目标、追踪类型，可以让物件以一定规律跟随某个单位 2.教学内容功能效果：角色进入一定区域范围内，可以自动吸附周围道具效果演示：为更直观表现效果，教程以俯视角展示3.操作步骤1.【局内编辑器】添加组件创建一个元件作为交互物（教程以挑战币为例），在面板中点击>>>进入组件页，点击>>>选择【跟随运动器】即可添加 2.【局内编辑器】添加触发器打开【组件-跟随运动器】后，默认配置了一个无跟随目标的跟随运动器，为达到预期的功能效果教程中配置如下：要做的功能对应的配置项道具是以跟随，而不是完全吸附【追踪类型】调整为定速追踪跟随具有一定速度【初始速度】调整大一些**实际配置是可根据自身需要调整初始速度、加速度、加速时长等**由于功能所需的跟随非默认生效而是特定条件“进入一定范围时”，此处初始预设无需进行更多配置，在后续节点图中可调整（会覆盖局内编辑器配置项） 3.【局内编辑器】配置碰撞触发区作为触发条件添加【组件-碰撞触发器】，并添加2个触发器，1个用于检测可拾取范围让道具跟随，1个用于检测拾取到了让道具销毁（即玩家成功拾取）为达到预期的功能效果教程中配置如下： 要做的功能对应的配置项触发器1检测可拾取范围让道具跟随仅玩家单位能触发拾取（物件/造物（怪物）进入区域后不会拾取）【生效目标】调整为仅角色玩家靠近附近可拾取【缩放倍率】调整大一些触发器2检测拾取到了让道具销毁仅玩家单位能触发拾取（物件/造物（怪物）进入区域后不会拾取）【生效目标】调整为仅角色道具与玩家接触拾取成功【缩放倍率】调整小一些 4.【千星沙箱】节点图配置在实体节点图中，添加并配置该元件的节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：  要做的功能对应的配置项功能1玩家靠近一定范围吸附道具触发场景进入范围后可吸附【事件节点】：进入碰撞触发器时（从外部进入，接触到配置的区域时触发）条件进入吸附范围【流程控制节点】：使用【多分支】对触发器序号进行判断**触发器1-范围较大，用于吸附结果道具跟随玩家【执行节点】：使用【切换跟随运动器目标】使玩家周围道具跟随玩家**由于【角色】不具有GUID，所以需要获取【角色归属的玩家的GUID】用于跟随功能2道具贴近玩家时成功拾取触发场景贴近碰撞时可拾取【事件节点】：进入碰撞触发器时（从外部进入，接触到配置的区域时触发）条件进入拾取范围【流程控制节点】：使用【多分支】对触发器序号进行判断**触发器2-范围较小，用于拾取结果拾取道具【执行节点】：使用【销毁实体】制作拾取效果 5.【局内编辑器】挂载节点图将配置的节点图挂载在该元件上，保存元件设置 6.【局内编辑器】放置元件，试玩体验将制作好的元件放置在场景中，进入试玩即可体验该功能**更多相关信息可自行查阅【综合指南-跟随运动器组件】课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/拓展功能复刻：制作放置跟随道具，始终跟随玩家进阶拓展：制作磁铁道具，使用后可吸附周围物品（平常不吸附） 课程回顾：学习配置跟随运动器的方法，可用于制作吸附、跟随某一目标的道具物品或放置类机关技能等辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-跟随运动器】对照学习",
  "mh85mxrh6kfy": "前言课程说明：课程内容：【组件-自定义挂接点】的使用方式学习目标：学会使用自定义挂接点给元件/造物（怪物）/角色添加预设点 或 使用原生点位，用于特定场景下在这一点位生成道具/特效**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）自定义挂接点——实体的骨骼或指定的特定位置功能示例-1：在物件不同位置生成特效，用于引导玩家可进行拾取1.概念简述自定义挂接点：可使用原生点位，或自定义添加特定位置，多用于在特定场景下在此处附加其他单位或特效（如：在角色手部生成火焰，在物件底部生成光效） 2.教学内容功能效果：制作道具引导特效（该功能可完全通过局内编辑器配置实现）效果演示：3.操作步骤1.【局内编辑器】添加组件创建一个元件（教程以凿子为例），在面板中点击>>>进入组件页，点击>>>选择【自定义挂接点】即可添加 2.【局内编辑器】添加挂接点打开【组件-自定义挂接点】后，默认具有原生挂接点（物件仅根节点，造物（怪物）和角色有不同骨骼节点），点击添加自定义挂接点后即可添加，可以修改其名称和位置偏移/旋转 3.【局内编辑器】添加特效在【组件-特效播放组】中添加特效，绑定在不同挂接点，实际制作时也可以根据实际需求灵活调整偏移/旋转完成配置后，可以直接在特效界面进行效果预览 4.【局内编辑器】放置元件，试玩体验将制作好的元件放置在场景中，进入试玩即可体验该功能**更多相关信息可自行查阅【综合指南-挂接点】 拓展应用该模块仅作为教学课程所能拓展应用的功能简述，涉及到多模块联动，以操作步骤演示为主，了解进阶用法即可功能示例-2：拾取道具后在角色特定位置生成该道具功能说明：玩家可拾取道具，拾取后绑定在角色手部，凸显拾取效果效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 实现步骤：1.制作1个可拾取的物件（教程示例延用了功能示例-1的耙子），添加【组件-选项卡】，配置选项“拾取”，配置合适的选项触发区域 2.制作1个用于拾取后添加给玩家的同模物件，添加【组件-跟随运动器】（此处无需额外配置，后续通过节点图控制） 3.【玩家】配置【组件-自定义变量】，添加1个自定义变量，参数如下：变量-拾取的工具是，用于改变变量后发出事件 4.工具的节点图配置“拾取”效果（设置参考见下图），为达到预期的功能效果教程中配置如下：  要做的功能对应的配置项功能拾取道具后销毁原道具，触发玩家拾取事件触发场景进行交互操作后【事件节点】：选项卡选中时（交互选择“任意”选项时触发）条件-1//结果-1拾取后让玩家触发后续事件【执行节点】：将【玩家】变量“装备的工具”改为“耙子”结果-2拾取后道具消失【执行节点】：将拾取的道具销毁 5.【玩家】节点图配置拾取道具后的表现效果（设置参考见下图），为达到预期的功能效果教程中配置如下：  要做的功能对应的配置项功能拾取道具后销毁原道具，触发玩家拾取事件触发场景玩家拾取道具后前置触发通过自定义变量改变【事件节点】：自定义变量变化时条件-1拾取的道具是“耙子”【流程控制节点】：使用【双分支】对新值进行判断，新值为“耙子”时执行后续结果-1拾取后生成新道具【执行节点】：使用【创建元件】在原地创建新的道具结果-2新道具吸附在玩家手上【执行节点】：使用【切换跟随运动器的目标】使刚才创生的道具跟随在玩家的挂接点“RHand”上，配置合适的偏移和旋转 6.将对应的节点图分别挂载在元件和玩家上，保存设置 7.将制作完成的元件摆放在场景中，进入试玩即可体验该功能课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/创新功能复刻：采集果实后，在玩家身前生成采集的果实进阶拓展：采集多个果实时，玩家身前生成的果实逐渐叠加 课程回顾：学会配置自定义挂接点使用原生或预设点位，可用于附加道具或特效辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-自定义挂接点】对照学习",
  "mhtbbb9hr32y": "前言课程说明：课程内容：单位状态的制作和使用方法学习目标：学会制作不同效果的单位状态，并能通过不同事件进行添加/移除（例如：施放技能获得xx增益，走入区域获得xx效果等）**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）单位状态——增益或减益的效果功能示例-1：施放技能获得增益效果1.概念简述单位状态：是一种“已预设好”的可对属性或功能进行增益或减益的效果**目前可用的单位状态效果详见【综合指南-单位状态效果池】 2.教学内容功能效果：制作增加血量上限的单位状态，可以叠加5层，持续时间无限效果演示： 3.操作步骤1.【局内编辑器】添加状态新建一个状态作为增加血量的buff状态，在面板中点击>>>进入战斗预设，点击>>>选择即可添加 2.【局内编辑器】配置面板参数添加状态后可对状态的名称、叠加层数上限、持续时间、状态规则等进行调整，为达到预期的功能效果教程中配置如下： 要做的功能对应的配置项通用信息状态可叠加5层【叠加层数上限】改为“5”状态持续时间无上限【无限持续时间】选项打开效果详细信息每层增加“1000”血量上限效果选择【最大生命值修正值】，设置为“1000”**重要配置项说明：让位状态列表：如果目标已获得其中任意一种单位状态，则本次施加行为会直接终止并失败顶替状态列表：如果目标已获得其中任意一种单位状态，则【所有】列表中的状态均会被移除，随后施加该状态  3.【千星沙箱】节点图配置，制作技能效果在【客户端-技能节点图】中，添加并配置节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：**该节点图挂载在【技能】上  要做的功能对应的配置项功能玩家施放技能时，给自己添加1层状态触发场景施放技能时/条件//结果给自身添加1层加血量上限的状态【执行节点】：使用【施加单位状态】给自身添加1层对应的状态 4.【局内编辑器】添加技能，配置节点图新建技能，将技能节点图挂载在技能上，并将技能配置给对应职业 5.【局内编辑器】试玩体验进入试玩即可体验该功能**更多相关信息可自行查阅【综合指南-单位状态】课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/拓展功能复刻：制作安全区无敌效果，进入安全区则获得无敌效果，离开安全区失效进阶拓展：制作范围光环效果，获得特殊道具后可施放技能，施放后角色周围一定范围内的友方单位获得增益效果，离开范围后增益失效课程回顾：学习如何制作单位状态，并根据实际需要触发添加或移除，例如：可用于跑酷玩法的体力无限、用于解密玩法的超级跳、用于各类RPG玩法的伤害、元素反应倍率加成等辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-单位状态】对照学习",
  "mhc5uurnzzt2": "前言课程说明：课程内容：该课程主要讲解使用信号进行跨节点图通信方法的配置与使用案例。学习目标：学会如何通过配置信号功能来触发不同物件上的节点图。**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读）相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）信号通信——用A实体的事件触发B实体的行为逻辑功能示例-1：使用信号进行全局广播1.概念简述信号：信号可以对全局进行广播，且可以携带多个数据类型的信号参数，是一个全局自定义的结构。 2.教学内容功能效果：制作一个单开关控制多个机关特效显示的效果效果演示： 3.操作步骤1.【局内编辑器】制作开关和机关元件创建一个元件作为开关（教程以挑战起点为例），配置碰撞触发器组件，使其能够在角色进入触发器区域时，触发对应事件。同时创建三个元件作为被触发的机关（教程以柱子为例），不用做额外配置。 2.【千星沙箱】进入碰撞触发器后，发出全局信号在教学演示中，角色进入开关物件的碰撞触发器之后，需要通知其他机关这一事件，机关才能做出相应反应。这里我们使用【信号】来做全局通信，信号的制作方法为：打开千星沙箱>>>新建节点图>>>节点图工具栏中点击“服务器信号管理器”>>>点击“添加信号”>>>将信号名进行修改（教学中将其重名为“激活”）>>>点击“应用修改”。此时一个自定义信号就做好了。角色进入开关物件的碰撞触发器之后，将信号进行全局广播。具体逻辑和节点图连接方法见下，节点图挂载在开关元件上： 要做的功能对应的配置项触发场景角色进入触发盒【事件节点】：进入碰撞触发器时条件//结果全局发送信号【执行节点】：发送信号，信号名选择我们刚刚做好的信号 “激活” 3.【千星沙箱】在其他物件上监听信号，执行不同行为。其次对被触发的机关上进行接收信号的配置（教程演示中机关接收到信号后播放不同的特效，在实际制作中可以选择制作更丰富的执行行为），具体逻辑和节点图连接方法见下，新建3张节点图，节点图分别挂载在3个被触发的机关上。演示中3张节点图的节点完全一致，只有特效资产有区分。 要做的功能对应的配置项触发场景接收全局信号【事件节点】：监听信号，信号选择我们刚刚做好的信号“激活”条件//结果在机关自身播放特效【执行节点】：挂载循环特效；3张节点图的特效资产分别选择不同的特效，以做区分。【查询节点】：获取自身实体 4.【局内编辑器】将物件拖入场景，试玩体验。将配置好节点图的元件拖入场景，点击试玩即可体验。 拓展应用该模块仅作为教学课程所能拓展应用的功能简述，涉及到多模块联动，以操作步骤演示为主，了解进阶用法即可功能示例-2：使用信号携带自定义参数功能效果：进入触发区后，物件跟随进入触发区的角色。效果演示：实现步骤：1.【局内编辑器】制作开关和机关元件创建一个元件作为开关（教程以挑战起点为例），配置碰撞触发器组件，使其能够在角色进入触发器区域时，触发对应事件。创建一个元件作为被触发的机关（教程以建造值吸收器为例），配置跟随运动器组件，教程中跟随具体参数配置见下： 2.【千星沙箱】进入碰撞触发器后，发出全局信号与功能示例-1一致，我们需要制作一个信号：打开千星沙箱>>>新建节点图>>>节点图工具栏中点击“服务器信号管理器”>>>点击“添加信号”>>>将信号名进行修改（教学中将其重名为“发出跟随目标”）信号除了可以向全局广播一个自定义事件同时，还可以携带多个自定义参数，在这个案例里面，除了发出信号事件，我们还需要通过信号来告知机关需要跟随的目标：在“发出跟随目标”信号中，点击“添加参数”>>>修改参数名称为“进入玩家guid”>>>修改参数数据类型为“GUID”>>>点击“应用修改”此时我们就可以发现，在【发送信号】执行节点选择“发出跟随目标”后，会多出一个我们配置的“进入玩家guid”的引脚。这样我们就可以通过这个引脚进行传参和通信了。角色进入开关物件的碰撞触发器之后，将信号进行全局广播。具体逻辑和节点图连接方法见下，节点图挂载在开关元件上： 要做的功能对应的配置项触发场景角色进入触发盒【事件节点】：进入碰撞触发器时条件//结果全局发送信号，带上玩家guid参数【执行节点】：发送信号，信号名选择我们刚刚做好的信号 “发出跟随目标”【查询节点】：获取角色归属的玩家实体，以实体查询GUID；通过获取进入角色归属的玩家实体，并且获取其guid 3.【千星沙箱】在机关物件上监听信号，根据参数执行跟随行为。其次对被触发的机关上进行接收信号的配置（教程演示中机关接收到信号后根据参数进行指定跟踪，在实际制作中可以选择制作更丰富的执行行为），具体逻辑和节点图连接方法见下，新建1张节点图挂载在被触发的机关上。 要做的功能对应的配置项触发场景接收全局信号【事件节点】：监听信号，信号选择我们刚刚做好的信号“发出跟随目标”条件//结果在激活机关跟随，让其跟随指定角色【执行节点】：激活/关闭跟随运动器-是否激活-是；【执行节点】：切换跟随运动器目标；将“跟随目标GUID”引脚与我们制作的“进入玩家guid”引脚进行连接 4.【局内编辑器】将物件拖入场景，试玩体验。将配置好节点图的元件拖入场景，点击试玩即可体验。**更多相关信息可自行查阅【综合指南-节点图】课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻功能复刻：制作一个开关可以控制多个机关运动的效果。课程回顾：学会如何通过信号制作来进行跨节点图通信，制作更丰富的物件联动效果。辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-信号通信】对照学习",
  "mhm1sdi4ckxg": "前言课程说明：课程内容：过滤节点图的基础逻辑与使用方法学习目标：了解如何通过配置过滤节点图用于进行筛选过滤从而对不同物体产生不同效果**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）过滤节点图——对物体进行筛选过滤功能示例-1：选项卡显示过滤，特定条件下看到不同交互项1.概念简述过滤节点图：通过自定义判断规则，对特定标签/对象进行判定，可实现对不同物体进行筛选过滤从而导致不同效果。 特殊：过滤节点图不同于其他节点图，仅会以一个布尔值（是/否）作为返回值，布尔值为【是】时判断通过当前过滤节点图普遍运用于以下三个场景：【选项卡】布尔值为【是】时展示选项——用于展示不同的交互项（制作对不同对象提示引导或可交互等效果）；【命中检测】布尔值为【是】时可命中——用于命中/不命中特定单位（制作狙击枪子弹可穿墙等效果）；【角色扰动装置】布尔值为【是】时可扰动——用于对不同标签的角色造成不同效果 **过滤节点图在【客户端节点图】内进行配置 2.教学内容功能效果：制作交互机关，没有钥匙时提示引导获取钥匙，获取钥匙后可以操作开门效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 3.操作步骤功能原理：过滤节点图通过判定【玩家】变量是否有【钥匙】，展示不同的选项，没有钥匙时引导获取钥匙，有钥匙时可进行开门操作；【玩家】预设自定义变量【是否有钥匙】，类型：布尔值，初始值：否，获取钥匙后改变自定义变量为是；开门后，激活门的基础运动器 1.【局内编辑器】制作物件并添加组件①创建一个元件作为交互物（教程以拉杆为例），添加【组件-选项卡】②创建一个元件作为钥匙，添加【组件-碰撞触发器】③创建一个元件作为门，添加【组件-基础运动器】 2.【局内编辑器】配置面板参数①交互物添加选项卡组件后，添加2个选项卡，并设定不同的文案要做的功能对应的配置项有2个不同的交互项，分别对应【引导提示】和【操作开门】设定2个选项卡的不同文案有一定触发区域【触发选项区域】调整为合适的大小 ②钥匙添加碰撞触发器后调整触发规则要做的功能对应的配置项仅角色能触发拾取操作【生效目标】设定为仅角色有一定触发区域【触发区】调整为合适的形状和大小 ③门添加基础运动器后要做的功能对应的配置项非初始生效，通过开门激活【初始生效】选项关闭向上开门【运动类型】使用匀速直线【详细设置】运动规则调整为合适的速率即可 3.【局内编辑器】添加自定义变量给【玩家】添加自定义变量用于判断是否具有钥匙量要做的功能对应的配置项变量名设置，用于节点图配置使用【变量名】调整为“是否有钥匙”**变量名称不影响其效果，仅作为节点图配置和索引使用，以自己方便记忆的命名配置即可钥匙共具有“拥有、未拥有”2个状态【变量类型】调整为“布尔值”**使用“浮点数”“字符串”等均能满足需要，此处仅为了方便计算使用，可按照自己喜好配置即可初始为“未拥有”状态【初始数值】调整为“否” 4.【千星沙箱】服务器节点图配置①配置【交互物】节点图：**该节点图挂载在【交互物】上  要做的功能对应的配置项功能玩家交互引导提示后，给钥匙增加一个特效引导；交互开门后开门触发场景选择选项卡后，触发事件【事件节点】：选项卡选中时条件根据不同的操作，执行不同的效果【流程控制节点】：使用多分支对“选项序号”进行判断**该教程中，选项序号分别对应：序号1-开门序号2-提示引导结果-1拉杆变化，并且开门【执行节点】：使用【设置预设状态】让拉杆产生简易变化，突出表现【执行节点】：使用【激活基础运动器】开启门上预设的运动器结果-2给钥匙添加一个特效用于提示引导【执行节点】：【挂载循环特效】给钥匙配置一个简单的特效用于引导玩家获取 ②配置【钥匙】节点图：**该节点图挂载在【钥匙】上  要做的功能对应的配置项功能玩家进入钥匙可拾取范围后拾取钥匙触发场景玩家进入一定区域【事件节点】：进入碰撞触发器时条件//结果-1让玩家获取钥匙【执行节点】：使用【设置自定义变量】更改玩家的自定义变量为【是】结果-2钥匙消失，不可重复拾取【执行节点】：使用【销毁实体】将钥匙自身销毁 5.【千星沙箱】客户端节点图配置在【客户端-过滤节点图】中，添加并配置节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：  要做的功能对应的配置项功能-1玩家【有钥匙】时展示触发目标查询进入选项卡触发区的实体的自定义变量【目标实体】=进入选项卡触发区的实体**该实体为角色，切换为玩家再查询自定义变量条件判断进入选项卡触发区域的玩家【有钥匙】运算节点：【是否相等】判断目标实体自定义变量为【是】**注意检查变量类型是否为【布尔值】结果//   要做的功能对应的配置项功能-2玩家【没有钥匙】时展示触发目标查询进入选项卡触发区的实体的自定义变量【目标实体】=进入选项卡触发区的实体**该实体为角色，切换为玩家再查询自定义变量条件判断进入选项卡触发区域的玩家【没有钥匙】运算节点：【是否相等】判断目标实体自定义变量为【否】**注意检查变量类型是否为【布尔值】结果// 6.【局内编辑器】在选项卡组件中添加过滤节点图根据不同的交互项添加对应的过滤节点图开门选项，对应【有钥匙】时可见的过滤节点图引导选项，对应【没有钥匙】时可见的过滤节点图 7.【局内编辑器】挂载节点图将其他配置的服务器节点图挂载在该元件上，保存元件设置 8.【局内编辑器】放置元件，试玩体验将制作好的元件放置在场景中，进入试玩即可体验该功能课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/拓展功能复刻-1：制作特定阵营才能开启的宝箱功能复刻-2：制作特定枪械子弹可穿墙的效果 课程回顾：学会根据不同场景需求制作特定的过滤节点图，用于对不同标签的物件进行筛选 辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-过滤节点图】对照学习   ",
  "mhn4nsiz7k18": "前言课程说明：课程内容：投射物的制作与使用案例。学习目标：学会如何配置投射运动器来制作投射物，以及区分服务器投射物和客户端投射物的区别。**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读。相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）投射运动器——制作复杂运动的投射物功能示例-1：使用投射运动器制作抛物线子弹1.概念简述投射运动器：通过配置投射物类型，使元件能够进行复杂运动（如加速运动、抛物线运动和追踪运动）。 2.教学内容功能效果：制作一个带抛物线的子弹效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主3.操作步骤1.【局内编辑器】添加组件创建一个元件作为子弹（教程以空物件为例），在面板中点击>>>进入组件页，点击>>>选择【投射运动器】即可添加。 2.【局内编辑器】配置投射物面板参数打开【组件-投射运动器】基础设置，选择投射物类型，这里我们选择【抛物线投射物】。定义投射物类型之后，可以鼠标拖动预览中的旋转轴或手动输入参数来对运动配置进行详细设置。为达到预期的功能效果教程中配置如下：要做的功能对应的配置项抛物线与地面呈大约60度角发射，且距离较近。【初始速度】调整为“x=0”“y=8”“z=4”**x轴控制出射时的水平角度，y轴控制出射时的高度，z轴控制出射距离。子弹发射速度较慢。【速率】不做调整**速率会根据初始速度的调整来自动换算， 如果仅调整速率，那么初始速度也会自动换算，在配置时根据自身需要调整即可。【重力加速度】不做调整**重力加速度会影响在同一初始速度/速率下物体的抛物线轨迹和距离，在配置时根据自身需要调整即可。配置完成后，可以点击【预览当前运动】直接预览运动效果。**配置项注意①投射运动器默认在物体创建时立即生效。②投射运动器的其他投射物类型（直线投射物和跟随投射物）推荐阅读综合指南相关章节，在此不做重复介绍。 3.【局内编辑器】增加子弹的效果表现由于我们使用的物件是空物件，因此需要配置一些循环特效来使子弹可见。关于【特效】具体配置方法可以参考往期【特效】相关课程，这里仅做配置参数展示。实际制作时可根据需要自行选择所需元件或特效配置。 4.【千星沙箱】点击选项卡后创建子弹在创建子弹前，需要对发射子弹的炮塔做相关设置。在教学演示中，炮塔的发射功能是通过【选项卡】组件激活的，关于【选项卡】具体配置方法可以参考往期【碰撞与交互】相关课程。配置好选项卡之后，我们希望在触发特定选项时，炮塔把我们刚才制作的子弹发射出去。这里我们要通过【创建投射物】节点来生成子弹，具体逻辑和节点图连接方法见下，节点图挂载在炮塔物件上： 要做的功能对应的配置项功能玩家交互后，炮台发射子弹触发场景选项卡被选中【事件节点】：选项卡选中时条件“开炮！”选项卡被选中【流程控制节点】：双分支&【运算节点】：是否相等，来判断选中的选项序号是否为1结果在炮台的位置和朝向发射子弹【查询节点】：获取实体位置与旋转，获取炮台的位置和朝向；【运算节点】：三维向量加法，由于模型本身旋转和预期发射位置有偏移，因此需要另外计算。【执行节点】：创建投射物，填入我们刚才制作的元件ID创建出投射物。 5.【局内编辑器】放置元件，试玩体验将制作好的炮塔元件放入场景中，点击试玩即可体验该功能。还可以通过自行配置子弹元件的【命中检测】和【能力单元】，制作具备战斗属性的子弹。本地投射物——通过技能创建的投射物功能示例-2：通过本地投射物制作可以发射刀波的技能1.概念简述本地投射物：和投射物运动器效果类似，使物体能够进行复杂投射运动。**注意：本地投射物是由本地（客户端）计算和呈现投射物移动效果、和命中表现效果的。而投射运动器则由服务器计算，因此两者表现以及制作逻辑会有不同。为方便区分，我们可以将“本地投射物称”为【客户端子弹】，“投射物运动器物件”称为【服务器子弹】。服务器子弹可以通过服务器节点图动态创建，但客户端子弹只能通过技能配置客户端节点图来创建。 2.教学内容功能效果：制作一个可以发射刀波的技能效果演示： 3.操作步骤1.【局内编辑器】新建投射物创建一个元件作为子弹（教程以空物件为例），在战斗面板中点击>>>进入本地投射物，点击即可添加。 2.【局内编辑器】配置面板参数在右侧可以看到本地投射物的基础设置面板，首先我们选择投射物基础模型，教程演示使用的刀波是特效，因此这里我们选择【空模型】。设置好基础模型之后，我们需要定义投射物的相关参数，具体的功能和对应配置项见下表：要做的功能对应的配置项子弹的战斗参数跟随创建角色【战斗参数】不做调整，直接继承自创建者子弹不会因时间自己消失【生命周期设置】-【永久持续】开启子弹超过一定范围消失，以节省性能【xyz分量轴销毁距离】-“50.00”子弹消失时不做任何行为【生命周期结束时行为设置】不作调整。 3.【局内编辑器】配置投射物面板参数随后点击进入组件编辑页面，我们可以看到本地投射物已经默认带有【特效】【投射运动器】和【命中检测】，其配置逻辑和上文功能示例-1一致，故不再详细讲解；这里仅做配置展示。要做的功能对应的配置项子弹外观表现为特效刀波【特效】组件选择循环特效，挑选刀波资产子弹运动轨迹为直线，且会加速【投射运动器】-【投射物类型】为“直线投射物”，且加速率、加速时长均为“5”。子弹有命中判定，对进入判定区的每个对象发起命中事件，子弹创建时不立即检测，以免将自身纳入判定范围。【命中检测】-配置和特效宽度一致的命中区域；【触发类型】调整为不重复触发；【延迟检测】调整为“0.5”子弹命中其他对象后，调用能力单元发起攻击【能力单元】创建“直接攻击”能力单元，配置伤害数值。**建议速度配置不宜过快，如果子弹运行速度过快可能会导致穿过造物（怪物）而不造成伤害。 4.【局内编辑器】制作技能动画随后制作刀波技能的对应动画，关于【技能】具体配置方法可以参考往期【技能设置】相关课程，这里仅做配置参数展示。实际制作时可根据需要自行选择所需动画或特效配置。要做的功能对应的配置项子弹需要技能触发【战斗预设】-【技能编辑】-新建技能技能需要攻击动作【动画编辑】-在动画槽位1里选择“单手剑普通攻击”。攻击时角色手持武器【状态轨道】添加“特效播放”，将特效设置为“单手剑“”； 5.【千星沙箱】编辑技能节点图技能节点图的编辑逻辑和功能示例-1基本相同，使用【定点发射投射物】节点即可创建我们做好的本地投射物。 要做的功能对应的配置项功能按下技能后，角色朝前发射子弹触发场景技能被按下/**有默认节点【节点图开始】，无需配置条件--结果在角色前特定挂点位置和朝向发射子弹【查询节点】：获取挂接点位置与旋转，获取角色挂接点的位置和朝向需要注意的是，在教程演示中我们使用了【自定义挂接点】组件，创建了一个在角色正前方的挂点“出射点”。演示中的子弹的生成的位置和旋转都是使用这个自定义挂点。这样设置是保证子弹在射出时，能够一直朝向玩家的面向。节点图编辑好后，直接在动画时间轴内，在对应帧的节点图事件轨道中插入逻辑，保存即可。 6.【局内编辑器】装配技能，试玩体验。随后在职业界面中将刚制作好的技能进行装配，便可以进行试玩体验了。拓展应用该模块仅作为教学课程所能拓展应用的功能简述，涉及到多模块联动，以操作步骤演示为主，了解进阶用法即可功能示例-3：利用投射运动器组件制作开启宝箱后的掉落物表现功能说明：物品抛物线掉落效果演示：思路解析：本质上是通过投射物A命中物体的事件来获取投射物掉落到地面上的坐标，从而在地面上生成一个新的实体B，但由于两者外观一致，因此在观感上可以实现抛物线掉落物品的效果。 实现步骤：1. 创建一个元件A，添加投射物组件，配置抛射物运动——目的是制作物体抛物线的效果2. 为元件配置命中检测，关闭忽略场景和水面——目的是获取投射物命中场景时的坐标3. 创建一个新元件B，配置拾取逻辑。其中A和B的外观表现是一致的，但逻辑不同——目的是玩家可以拾取该道具，具体道具效果可以根据实际需要自行设计，这里不做展示。4. 配置宝箱逻辑，使进入碰撞盒后，生成5个元件A5. 在元件A的节点图中，使用【命中检测触发时】来获取命中位置，同时判断命中实体是否是场景。——目的是在元件A落地位置生成一个外观一致的元件B6. 将制作好的宝箱放入场景，试玩体验效果。 **更多相关信息可自行查阅【综合指南-投射运动器组件】【综合指南-单位-本地投射物】课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/拓展功能复刻：可投掷并造成范围伤害的炸弹进阶拓展：制作朝角色面向位置发射子弹的技能 课程回顾：学会如何通过基础设置、节点图创建来制作多种投射物，制作多种子弹伤害效果。辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-投射运动器】对照学习",
  "mh8wpr0h7ywg": "前言课程说明：课程内容：能力单元的制作与使用案例学习目标：学会如何配置能力单元来制作机关**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）能力单元——制作具有战斗属性的机关功能示例-1：使用能力单元制作造成伤害的机关1.概念简述能力单元：进行封装的特殊能力（如：攻击、销毁、播放特效等），可直接通过修改参数快捷使用 2.教学内容功能效果：制作一个靠近后会造成伤害的荆棘效果演示：3.操作步骤1.【局内编辑器】添加能力单元创建一个作为造成伤害的机关（教程以荆棘为例），在物件面板中点击>>>进入战斗属性页，找到【能力单元】>>>选择【详细编辑】>>>点击即可添加一个新的能力单元。 2.【局内编辑器】配置面板数据在新建能力单元中，点击名称旁的进行重命名。由于后续节点图中对能力单元的调用依赖的是【名称】，重命名方便后续管理和调用（教学中重命名为“荆棘攻击”，实际使用时根据自身需要灵活调整即可） 随后可在【能力单元类型】中选择具体的能力单元。教学中以荆棘对玩家造成伤害为例，因此选择“直接攻击”。能力单元类型对应的能力说明攻击盒攻击以指定目标或位置为基准，发起一次攻击盒攻击。攻击盒碰撞到实体的受击盒时，会对实体发起一次攻击直接攻击对指定目标发起一次直接攻击恢复生命为目标恢复一定的生命定义能力单元类型后，即可配置具体的攻击参数，这里教学演示中的配置如下，可根据实际需要对数值进行修改。 3.【局内编辑器】配置碰撞触发器能力单元的触发依赖触发事件，教程中以【玩家靠近特定区域后触发】，使用碰撞触发器为例，在荆棘上配置碰撞触发器。 4.【千星沙箱】进入碰撞盒后发起攻击教程中使用【进入碰撞触发器时】事件触发能力单元调用。 要做的功能对应的配置项功能进入区域后，受到荆棘造成的伤害触发场景进入触发区域【事件节点】：进入碰撞触发器时条件//结果对进入者造成伤害【执行节点】：发起攻击**“是否覆写能力单元配置”为“是”时，节点图配置的“伤害系数”和“伤害增量”会覆盖局内编辑器已经预设的值；反之不覆盖**能力单元填写之前给能力单元命名的字符串“荆棘攻击” 5.【局内编辑器】将节点图挂载到元件中，将其拖入场景，进入试玩。至此能力单元调用逻辑也配置完成，把节点图挂载在荆棘元件上保存，将其拖入场景即可体验相应功能。拓展应用该模块仅作为教学课程所能拓展应用的功能简述，涉及到多模块联动，以操作步骤演示为主，了解进阶用法即可功能示例-2：制作进入区域后，持续回血的平台功能说明：持续回血的平台效果演示： 思路解析：通过定时器的循环来持续调用物件上的能力单元，制作持续伤害效果。 实现步骤：1.创建一个平台元件，配置能力单元，能力单元类型选择恢复生命，重命名为“持续恢复” 2.为平台配置碰撞触发器 3.在节点图中，配置一个循环定时器，使有实体进入触发器时，能够触发定时器，同时将进入者存为变量。 4.定时器触发时接入【恢复生命值】节点，配置恢复量和能力单元名称 5.为了让角色离开平台后不持续回血，还可以增加一个【离开碰撞触发器时】事件，将启动的定时器终止。 6.将制作好的平台放入场景，试玩体验效果。**更多相关信息可自行查阅【综合指南-能力单元】课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/拓展功能复刻：制作会对进入角色造成伤害进阶拓展：制作可以对造物（怪物）造成持续伤害的灼烧区域 课程回顾：学会如何通过能力单元类型设置、碰撞触发器、节点图组合，可制作更丰富的战斗表现。辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-能力单元】对照学习",
  "mhsdgyi53pz0": "前言课程说明：课程内容：命中检测组件与受击盒配置与使用案例。学习目标：学会如何配置命中检测组件和受击盒来制作攻击命中的效果。**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读。 相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）命中检测——定义实体的命中区域功能示例-1：使用命中检测制作造成伤害的子弹1.概念简述命中检测组件：定义实体的命中区域，用于判断定义的区域是否命中场景或其他实体，多数情况用于制作子弹命中判定。 2.教学内容功能效果：制作可以命中造物（怪物）的子弹。效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 3.操作步骤1.【局内编辑器】添加组件创建一个元件作为子弹（教程以空物件为例），在面板中点击>>>进入组件页，点击>>>选择【命中检测】即可添加。 2.【局内编辑器】配置面板数据在新建的命中检测组件中，点击“详情”对命中检测规则和区域进行详细配置。首先我们先设置命中区域，点击“命中区域”页签，点击“添加触发区”即可配置生效区域。其次对命中规则进行配置，点击“命中规则”页签，为达到预期的功能效果，教程中配置如下。要做的功能对应的配置项命中检测对场景和水面不生效【是否忽略场景和水面】开启对进入区域的实体都触发1次命中【触发类型】选择“不重复触发”在创生时命中检测延迟激活【检测延迟时间】调整为“0.50”如此配置之后，子弹在命中非场景和水面的实体时，便会触发命中检测事件了。但还不会对命中实体造成伤害，这是由于我们还没有设置“命中时执行能力单元”，因此我们还需要设置子弹的能力单元。在子弹面板中点击>>>进入战斗属性页，找到【能力单元】>>>选择【详细编辑】>>>点击即可添加一个新的能力单元。其次对能力单元进行配置，为达到预期的功能效果，教程中配置如下。要做的功能对应的配置项给能力单元命名点击详情页的按钮，将能力单元名改为“子弹造成伤害”对命中的实体造成范围伤害【能力单元类型】设置为攻击盒攻击【目标筛选】“目标阵营筛选”选择“除自身外全部”【攻击参数】伤害系数为“1.00”；伤害增量为“100.00”在命中的实体上播放爆炸特效【命中表现】命中场景特效和命中目标特效都选择“爆炸_地面”此时命中单元就配置完成了，我们回到“命中检测”组件详情页面，在“命中触发设置”中点击“添加能力单元”，将我们刚刚配置好的能力单元添加即可。**命中触发设置可以不依赖节点图，直接在命中检测时调用能力单元；但如制图中有特殊需求，也可以在节点图中继续监听并重复/额外调用能力单元，本教学不涉及。至此，子弹的战斗能力就已经做好了，在命中非场景和水体的实体时，会触发命中事件且造成伤害。 3.【局内编辑器】完善子弹表现。除此之外，我们还需要给子弹添加【特效】和【投射运动器】组件，使其在外观和运动表现上更符合子弹的特征。关于【投射运动器】组件的相关知识可以查阅往期教程【投射运动器——制作一个能发射的子弹】，这里仅简单罗列对应配置项。要做的功能对应的配置项使子弹可见【特效】组件，添加“火箭丘丘人_炸弹_拖尾”特效使子弹直线运动【投射运动器】设置为“直线投射物”初始速度为“x=0.00，y=0.00，z=15.00”，速率为“15.00”，加速率为“10.00”，贴地运动为关闭。 4.【局内编辑器&千星沙箱】制作可以发射子弹的炮台子弹需要被发射出去，因此还需要制作一个可以发射子弹的炮台，炮台的制作方法可以查阅往期教程【投射运动器——制作一个能发射的子弹】，这里仅简单罗列对应配置项。要做的功能对应的配置项炮塔模型在元件库中，选择“大炮”，将其作为炮塔元件。炮塔可以交互添加组件【选项卡】，添加选项并重命名为“开炮！”进入千星沙箱创建节点图，使选项卡被点击之后，在炮口创建子弹并发射。节点图挂载在炮台上。 要做的功能对应的配置项功能选中选项后，炮台发射子弹触发场景选项卡被选中【事件节点】：选项卡选中时条件//结果在炮台的位置和朝向发射子弹【查询节点】：获取实体位置与旋转，获取炮台的位置和朝向；【运算节点】：三维向量加法，由于模型本身旋转和预期发射位置有偏移，因此需要另外计算。【执行节点】：创建投射物，填入我们刚才制作的子弹元件ID创建出投射物。 5.【局内编辑器】将物件拖入场景，添加造物（怪物）试玩体验。受击盒——使实体可以被攻击功能示例-2：使用受击盒制作可被攻击的标靶1.概念简述受击盒组件：定义实体的受击区域，使实体能被攻击；非造物（怪物）/角色单位默认没有受击盒，因此需要额外添加才能被攻击。 2.教学内容功能效果：制作一个可被击打的标靶效果演示： 3.操作步骤1.【局内编辑器】配置受击盒面板参数创建一个元件作为标靶（教程以坏坏法师靶为例），在面板中点击>>>进入战斗预设页>>>找到【受击盒设置】选择“详细编辑”>>>点击后，再点击“添加受击盒”即可配置受击盒区域。 2.【局内编辑器】配置受击效果配置好受击盒后，实体就已经可以被攻击了，为了增加受击效果，我们可以给标靶配上受击特效。在面板中点击>>>进入战斗预设页>>>找到【战斗设置】选择“详细编辑>>>在“受击特效”中选择资产即可。 3.【局内编辑器】将物件拖入场景，试玩体验将做好的标靶拖入场景当中，即可试玩体验。**更多相关信息可自行查阅【综合指南-能力单元】课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻功能复刻：制作可以造成伤害以及可被攻击的物体课程回顾：学会如何通过命中检测组件和受击盒组件制作更丰富的战斗单位。辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-命中与受击】对照学习",
  "mh0mrr0c4xps": "前言课程说明：课程内容：铭牌与气泡对话组件的制作与使用案例学习目标：了解如何配置场景3DUI（铭牌/气泡对话），制作游戏中的引导信息等（如：血量、文字提示、任务指引、导航标识等）**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读。相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）铭牌——游玩时，场景界面中的可视化信息功能示例-1：制作常驻显示的指引提示1.概念简述铭牌：通过配置类型、内容与导航指引，可制作例如：生命值、等级等可视化信息展示，也可以提供方向指引、距离显示等提示引导表现。 2.教学内容功能效果：制作一个常驻显示的任务指引，当玩家靠近一定范围后，a有导航提示距离与方向，接近后提示任务信息效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主3.操作步骤1.【局内编辑器】添加组件①创建一个元件作为任务NPC（教程以积木玩偶为例），在面板中点击>>>进入组件页，点击>>>选择【铭牌】即可添加 ②此外，为了便于快速调整铭牌的生效位置（铭牌的生效位置可配置于自定义挂接点），添加“自定义挂接点”组件 2.【局内编辑器】添加自定义挂接点打开【组件-自定义挂接点】后，点击下方添加自定义挂接点即可添加（按需设置其“名称”、“偏移”、“缩放”） 3.【局内编辑器】添加铭牌打开【组件-铭牌】后，点击即可添加，可以修改其“挂点”、“可见半径”、“类型”、“导航指示器”等设置 4.【局内编辑器】配置面板参数添加【铭牌】后可对铭牌与导航指示器进行调整，为达到预期的功能效果教程中配置如下：要做的功能对应的配置项铭牌在头顶显示【挂点】调整为“头顶”**头顶为此前预设的自定义挂点的名称，根据实际配置选择即可靠近一定范围可以看到铭牌信息提示【可见半径】调整为“5”**根据实际需要设定即可铭牌有文字与图标提示添加2个铭牌内容；【类型】分别设置为“文本框”和“图标”**根据实际需要设定文字与图标内容与位置偏移即可在一定范围内给玩家导航引导（用于提示方向）启用导航指示器并进行设置【最大可见半径】与【最小可见半径】导航指示器有文字（显示与玩家距离）与图标提示添加2个指示器内容；【类型】分别设置为“文本框”和“图标”显示距离通过【插入变量-数据-与玩家距离】实现**根据实际需要设定文字与图标内容与位置偏移即可 5.【局内编辑器】放置元件，试玩体验将制作好的元件放置在场景中，进入试玩即可体验该功能**更多相关信息可自行查阅【综合指南-组件-铭牌】气泡对话——游玩时，场景界面中的对话信息功能示例-2：制作一段循环播放的引导对话1.概念简述气泡对话：通过配置气泡文本，可便捷制作可视化的对话信息表现。 2.教学内容功能效果：制作一段循环播放的对话信息，当玩家靠近一定范围后可以看见这段对话效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 3.操作步骤1.【局内编辑器】添加组件①创建一个元件作为任务NPC（教程以积木玩偶为例），在面板中点击>>>进入组件页，点击>>>选择【文本气泡】即可添加 ②此外，为了便于快速调整铭牌的生效位置（铭牌的生效位置可配置于自定义挂接点），添加“自定义挂接点”组件 2.【局内编辑器】添加自定义挂接点打开【组件-自定义挂接点】后，点击下方添加自定义挂接点即可添加（按需设置其“名称”、“偏移”、“缩放”） 3.【局内编辑器】添加气泡文本打开【组件-气泡】后，通过【添加气泡文本】可添加新的对话内容，用于制作完整的长段对话（此处教程中以制作多段对话为例进行演示）。此外，点击可添加新的气泡（用于切换全新的对话内容），教程中不额外演示。**气泡对话组件同一时间仅生效1个气泡对话 4.【局内编辑器】配置面板参数添加【铭牌】后可对铭牌与导航指示器进行调整，为达到预期的功能效果教程中配置如下：要做的功能对应的配置项气泡在头顶显示【挂点】调整为“头顶”根据需要调整偏移位置**头顶为此前预设的自定义挂点的名称，根据实际配置选择即可靠近一定范围可以看到气泡对话【可见半径】调整为“5”**根据实际需要设定即可气泡有文字引导内容添加2个气泡文本；设置“文本框”内容**根据实际需要设定文字内容即可循环播放该段对话【是否循环播放】开启 5.【局内编辑器】放置元件，试玩体验将制作好的元件放置在场景中，进入试玩即可体验该功能**更多相关信息可自行查阅【综合指南-组件-气泡对话组件】 拓展应用该模块仅作为教学课程所能拓展应用的功能简述，涉及到多模块联动，以操作步骤演示为主，了解进阶用法即可功能示例-3：任务引导标识和气泡对话的组合应用功能说明：玩家靠近一定距离后提示任务标识，靠近后提示可与NPC对话，交互后NPC播放对话内容效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 实现步骤：1.制作1个元件作为任务NPC（教程以积木玩偶为例），添加【组件-选项卡】，配置选项“打招呼”，配置合适的选项触发区域 2.添加【组件-自定义挂接点】，添加一个自定义挂接点，根据需要配置其位置偏移 3.添加【组件-铭牌】，配置铭牌的图标、文本与导航指示器（与本教程功能示例1配置一致，此处不额外演示） 4.添加【组件-气泡】，配置气泡的文本内容（与本教程功能示例2配置一致，此处不额外演示）需要注意：由于该功能的气泡是通过主动交互显示，因此需关闭初始生效的气泡 5.NPC的节点图配置“交互后播放气泡对话”效果（设置参考见下图），为达到预期的功能效果教程中配置如下：**该节点图挂载在【NPC元件】上  要做的功能对应的配置项功能交互选项后，播放气泡对话触发场景进行交互操作后【事件节点】：选项卡选中时（交互选择“任意”选项时触发）条件//结果播放气泡对话【执行节点】：让NPC播放气泡对话1 6.将节点图分别挂载在元件上，保存设置 7.将制作完成的元件摆放在场景中，进入试玩即可体验该功能课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/拓展功能复刻：制作采集、打怪类的任务指引提示进阶拓展：制作简易的任务系统，玩家靠近区域提示可接取任务，交互后播放任务信息提示气泡文本；完成任务再次交互后，切换为完成任务的信息提示气泡文本 课程回顾：学习如何使用【组件-铭牌】或【组件-气泡】制作可视化信息内容，可用于制作各类文本、图标、进度等场景信息样式辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-铭牌与气泡对话】对照学习",
  "mhfpf0rhlaeu": "前言课程说明：课程内容：卡牌选择器的制作与使用案例学习目标：了解如何添加配置卡牌选择器，制作选择弹窗和选项卡片，通过特定事件触发，在选择后获得对应效果。可用于制作肉鸽类游戏的随机道具、升级后的随机效果等（例如：3选1，4选2等）**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）卡牌选择器——可进行卡片选择交互的选项弹窗功能示例-1：3选1选项弹窗1.概念简述卡牌选择器：一个特殊的界面控件类型，通过配置卡牌选择器和卡牌面板，制作自定义的交互卡片选项，可通过节点图触发开关 2.教学内容功能效果：制作3选1选项弹窗，玩家点击交互按钮后打开选项弹窗，选择后获得对应效果效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主3.操作步骤1.【局内编辑器】添加卡牌选择器点击局内编辑器左上角（或直接按ESC键）>>>呼出左侧面板-ESC菜单栏，点击>>>进入界面控件编辑界面，在【界面控件组库】中添加预制模版>>>选择【卡牌选择器】 2.【局内编辑器】配置控件参数配置【页面设置】与【选项配置】的信息，并保存设置为达到预期的功能效果教程中配置如下：要做的功能对应的配置项选项提示信息【页面设置-标题文本】直接输入“请在以下3项中选择1项”必须选择其中之一，不能放弃选项【页面设置-可放弃选择】关闭配置选项卡牌与卡牌文本【选项配置-卡牌库设置-详情编辑】根据实际所需，添加卡牌，并修改其“类型”、“图标”、“标题”、“描述”等信息 3.【局内编辑器】添加触发开关教程中为了方便，以点击交互按钮打开弹窗为例在【界面布局】中添加预制模版>>>选择【交互按钮】 4.【局内编辑器】添加自定义挂接点（**此处配置仅便于表现，与实际功能作用无关）为了便于教程演示，添加一个角色背部挂接点，配置合适的位置偏移，用于直接配置装备法器后的效果 5.【千星沙箱】节点图配置在实体节点图中，添加并配置玩家的节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：**该节点图挂载在【玩家】上  要做的功能对应的配置项功能-1玩家点击交互按钮后，打开3选1弹窗触发场景点击按钮后，触发事件【事件节点】：界面控件组触发时条件//结果打开3选1弹窗【执行节点】：使用【唤起卡牌选择器】制作打开弹窗的效果**决策结果/选项对应列表=卡牌ID**决策数量上限/下限影响在本次选择中可选择的选项数量功能-2选择选项后，获得对应选项的效果触发场景选择选项后【事件节点】：卡牌选择器完成事件条件-1完成的是对应的卡牌选择器使用双分支判断卡牌选择器索引**存在多个卡牌选择器时需要进行判断条件-2是玩家选择完成影响使用双分支判断完成原因**避免由于超时等其他原因导致触发事件条件-3判断选择的卡牌选项是哪个使用多分支判断选择结果**因为存在多选结果，返回的是列表，通过取列表的值判断结果根据选择的卡牌执行对应结果教程中以添加武器特效为例，实际制作时可按照需求自由制作不同效果 6.【局内编辑器】挂载节点图将配置的节点图挂载在玩家上 7.【局内编辑器】试玩体验进入试玩即可体验该功能**更多相关信息可自行查阅【综合指南-卡牌选择器】 拓展应用该模块仅作为教学课程所能拓展应用的功能简述，涉及到多模块联动，以操作步骤演示为主，了解进阶用法即可功能示例-2：4选2选项弹窗（含随机效果制作）功能说明：开启宝箱后，弹出4选2弹窗，玩家点击交互按钮后打开选项弹窗，选择后获得对应效果；其中有一个卡片为随机效果（通过节点图自定义其逻辑） 效果演示：**随机卡片效果为：进行生命值扣除，扣除值为随机数**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 实现步骤：1.在【界面控件组库】中添加预制模版>>>选择【卡牌选择器】，添加新的卡牌选择器 2.添加【玩家】自定义变量名称：获得的未知卡片效果；类型：整数；初始值：0 3.在【界面控件组库】中添加预制模版>>>选择【文本框】，作为选择隐藏卡片的效果提示，展示信息为：你已获得随机效果：生命值扣除【玩家自身.获得的未知卡片效果】 4.配置卡牌选择器控件参数配置【页面设置】与【选项配置】的信息，并保存设置 5.制作一个宝箱作为触发元件，添加【选项卡】组件，并配置选项卡信息与触发选项区域 6.制作开启宝箱触发弹窗的节点图**该节点图挂载在【宝箱】上  要做的功能对应的配置项功能-1玩家交互宝箱后，打开宝箱，并打开4选2弹窗触发场景交互选项后，触发事件【事件节点】：选项卡选中时条件//结果-1打开4选2弹窗【执行节点】：使用【唤起卡牌选择器】制作打开弹窗的效果**决策结果/选项对应列表=卡牌ID**决策数量上限/下限影响在本次选择中可选择的选项数量结果-2选项卡不能重复交互（避免宝箱被打开多次）【执行节点】：使用【激活/关闭选项卡】，将该交互选项关闭结果-3宝箱有打开的效果【执行节点】：使用【设置预设状态】更改宝箱的状态 7.制作选择4选2弹窗卡片后的节点图**该节点图挂载在【玩家】上  要做的功能对应的配置项功能选择选项后，获得对应选项的效果触发场景选择选项后【事件节点】：卡牌选择器完成事件条件-1完成的是对应的卡牌选择器使用双分支判断卡牌选择器索引**存在多个卡牌选择器时需要进行判断条件-2是玩家选择完成影响使用双分支判断完成原因**避免由于超时等其他原因导致触发事件条件-3判断选择的卡牌选项是哪个使用多分支判断选择结果**因为存在多选结果，返回的是列表，通过取列表的值判断结果-1确认选择的卡牌是哪个由于4选2返回的是两个选项的列表，因此需要用到【列表迭代循环】+【多分支】判断选择的2个选项是哪个结果-2根据选择的卡牌执行对应结果-1已知卡牌为添加特效教程中以添加特效为例，实际制作时可按照需求自由制作不同效果结果-3根据选择的卡牌执行对应结果-2未知卡牌为扣除生命值教程中以【损失生命值】为例，并通过界面控件的文本框展示 8.将节点图分别挂载在元件上，保存设置 9.将制作完成的元件摆放在场景中，进入试玩即可体验该功能课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/拓展功能复刻：制作“网格”类型的选项弹窗课程回顾：学习如何使用【卡牌选择器】，便捷制作选项弹窗，用于各类肉鸽玩法中的随机道具、装备、效果选择等辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-卡牌选择器】对照学习",
  "mhg6ak9g62oy": "前言课程说明：课程内容：数据结构中，字典与结构体的概念介绍与使用方法学习目标：了解什么是字典、结构体，通过配置具有映射关系的数据结构，进行复杂逻辑中的变量存储与使用。1、字典可用于存储一组具有映射关系的数据。例如：在派对游戏中，记录场上所有玩家的分数；不使用字典时，需创建多个自定义变量，分别代表每个玩家的分数；使用字典时，可以建立一个实体与整数的字典，分别代表玩家实体与其对应的分数；2、结构体可用于多种数据的组合存储与使用。例如：在RPG玩法中，制作一个具有多种属性的【武器】，需要包含的数据信息有【武器名称】（字符串）、【攻击力】（浮点数）、【是否已强化】（布尔值）三个字段，可以通过结构体进行存储与使用。**该课程中涉及【局内编辑器面板配置】和【千星沙箱具节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）字典——一组具有映射关系的数据结构功能示例-1：制作一个字典，存储多个不同物体的积分值，根据拾取的物品获得对应的积分值1.概念简述字典：通过配置【键】和【值】，构建数据类型A与数据类型B的映射关系，在实际游戏过程中可进行动态查询与使用。 2.教学内容功能效果：制作多个可被拾取的物体，分别具有不同的积分值，拾取后获得积分值不同效果演示：**获取的积分值，以玩家界面控件的UI显示文本展示（4个物品对应积分值分别+1、+2、+3、+4）**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 3.操作步骤1.【局内编辑器】制作4个不同的物体，添加自定义变量作为其标识创建4个元件作为可拾取道具（教程以禽肉、松茸、鱼肉、果实堆为例），在【自定义变量】组件中添加变量作为标识**教程中4个元件的做法一致，仅初始值根据不同元件设置，此处以禽肉为例 2.【局内编辑器】添加组件，让4个道具可拾取给4个元件分别添加【碰撞触发器】组件，添加触发区并设置其参数**教程中4个元件的做法完全一致，此处以禽肉为例 3.【局内编辑器】制作字典由于功能需要，该字典需要具备全局查询能力，因此字典配置在【关卡实体】上，添加自定义变量，设置参数如下：变量名称：物品积分表变量类型：字典键类型：字符串，值类型：整数字典列表分别为“物品名称”与其对应的“积分值” 4.【局内编辑器】制作积分显示效果①给【玩家】添加自定义变量，配置如下变量-1，名称：积分值；类型：整数；初始值：0变量-2，名称：拾取到的物品；类型：字符串；初始值默认 ②创建并添加界面控件【文本框】，设置文本内容为：你已拾取到【玩家自身变量-拾取到的物品】，获得积分值【+玩家自身变量-积分值】 5.【千星沙箱】节点图配置在实体节点图中，添加并配置元件的节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：**该节点图挂载在【4个可拾取元件】上  要做的功能对应的配置项功能玩家进入拾取范围后拾取物品，根据物品增长积分值触发场景进入拾取范围后，触发事件【事件节点】：进入碰撞触发器时条件//结果-1修改玩家显示的积分值【执行节点】：使用【设置自定义变量】查询关卡实体的字典，通过匹配触发器实体的【自定义变量-名称】查询其对应的积分值结果-2修改玩家显示的获取道具【执行节点】：使用【设置自定义变量】由于已经设置物品的【自定义变量-名称】，直接使用该变量替换玩家的变量即可结果-3物品拾取后消失【执行节点】：使用【销毁实体】销毁被拾取的物品实体 6.【局内编辑器】挂载节点图将配置的节点图挂载在该元件上，保存元件设置 7.【局内编辑器】放置元件，试玩体验将制作好的元件放置在场景中，进入试玩即可体验该功能**更多相关信息可自行查阅【综合指南-节点图高级特性-字典】 结构体——将多个不同类型的变量整合的复合数据类型功能示例-2：根据拾取的装备获得对应的属性加成1.概念简述结构体：特殊的自定义数据类型，可将多个不同类型的变量整合在一起，通常用于表示具有多个属性类型的对象（如：包含各类属性、词条加成的装备/道具等）。 2.教学内容功能效果：制作3个不同等级的装备，根据拾取不同等级的装备，获取对应的属性值效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主**获得的装备属性，以玩家界面控件的UI显示文本展示对应属性值：1级装备，攻击力+10，防御力+10，生命值+100；2级装备，攻击力+20，防御力+20，生命值+200；3级装备，攻击力+30，防御力+30，生命值+300 3.操作步骤1.【局内编辑器】制作3个物体，作为不同等级的装备创建3个元件作为可拾取装备（由于目前缺少物件模型，教程以为“空物件+特效”例，并通过模型缩放表示不同等级的装备）**教程中3个元件的做法一致，仅【自定义变量】与【特效缩放】差异，此处仅以1级和2级装备为例①在【自定义变量】组件中添加变量作为等级标识变量名：等级变量类型：整数初始值：根据所设定的元件设置（如：1级大剑的初始值=1；2级大剑的初始值=2） ②在【特效播放】组件中，添加【循环特效】，选择对应特效，并配置缩放、偏移、旋转（为了便于区分，仅保持缩放与偏移差异）缩放比例：根据所设定的元件设置（如：1级大剑=1；2级大剑=1.5）偏移：根据所设定的元件设置（如：1级大剑=1.5；2级大剑=2）旋转：3个元件旋转设置一致 ③添加【碰撞触发器】组件，用于碰撞后触发获取装备的事件 2.【局内编辑器】添加结构体点击局内编辑器左上角（或直接按ESC键）>>>呼出左侧面板-ESC菜单栏，点击>>>进入界面，点击添加结构体>>>在右侧设置结构体内存储的自定义变量>>>完成设置后，点击保存结构体为达到预期的功能效果教程中配置如下：**教程中设置的结构体为装备属性的初始数值，用于后续获取不同等级的装备后的数值计算【x等级的装备属性】=【x等级】*【结构体的初始值】如：2级装备的属性=2*初始值 3.【局内编辑器】制作积分显示效果①给【玩家】添加自定义变量，配置如下变量-1，名称：装备的等级；类型：整数；初始值：0变量-2，名称：攻击力加成；类型：浮点数；初始值：0变量-3，名称：防御力加成；类型：浮点数；初始值：0变量-4，名称：生命值加成；类型：浮点数；初始值：0 ②创建并添加界面控件【文本框】，设置文本内容为：装备等级是：【玩家自身变量-装备的等级】攻击力加成：【玩家自身变量-攻击力加成】防御力加成：【玩家自身变量-防御力加成】生命值加成：【玩家自身变量-生命值加成】 4.【千星沙箱】节点图配置在实体节点图中，添加并配置元件的节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：**该节点图挂载在【3个可拾取元件】上  要做的功能对应的配置项功能玩家进入拾取范围后拾取物品，根据物品增长积分值触发场景进入拾取范围后，触发事件【事件节点】：进入碰撞触发器时条件//结果-1修改玩家显示的获取装备等级【执行节点】：使用【设置自定义变量】由于已经设置物品的【自定义变量-等级】，直接使用该变量替换玩家的变量即可结果-2修改玩家显示的攻击力/防御力/生命值加成【执行节点】：使用【设置自定义变量】获取触发器实体的【自定义变量-等级】，通过【拆分结构体】计算各等级装备的属性结果-3物品拾取后消失【执行节点】：使用【销毁实体】销毁被拾取的物品实体 6.【局内编辑器】挂载节点图将配置的节点图挂载在该元件上，保存元件设置 7.【局内编辑器】放置元件，试玩体验将制作好的元件放置在场景中，进入试玩即可体验该功能**更多相关信息可自行查阅【综合指南-节点图高级特性-结构体】课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/拓展进阶拓展：通过字典与结构体的结合使用，制作RPG玩法中的装备系统设定各装备类型、名称、等级、属性等参数课程回顾：学习如何使用字典与结构体制作具有映射关系的数据结构，用于功能逻辑中复杂的变量存储与使用 辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-字典与结构体】对照学习 ",
  "mh1t3z9s7hne": "前言课程说明：课程内容：该课程主要包括掉落物、道具和背包的制作与使用案例。学习目标：学会如何配置掉落物、道具和背包来制作可被拾取进背包的道具，并且在背包中使用。**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读。相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅）关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）掉落物与道具——制作可掉落的道具功能示例-1：制作一个被销毁后会产生掉落道具的机关1.概念简述掉落物：可以掉落在场景中的虚拟物品，通常用于制作可拾取的装备、消耗品、货币等。道具：可以被角色获取、使用、交易的虚拟物品。 2.教学内容功能效果：制作一个销毁后掉落禽肉的机关效果演示：3.操作步骤 1.【局内编辑器】创建一个掉落物创建一个预设掉落物作为掉落道具（教程以禽肉为例），在元件库面板中点击>>>进入掉落物页，点击预设中的【挑战币掉落物】>>>点击【模型】>>>选择【禽肉】即切换掉落物模型>>>点击【保存】即可添加一个新的掉落物。掉落物会默认携带【掉落物组件】，在面板中点击>>>进入组件页便可以看到【掉落物组件】，为达到预期的功能效果，教程中配置如下：要做的功能对应的配置项掉落物通过交互项来拾取【拾取规则】——选择“交互拾取“掉落物掉落时有落地动画【开启掉落动画】——选择“开启“掉落物通过其他物体销毁来掉落，不会直接放在关卡中【掉落内容】——可以不配置如果掉落物直接放置在关卡中，则掉落内容需要进行配置，否则无法进行交互。如果掉落物是通过其他物体销毁来掉落，则掉落内容是在对应物体的【固定掉落物组件】里面进行配置，具体配置方法见下文。 2.【局内编辑器】新建道具此时我们仅配置了掉落物的模型，但是还未将道具和掉落物两者关联起来，因此我们还需要配置【禽肉】对应的道具：在战斗预设面板中，点击>>>进入道具配置页，点击【新建道具】>>>在弹窗中选择对应的道具图标>>>设置道具的基本信息，如名称、类型、品质等（教学中将禽肉设置为普通道具，品质为绿色）>>>确认创建。在创建后的道具详情页中，找到【掉落设置】，在“对应掉落物”>>>“点击配置掉落物”，选择我们刚做好的掉落物【禽肉】。为达到预期的功能效果，教程中配置如下：要做的功能对应的配置项道具可以被消耗【在背包中的分类】——选择“消耗品“道具持有实体在被销毁时，会掉落道具【归属者销毁时的道具处理】——选择“掉落“1个玩家捡取此道具后，其他玩家不能捡取【掉落类型】——选择“共享掉落“ 3.【局内编辑器】新建销毁后可掉落道具的机关在元件库中，创建一个实体作为可销毁的机关（教程以雀雀球为例），在面板中点击>>>进入组件页，点击>>>选择【固定掉落物组件】即可添加。点击【固定掉落物组件】中的详细编辑进行具体配置，为达到预期的功能效果，教程中配置如下：要做的功能对应的配置项掉落3个禽肉但只显示1个禽肉掉落物模型【归属者销毁时道具处理】——选择“集体掉落“掉落后的禽肉被某个玩家拾取后，其他玩家不能再拾取【掉落类型】——选择“共享掉落“掉落物模型为我们刚设置好的禽肉模型【对应掉落物】——选择之前制作的掉落物“禽肉“销毁后掉落道具固定为3个禽肉【固定掉落配置】——选择之前制作的道具“禽肉“，数量选择“3” 4.【局内编辑器】给机关设置销毁逻辑给刚刚配置好掉落逻辑的机关（教程以雀雀球为例）添加一个销毁逻辑，为便于快速展示效果，教程以：有实体进入雀雀球的碰撞触发区便立即销毁为例。实际制作时可根据玩法需求，用其他方式来实现销毁效果。①给雀雀球配置【碰撞触发器组件】并配置好触发区。 5.【千星沙箱】编写销毁逻辑的节点图需要一个编写节点图来销毁掉对应的实体，我们需要通过碰撞触发器来触发该节点图。制作好的节点图挂载在“雀雀球”元件上。  要做的功能对应的配置项功能进入碰撞触发区唤出商店触发场景进入触发区【事件节点】：进入碰撞触发器条件//结果销毁实体【查询节点】：确定被销毁实体是绑定了对应节点图的实体。【执行节点】：销毁实体。 6.【局内编辑器】放置元件，试玩体验将制作好的【雀雀球】机关元件放入场景中，点击试玩即可体验该功能。**需要注意的是：当前禽肉无法被拾取，这是由于还没有配置背包组件导致的，具体配置方法请见下文功能示例-2。 背包——拾取道具并在背包中使用功能示例-2：拾取掉落物进背包并使用道具恢复生命1.概念简述背包：收纳玩家持有的道具，如装备、消耗品、材料等。 2.教学内容功能效果：拾取掉落的禽肉，在背包中使用该道具，使用后可恢复生命。效果演示： 1.【局内编辑器】添加背包组件及模板要让掉落物正常被拾取，需要与其交互的角色身上挂载【背包组件】我们点击进入战斗预设界面>>>点击【角色编辑】面板中的>>>进入组件页，点击>>>选择【背包组件】即可添加。背包还需要配置对应的【背包模板】，我们点击背包组件的详细编辑>>>点击背包模板中的“请选择模板”>>>点击“打开背包模板编辑”>>>点击“添加模板”即可完成模板添加。**教程中由于没有特殊需求，故使用默认配置。实际制作时，可以根据自身需要灵活调整背包模板的参数。配置好对应模板后，别忘记回到背包组件的基础设置，将刚刚配置好的背包模板勾选上。此外，可以通过在【初始物品列表】中配置对应的道具，给角色添加初始道具；由于教程没有特殊需求，故不做配置。配置好背包后，对应角色就可以拾取掉落物进背包了，可以通过快捷键【B】快速打开背包。 2.【千星沙箱】配置道具的使用逻辑我们希望使用【禽肉】后，可以恢复角色的生命值，因此我们需要给道具【禽肉】挂载节点图逻辑。我们进入辅助编辑器，在服务器节点图中找到【道具节点图】页签，新建一个空白节点图命名为“禽肉恢复生命”。我们希望角色在使用道具【禽肉】时，能恢复角色的生命值，具体逻辑和节点图连接方法见下：  要做的功能对应的配置项功能使用“禽肉”后，玩家恢复生命值触发场景道具被使用【事件节点】：物资道具被使用时条件使用道具的是禽肉【流程控制节点】：双分支&【运算节点】：是否相等，来判断使用的道具是否是禽肉的id结果恢复玩家生命值【查询节点】：确定恢复目标为背包持有者，发起实体为道具自身【运算节点】：由于可能一次使用事件中，角色会同时使用多个道具，因此需要根据其使用量进行乘法运算，计算出最终的回复量，并将其转换为浮点数。【执行节点】：直接恢复生命随后，回到局内编辑器打开战斗预设界面>>>进入道具编辑页面>>>选择禽肉>>>在基础设置中，点击关联道具节点图>>>选择我们刚写好的“禽肉恢复生命”的节点图，将其挂载在道具上即可。 3.【局内编辑器】试玩体验此时进入试玩，即可拾取并使用道具恢复生命。**更多相关信息可自行查阅【综合指南-资源系统-背包】【综合指南-资源系统-道具】【综合指南-资源系统-掉落物】【综合指南-背包组件】【综合指南-掉落物组件】【综合指南-固定掉落物组件】课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻功能复刻：制作击杀后会掉落道具的造物（怪物） 课程回顾：学会如何通过基础设置制作可掉落的道具，并且结合节点图逻辑，使其可以在背包中使用并触发相应逻辑。辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-掉落物、道具、背包】对照学习",
  "mhsuhyi2b61o": "前言课程说明：课程内容：该课程主要装备的制作与使用案例。学习目标：学会如何配置装备制作可被装备的道具，并且根据装备提升角色属性/添加特效。**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读。相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）装备——制作可以穿戴的装备功能示例-1：制作穿戴后提升生命上限的护甲1.概念简述装备：可以被穿戴的特殊道具类型（需要配合【装备栏组件】一起使用），可配置以下几种加成机制，在穿戴后生效：1.生命值、攻击力等基础属性加成；2.通过节点图写入的自定义逻辑；3.单位状态效果 2.教学内容功能效果：制作一个穿戴后提升生命值上限的护甲效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主3.操作步骤 1.【局内编辑器】给角色添加装备栏组件在战斗预设-玩家-角色编辑中>>>点击>>>进入组件页，点击>>>选择【装备栏组件】即可添加。装备栏还需要配置对应的【装备栏模板】，我们点击装备栏组件的“装备栏模板”>>>点击“打开装备栏模板编辑”>>>点击“添加模板”即可完成模板创建>>>点击装备栏样式中的“+”号来添加装备栏位。此外，也可以通过【ESC面板-货币与背包-装备栏】进入装备栏配置界面 2.【局内编辑器】制作装备栏教学中，我们以装备栏有2个槽位，分别可以装备武器和护甲为例。在实际制作中，可以根据玩法需要自由配置装备栏模板。为达到预期的功能效果，教程中配置如下：要做的功能对应的配置项装备栏有2个槽位装备栏样式中，点击“+”号添加两个空槽位装备栏一个为武器、一个为护甲【当前栏位名称】——分别命名为“武器“、“护甲”武器、护甲的装备栏都有对应的图标【图标】——选择对应图标武器栏只可装备类型为“武器”的装备，护甲栏只可装备类型为“护甲”的装备【可装备类型】——选择装备类型——打开装备类型编辑——添加类型——分别添加“武器”“护甲”2个类型——回到装备栏模板，将武器的可装备类型选择为“武器”，护甲可装备类型为“护甲”。 3.【局内编辑器】制作装备装备的制作和道具制作流程基本一致。在战斗预设面板中，点击>>>进入道具配置页，点击【新建道具】>>>在弹窗中选择对应的道具图标>>>设置道具的基本信息，如名称、类型、品质等（教学中将道具命名为护甲，设置为装备，品质为蓝色）>>>点击保存确认创建。 4.【局内编辑器】新建及配置装备词条在道具详情页中，点击【交互设置】-【装备设置】可以对装备进行类型、标签、词条等配置，我们先添加装备词条。在道具的交互设置中，找到【装备设置】>>>点击【添加词条】>>>点击【打开装备词条编辑】>>>添加词条（教程中将其命名为生命值加成）即可创建一个新的装备词条。此时我们可以对词条的详细属性进行编辑，教学中我们希望玩家装备护甲后，能够直接提升最大生命值。为达到预期的功能效果，教程中配置如下：要做的功能对应的配置项护甲装备后立即生效【生效时机】选择【装备时生效】固定增加角色生命值上限100000000【选择属性】选择【生命值修正值】【加成类型】选择【固定值】【加成固定值】设置为【100000000】词条配置好之后，回到刚制作的护甲道具的【交互设置】中，点击【添加词条】，勾选刚配置好的“生命值加成”。由于我们先前规定了2个装备栏可装备类型为“武器”和“护甲”，因此我们还要在道具的【装备设置】中，将装备类型选择为“护甲”，否则无法正常穿戴。 5.【局内编辑器】添加背包为了能够拾取、使用装备，我们还需要给角色添加背包组件和背包模板，具体添加方式可以参考往期课程【掉落物、道具和背包】。点击进入战斗预设界面>>>点击【角色编辑】面板中的>>>进入组件页，点击>>>选择【背包组件】即可添加。背包还需要配置对应的【背包模板】，我们点击背包组件的详细编辑>>>点击背包模板中的“请选择模板”>>>点击“打开背包模板编辑”>>>点击“添加模板”即可完成模板添加。教程中由于没有特殊需求，故使用默认配置。实际制作时，可以根据自身需要自定义调整背包模板的参数。配置好对应模板后，别忘记回到背包组件的基础设置，将刚刚配置好的背包模板勾选上。 为了更便捷地演示装备穿戴效果，设置角色背包初始便携带有“护甲”道具：在背包组件的【初始物品】中点击【添加初始物品】，将“护甲”勾选上。 6.【局内编辑器】试玩体验配置完成后，即可点击试玩进入关卡体验，我们可以点击快捷键C打开装备栏（或点击快捷键B打开背包）将“护甲”穿戴到身上，并且血量会随着穿戴而增加。**更多相关信息可自行查阅【综合指南-装备】 拓展应用该模块仅作为教学课程所能拓展应用的功能简述，涉及到多模块联动，以操作步骤演示为主，了解进阶用法即可功能示例-2：制作穿戴后附加自定义逻辑的装备功能说明：装备武器-剑，在角色手上出现剑的模型效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主实现步骤：思路解析：装备实际是道具的一种，通过配置道具-剑的关联道具节点图，使用装备时执行在角色对应挂点上创建武器模型特效的逻辑。 1.创建一个道具，命名为剑，在背包中的分类定义为装备，目的是制作命为剑的装备。 2.配置装备栏和背包，目的是可以使用和装备剑。 3.在道具-剑的交互设置中，新建并添加一个名为“剑”的标签，目的是让道具节点图能够判断装备的道具是“剑”。 4.配置道具节点图逻辑，通过装备时发出的时间，判断此时装备的道具标签是否是“剑”，如果是则给装备持有者挂载一个单手剑武器模型的循环特效。  要做的功能对应的配置项功能装备装备后，添加特效触发场景玩家穿戴上装备后【事件节点】：装备装备时条件装备标签是否是“剑”通过事件的【装备索引】——使用查询节点【查询装备标签列表】——【获取列表对应值】确定装备的标签id用【双分支】判断装备的标签是否与“剑”的标签id是否相等。结果给角色手上挂上武器模型特效【执行节点】：给角色挂载循环特效 5.回到道具-剑的基础设置页面，在【关联道具节点图】中，选择编写好的节点图逻辑，保存设置 6.进入试玩即可体验该功能课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻功能复刻：制作装备后可以增加攻击力的挂件进阶拓展：制作装备后可以增加特效和特殊技能的武器 课程回顾：学会如何通过基础设置制作装备，并且可以在背包中穿戴并提升角色属性。 辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-装备】对照学习",
  "mh53tyir62xo": "前言课程说明：课程内容：货币和商店制作与使用案例。学习目标：学会如何配置货币和商店，让玩家可以唤出商店进行道具交易。**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读。相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）货币与商店——制作可以买卖道具的商店功能示例-1：使用商店组件制作可以买卖道具的商店1.概念简述货币：自定义的特殊资源，可用于商店交易过程中的道具购买/出售商店：预封装的商店模版，配置后可进行交互，用于道具类物品的购买/出售 2.教学内容功能效果：制作一个可以买卖道具的商店效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主3.操作步骤1.【局内编辑器】配置货币首先，我们先配置游戏中使用的货币：在ESC面板，点击【货币与背包】>>>进入货币与背包配置页，点击【添加货币】>>>在详情页中，可以对新添加货币的基础属性进行编辑。为达到预期的功能效果，教程中配置如下：要做的功能对应的配置项货币名称为摩拉点击名称右侧的进行重命名——输入“摩拉“货币图标为摩拉【图标】——选择“摩拉“图片死亡后不会掉落/损失已有的货币【归属者销毁时道具处理】——“保留” 2.【局内编辑器】配置道具及对应价值①创建可供交易的道具在战斗预设面板中，点击>>>进入道具配置页，点击【新建道具】>>>在弹窗中选择对应的道具图标>>>设置道具的基本信息，如名称、类型、品质等（教学中将道具命名为苹果，设置为普通道具，品质为绿色）>>>点击保存确认创建。 ②配置道具的价值，使其可用于交易创建好道具后，可以在基础设置中，对道具的价值进行设置，为达到预期的功能效果，教程中配置如下：要做的功能对应的配置项道具具有货币价值是否有货币价值——选择“开启”在道具详情中显示其货币价值显示货币价值——选择“开启”苹果道具价值为5摩拉【添加货币价值】——勾选我们配置好的货币“摩拉”——将【货币价值】改为“x5”点击保存后，道具及对应价值就设置好了。 3.【局内编辑器】配置商店模板接下来制作一个商店模板；在Esc菜单中，点击【商店模板管理】>>>进入货币与商店模板管理页，点击【新建商店模板】>>>对新建的商城模板进行编辑（教程中将其命名为“商店模板01”）。商店模板创建完成之后，需要对商店的买卖功能进行设置。为达到预期的功能效果，教程中配置如下：要做的功能对应的配置项开启商店时同时将玩家背包打开【开启商店时同时打开背包】——选择“开启”商品根据默认类型页签分类【商品页签类型】——选择“默认页签”商店只出售苹果，存量1个在【出售设置】中进行如下设置【商品来源】——选择“自定义列表”【售价设置】——选择“编辑”——在弹出的出售价格表中点击【添加商品】——找到材料页签下的“苹果”——将数量改为“1”——在售价中将售价调整为“10”——点击“添加商品”商店也回收苹果，但回收价为5摩拉在【收购设置】中进行如下设置【收购范围】——选择“全部道具”【收购价格设置】——选择“编辑”——在弹出的收购价格表中——将苹果的【收购价】改为“5” 4.【局内编辑器】配置背包①添加背包组件商店买卖的道具，角色需要用背包来进行存储，否则无法进行交易，因此需要在角色上配置背包组件。点击进入战斗预设界面>>>点击【角色编辑】面板中的>>>进入组件页，点击>>>选择【背包组件】即可添加。②配置背包模板背包还需要配置对应的【背包模板】，点击背包组件的详细编辑>>>点击背包模板中的“请选择模板”>>>点击“打开背包模板编辑”>>>点击“添加模板”即可完成模板添加。教程中由于没有特殊需求，故使用默认配置，制作中可以根据自身需要随意调整背包模板的参数。 5.【局内编辑器】创建元件，挂载商店组件并进行配置接下来需要元件来充当商店，让玩家进入元件碰撞盒范围后，弹出商店界面。创建一个元件作为商店（教程以摊位铺为例），在面板中点击>>>进入组件页，点击>>>选择【商店组件】即可添加。在商店组件中点击“详细编辑”>>>进入详情页，在【商店模板】中选择我们刚刚做好的“商店模板01” 6.【千星沙箱】进入碰撞触发盒后打开商店页面此外，还需要一个事件来唤起做好的商店页面，实际制作中可以根据自身需要选择事件。为方便理解，本教程通过碰撞触发盒事件来唤起商店。制作好的逻辑挂载在“摊位铺”元件上。  要做的功能对应的配置项功能进入碰撞触发区唤出商店触发场景进入触发区【事件节点】：进入碰撞触发器条件//结果打开商店【查询节点】：确定打开商店的玩家实体是进入碰撞触发器的玩家。注：由于触发器组件和上商店组件都挂在同一个元件“摊位铺”上，仅此触发器实体=商店实体【执行节点】：打开商店。7.【局内编辑器】配置掉落物最后，可以制作一个“苹果”道具的对应掉落物，让玩家拾取掉落物之后，可以将获取到的道具出售给商店获得货币，也可以再使用货币在商店里购买新的道具。具体的配置方式可以参考往期课程【掉落物、道具和背包】，这里仅根据教学需求做简单流程演示：创建一个预设掉落物作为掉落道具（教程以果实堆为例），在元件库面板中点击>>>进入掉落物页，点击预设中的【挑战币掉落物】>>>点击【模型】>>>选择【果实堆】即切换掉落物模型>>>点击【保存】即可添加一个新的掉落物。掉落物会默认携带【掉落物组件】，在面板中点击>>>进入组件页便可以看到【掉落物组件】，为达到预期的功能效果，教程中配置如下：要做的功能对应的配置项掉落物通过交互项来拾取【拾取规则】——选择“交互拾取“掉落物掉落时有落地动画【开启掉落动画】——选择“开启“掉落物直接会出现在关卡中，代表5个“苹果”道具【掉落内容】——“添加物品”——选择“苹果”——数量选择“5” 8.【局内编辑器】试玩体验此时进入试玩，即可拾取并在商店内买卖道具。**更多相关信息可自行查阅【综合指南-资源系统-商店】【综合指南-资源系统-货币】【综合指南-商店组件】课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻功能复刻：制作可以买卖道具和装备的商店 课程回顾：学会如何通过基础设置制作商店和货币。辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-货币与商店】对照学习",
  "mhw6purbjsrq": "前言课程说明：课程内容：该课程主要讲解小地图标识的制作与使用案例。学习目标：学会如何配置小地图标识组件，制作可以在小地图雷达中显示位置的指引标识。**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读。 相关信息：推荐学习顺序：【前置课程】→【当前课程】→【综合指南】**如课程中遇到概念不清等问题或想要了解更多相关信息，根据需要查询【综合指南】即可 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅） 关联知识点：课程中将涉及以下基础概念（建议优先根据该课程学习即可，如遇到概念不清等问题或想要了解更多相关信息，再根据需要查阅【综合指南】相关章节）小地图标识——制作小地图中显示的指示物功能示例-1：将任务目标显示在小地图雷达中1.概念简述小地图标识：在默认的小地图控件中以图标/范围等方式显示实体位置。 2.教学内容功能效果：制作一个机关，在小地图中显示它的图标和位置。效果演示： 3.操作步骤1.【局内编辑器】添加小地图标识组件创建一个元件作为目标机关（教程以增强机关为例），在面板中点击>>>进入组件页，点击>>>选择【小地图标识】即可添加。 2.【局内编辑器】添加标记打开【组件-小地图标识】后，默认不含有标记，点击即可添加新标记（可同时添加多个标记制作不同标记切换的效果） 3.【局内编辑器】配置面板参数为达到预期的功能效果，教程中配置如下，配置完成后点击保存元件即可：要做的功能对应的配置项机关在小地图中显示，所有玩家都可见【显示设置】初始所有玩家可见机关以图标类型显示在小地图中【选择图标】选择自己喜欢的图标在小地图中显示图标与玩家之间的高低差【显示高低差】——开启标记名称为“机关”描述为“一个普通的机关”【标记名称】自定义为“机关”【标记描述】自定义为“一个普通的机关” 4.【局内编辑器】放置元件，试玩体验将制作好的元件放置在场景中，进入试玩即可体验该功能。 功能示例-2：通过交互在小地图雷达中追踪目标指示物位置1.教学内容功能效果：走进机关，在小地图上追踪显示造物图标及位置。效果演示：左上角小地图的图标信息显示，进入一定范围后显示了造物（怪物），可注意观察小地图的变化 2.操作步骤1.【局内编辑器】添加小地图标识组件创建一个元件作为目标造物（教程以为例遗迹重机），在面板中点击>>>进入造物组件页，点击>>>选择【小地图标识】添加>>>点击即可添加新标记，流程和示例-1一致， 2.【局内编辑器】配置面板参数为达到预期的功能效果，教程中配置如下：要做的功能对应的配置项造物在小地图中显示，所有玩家都可见【显示设置】初始所有玩家可见造物以头像类型显示在小地图中【选择类型】选择【造物头像】在小地图中显示图标与玩家之间的高低差【显示高低差】——开启 3.【局内编辑器】给机关添加碰撞触发器组件触发追踪功能依赖事件，教程中我们以在机关物件上添加碰撞触发器来触发。具体配置方式可以参考往期教程：碰撞与交互——触发一个事件，在此不赘述。教程中具体配置如下：要做的功能对应的配置项角色进入区域后发出事件【初始生效】——开启【生效目标】——“角色、物件、造物”触发区域大一些【缩放倍率】——“x=3.00”“y=3.00”“z=3.00” 4.【千星沙箱】节点图配置  要做的功能对应的配置项功能交互后开宝箱触发场景进入碰撞区后触发【事件节点】：进入碰撞触发器时条件//结果-1在小地图中高亮造物图标【执行节点】：使用【修改追踪小地图标识的玩家列表】制作追踪效果 5.【局内编辑器】挂载节点图将配置的节点图挂载在机关元件上，保存元件设置 6.【局内编辑器】放置元件，试玩体验将制作好的造物、元件放置在场景中，进入试玩即可体验该功能课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻功能复刻：制作可以在小地图显示图标的传送点进阶拓展：制作只有部分玩家可以看到的标识，且可以通过节点图动态开关 课程回顾：学会如何通过基础设置小地图标识组件，在小地图中显示实体位置辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-小地图标识】对照学习",
  "mhhe9ji9ysn8": "前言课程说明：课程内容：特殊的单位状态“描边”与“透视”的使用方法学习目标：了解如何配置“描边”与“透视”，制作游戏中的引导信息等（如：隔墙透视、可交互描边、队伍描边、造物（怪物）描边等）**该课程中涉及【局内编辑器面板配置】和【千星沙箱节点图】两个模块内容，并且相互关联，阅读时建议按照课程顺序完整阅读。相关信息：推荐学习顺序：【前置课程】→【当前课程】 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅）描边——实体的差异化表现功能示例-1：给可进行交互操作的物件添加绿色描边1.概念简述描边：特殊的【单位状态】类型，通过配置描边颜色，可制作例如：可交互的物件有描边、根据不同分队给角色添加描边等差异化表现效果。 2.教学内容功能效果：制作绿色的描边效果，给当前可以被交互操作的物件添加，即当人物靠近物件时，添加绿色描边效果演示： 3.操作步骤1.【局内编辑器】添加单位状态新建一个状态作为增加血量的buff状态，在面板中点击>>>进入战斗预设，点击>>>选择即可添加 2.【局内编辑器】制作“描边”效果添加状态后可对状态的名称、叠加层数上限、持续时间、状态规则等进行调整，为达到预期的功能效果教程中配置如下： 要做的功能对应的配置项通用信息状态持续时间无上限【无限持续时间】选项打开效果详细信息描边效果效果选择【挂载描边效果】描边为绿色效果选择【自定义颜色】，设置为“绿色” 3.【局内编辑器】制作差异化的物件和触发效果（碰撞触发器组件）制作3个差异化物件（教程中选择锤子、铲子、锄头），添加【碰撞触发器】组件，并配置触发器形状/大小，为达到预期的功能效果教程中配置如下：**3个物件仅模型不同，其他配置完全一样，教程以锤子为例要做的功能对应的配置项触发器形状/大小合适【形状】设置为“球体”【半径】设置为“1”**实际教程中沿用了球体的初始设置，此处仅演示 4.【千星沙箱】节点图配置在实体节点图中，添加并配置该元件的节点图（设置参考见下图），为达到预期的功能效果教程中配置如下：**该节点图挂载在【物件元件】上  要做的功能对应的配置项功能-1玩家进入一定范围，可操作的物件添加描边效果触发场景进入一定范围时，触发事件【事件节点】：进入碰撞触发器时条件//结果添加描边效果【执行节点】：使用【添加单位状态】添加绿色描边表现功能-1玩家进入一定范围，可操作的物件添加描边效果 触发场景离开一定范围后，触发事件【事件节点】：离开碰撞触发器时条件//结果移除描边效果【执行节点】：使用【移除单位状态】移除绿色描边表现 5.【局内编辑器】挂载节点图将配置的节点图挂载在3个差异化的物件元件上，保存元件设置 6.【局内编辑器】放置元件，试玩体验将制作好的元件放置在场景中，进入试玩即可体验该功能 透视——隔墙透视的实体表现效果功能示例-2：给特定物件添加透视效果1.概念简述透视：特殊的【单位状态】类型，通过配置透视颜色，过滤节点图，可制作例如：特定物件可透视、透视技能等差异化表现效果。 2.教学内容功能效果：制作白色的透视效果，给特定的物件添加，当人物与该物件间有墙壁等实体遮挡时，可隔墙看到该物件效果演示：3.操作步骤1.【局内编辑器】添加单位状态新建一个状态作为增加血量的buff状态，在面板中点击>>>进入战斗预设，点击>>>选择即可添加 2.【局内编辑器】制作“透视”效果添加状态后可对状态的名称、叠加层数上限、持续时间、状态规则等进行调整，为达到预期的功能效果教程中配置如下： 要做的功能对应的配置项通用信息状态持续时间无上限【无限持续时间】选项打开效果详细信息透视效果效果选择【挂载透视效果】透视为白色效果选择【自定义颜色】，设置为“白色” 3.【局内编辑器】制作可透视的物件制作1个可透视的物件（教程中以火炬为例），直接在【单位状态】组件添加设置好的单位状态即可。**此处仅演示效果直接添加，实际制作时可根据关卡需要，灵活制作透视时段、透视物件等。 6.【局内编辑器】放置元件，试玩体验将制作好的元件放置在场景中，在前面额外摆放一个墙体作为障碍物，进入试玩即可体验该功能课程总结及辅助课件课程作业：可根据课程教学内容尝试进行以下功能复刻/拓展功能复刻：制作扫描技能效果，开启技能后，可以看到不同物件的描边效果（用于查找特定标签的物品道具）课程回顾：学习如何制作【描边】和【透视】效果，并在所需情况下给特定实体添加该状态，制作各类差异化表现的物件、技能等。辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-描边与透视】对照学习 ",
  "mh281vi67sys": "在该系列课程中，会以不同的玩法类型进行拆分讲解，逐步介绍如何使用编辑器内的功能模块进行组合使用，构成完整的游戏流程，制作一个具有一定可玩玩法内容的关卡。",
  "mhzi4r003o0g": "课程说明：在该系列课程中，将以多人休闲玩法为例进行实战演练，串联讲解编辑器各模块的综合用法，搭建出一个可供游玩的基础模版版本，后续可根据个人设计偏好在此基础上迭代优化，添加其他功能玩法。 **在系列课程中将按照设计顺序逐步讲解各个模块的设计，由于各模块间相互关联，首次学习时推荐按照顺序阅读，避免由于跳跃学习产生课程内容不理解，前后连贯等问题相关信息：玩法简介：方形的农场内，玩家在规定时间里，通过开垦、播种、采集等行为进行种植，并收获成熟的果实，将果实上交给商店获得积分，游戏结束后积分最高者获胜。游戏视角：俯视角玩家人数：2~4人，每人独立1队游戏时长：5min/局游戏特色机制：【资源博弈】每位玩家场地中都有耙子和水壶工具，同时间只能拿起一种工具，可以去敌方场地内“偷工具”；场地中每隔一段时间都会根据玩家数量刷新种子，同一时间只能拿一包种子，可以通过技巧多拿一些种子放在己方场地，增加敌方拿取成本；【偷菜】种植期间玩家仅能在己方场地内种植，但可以去敌方场地内“偷菜”； 以上为该系列课程中讲解的玩法概述，学习完系列课程后可自行拓展功能设计，例如：天气系统、更丰富的道具内容、差异化地图设计、随机事件等，增加游戏可玩性和趣味性 课程构成：系列课将分为以下3节课程进行讲解：1.耕种-采集流程——工具制作（耙子、水壶、种子）、土地制作（土地升级和状态管理）、植物制作（植物生长）2.操作提示与反馈——可拾取道具引导、己方可操作土地的白色方框高亮提示、积分提示等3.玩法流程——游戏时长、积分结算  ",
  "mh8gqrrpzzm6": "前言相关信息：推荐学习顺序：【前置课程】→【当前课程】 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅）目标拆解功能逻辑以下为在该玩法中与耕地-采集相关的功能点，课程中将根据这些功能点进行组合讲解：①土地具有“未开垦/已开垦/已播种/已浇水”4种可升级状态②有3种基础工具耙子、种子、水壶，玩家同一时间只能拿起1种工具，拿起后可以切换为其他工具或放下当前工具③耙子、种子、水壶分别可对土地进行开垦、播种、浇水，拿起工具后才可进行对应操作；土地等级升级不能跳跃，必须按照顺序进行升级④耙子和水壶可以无限次使用，每个种子只能使用5次⑤每队玩家只能对己方土地进行“开垦”、“播种”、“浇水”操作，不能在敌方场地进行操作⑥种子分为“种子期/幼苗期/生长期/成熟期”，种下种子并浇水后，种子每隔一段时间会进行自动生长⑦成熟期可以进行采集，玩家可以采集己方或敌方的成熟期果实，同时间最多采集3个⑧将果实交给商人后可获取积分①土地具有“未开垦/已开垦/已播种/已浇水”4种可升级状态功能原理：教程中使用空物件作为操作物，通过在空物件位置生成新的物件或特效表示土地状态 效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主操作步骤：1.【局内编辑器】创建一个元件作为可种植土地（教程以空物件为例），添加【组件-自定义变量】作为土地升级状态管理为达到预期的功能效果教程中配置如下：要做的功能对应的配置项变量名设置，用于节点图配置使用【变量名】调整为“土地等级”**变量名称不影响其效果，仅作为节点图配置和索引使用，以自己方便记忆的命名配置即可土地共具有“未开垦→已开垦→已播种→已浇水”4个等级【变量类型】调整为“整数”**使用“浮点数”“字符串”等均能满足需要，此处仅为了方便计算使用，可按照自己喜好配置即可土地初始为“未开垦”状态【初始数值】调整为0 2.【局内编辑器】选择土地升级后的效果表现教学中演示的做法为，在空物件位置生成不同的其他元件或特效，用于表示土地升级效果，实际制作时可根据需要自行选择所需元件或特效配置。**记住元件ID和特效ID即可，用于后续的节点图配置教学中的配置参考：土地等级0：仅空物件土地等级1：创建元件-生成土壤土地等级2：创建元件-生成种子土地等级3：添加特效-已浇水状态 ②有3种基础工具耙子、种子、水壶，玩家同一时间只能拿起1种工具，拿起后可以切换为其他工具功能原理：拿起工具和切换工具的表现通过“销毁元件”和“创建元件”实现；是否可拾取通过自定义变量“是否有道具”判断；拾取道具后在玩家的自定义变量存储“拾取的道具是什么”，切换时根据玩家身上当前的变量创建对应的道具 效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主操作步骤：1.【局内编辑器】制作3个不同道具物件，添加【组件-选项卡】，配置选项“拾取”与“切换”，配置合适的选项触发区域 2.【玩家】配置【组件-自定义变量】，添加2个自定义变量，参数如下：变量1-是否有工具，用于判断玩家能否“拾取”或“切换”道具变量2-装备的工具是，用于判断玩家当前身上的道具，“切换”后将原装备的道具放在原地 3.【千星沙箱】实体节点图配置“拾取”/“切换”道具效果（设置参考见下图），配置完成后保存元件设置为达到预期的功能效果教程中配置如下：**由于3个道具功能逻辑一致，仅判断玩家身上道具后，生成的道具和切换当前装备的道具差异，教程以其中之一（耙子）示例该节点图挂载对象为：【各个工具】（以下以耙子示例）  要做的功能对应的配置项功能没有道具时可拾取；已拾取道具时仅切换，将原拾取道具放下触发场景进行交互操作后【事件节点】：选项卡选中时（交互选择“任意”选项时触发）条件-1判断玩家的操作是什么【流程控制节点】：使用多分支对“选项序号”进行判断**该教程中，选项序号分别对应：序号1-拾取序号2-切换条件-2判断玩家是否已拾取道具【流程控制节点】：使用双分支对【玩家】变量“是否有工具”进行判断结果-1没有道具时直接拾取，拾取后道具消失【执行节点】：将【玩家】变量“是否有工具”改为“是”，“装备的工具”改为“耙子”【执行节点】：将拾取的道具销毁条件-3切换时，根据玩家已拾取道具生成旧道具【流程控制节点】：使用多分支对【玩家】变量“装备的工具是”进行判断结果-2有道具时切换新的道具，切换后道具消失，在原地生成旧道具【执行节点】：使用【创建元件】在原地生成玩家装备的工具对应的元件【执行节点】：将【玩家】变量“装备的工具”改为“耙子”【执行节点】：将拾取的道具销毁 ③耙子、种子、水壶分别可对土地进行开垦、播种、浇水，拿起工具后可进行对应操作或主动放下工具；土地等级升级不能跳跃，必须按照顺序进行升级功能原理：拿起工具后给玩家的角色添加新的技能“使用工具”和“丢弃”使用工具的效果分别对应3个技能，即开垦、播种、浇水；玩家身上设置一个变量判断目前选中的“可交互的土地”是哪个进入可交互区后将对应的土地设置为玩家的变量使用工具后让玩家对选中土地进行操作 效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主操作步骤：1.【局内编辑器】制作4个技能，按照需求配置其动画，分别对应：耙子-开垦，普通技能，动画播放时间为0.5s种子-种植，普通技能，动画播放时间为0.5s水壶-浇水，普通技能，动画播放时间为0.5s通用-放下工具，瞬发技能 2.【千星沙箱】客户端节点图-技能节点图中制作技能效果**由于本地技能不具备直接操作效果，因此仅发送使用技能信号，转由服务器节点图制作耙子-开垦、种子-种植、水壶-浇水，对应节点图为：通用-放下工具，对应节点图为： 3.【千星沙箱】制作玩家拾取工具后获取技能的效果功能原理：玩家拾取工具——根据获取的工具，更改玩家自定义变量——根据自定义变量获取技能为达到预期的功能效果教程中配置如下：该节点图挂载对象为：【玩家】  要做的功能对应的配置项功能-1玩家拾取工具后，获得对应工具的技能触发场景玩家拾取工具时【事件节点】：选项卡选中时条件判断玩家拾取的工具是什么【流程控制节点】：使用多分支对自定义变量变化的值进行判断结果角色可以使用或丢弃工具【执行节点】：使用【添加技能】添加工具的基础技能和通用“丢弃”技能**技能是添加给【角色】而非【玩家】 4.【千星沙箱】制作玩家放下工具后，生成工具并移除技能的效果功能原理：玩家丢弃工具——根据玩家当前自定义变量生成对应的工具——还原玩家自定义变量——移除全部技能为达到预期的功能效果教程中配置如下：该节点图挂载对象为：【角色】**【技能节点调用时】为【角色】监听使用，需要挂载在角色上  要做的功能对应的配置项功能-2玩家放下工具后，原地生成工具，并移除可用技能触发场景玩家使用工具技能时【事件节点】：【技能节点调用时】监听客户端节点【通知服务器节点图】条件-1判断玩家使用的技能是“丢弃”【流程控制节点】：使用多分支对技能传参进行判断条件-2判断玩家当前身上的工具是什么【流程控制节点】：使用多分支对玩家变量“装备的工具是”进行判断结果-1放下工具【执行节点】：使用【创建元件】生成玩家当前身上的工具结果-2让玩家后续可以拾取工具【执行节点】：设置自定义变量，不配值结果-3不能继续使用工具技能【执行节点】：使用【以槽位删除角色技能】移除技能 5.【局内编辑器】明确玩家当前是对哪个土地进行操作在【玩家】-【自定义变量】中增加“可操作的土地是”，类型设置为实体**示例图中由于字符数量超出可显示字数，未展示全 6.【局内编辑器】通过玩家进入土地的一定范围区域，使这个土地变成可操作的土地添加【组件-碰撞触发器】，根据需要配置适合的缩放大小，生效目标仅角色 7.【千星沙箱】制作玩家进入区域后使土地可操作的效果功能原理：玩家进入区域——更改玩家自定义变量——后续对该自定义变量（进入的土地）进行操作玩家离开区域——还原玩家自定义变量——即无法对土地进行操作为达到预期的功能效果教程中配置如下：该节点图挂载对象为：【土地】  要做的功能对应的配置项功能-1玩家进入区域后，该土地可操作触发场景玩家进入土地特定区域后【事件节点】：【进入碰撞触发器时】条件//结果玩家可对该土地操作【执行节点】：使用【设置自定义变量】将该土地实体存储功能-2玩家离开区域后，该土地不可操作触发场景玩家离开土地特定区域后【事件节点】：【离开碰撞触发器时】条件//结果玩家不可对该土地操作【执行节点】：使用【设置自定义变量】设为空值 8.【千星沙箱】制作玩家使用不同工具后对土地的操作效果功能原理：玩家使用工具——判断玩家自定义变量-拿的是什么工具——判断土地等级-匹配工具可使用的土地（如：耙子只能对未开垦的土地开垦，种子只能对已开垦的土地播种等）——执行对应工具的效果——提升土地等级变量**由于3个道具功能逻辑一致，先判断玩家身上道具（对应不同操作），然后判断当前的土地等级（限制跳级），执行不同效果，教程以其中之一（耙子）示例为达到预期的功能效果教程中配置如下：该节点图挂载对象为：【角色】  要做的功能对应的配置项功能玩家使用工具后，根据不同工具和土地等级进行升级操作触发场景玩家使用工具技能时【事件节点】：【技能节点调用时】监听客户端节点【通知服务器节点图】条件-1判断玩家使用的技能是“操作工具”【流程控制节点】：使用多分支对技能传参进行判断条件-2判断玩家当前身上的工具是什么【流程控制节点】：使用多分支对玩家变量“装备的工具是”进行判断结果-1土地升级表现【执行节点】：使用【创建元件】生成物件/特效**操作步骤①设定的土地升级效果结果-2土地升级后限制不同工具操作【执行节点】：设置自定义变量，将土地等级+1④耙子和水壶可以无限次使用，每个种子只能使用5次功能原理：无限次使用的道具无需额外配置通过自定义变量控制使用次数，每次使用减少自定义变量，达到一定值后销毁不能使用 效果演示：**教程为了方便演示增加了UI显示种子可使用次数（此处暂不拓展，会在后续课程进行讲解）**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 操作步骤：1.【局内编辑器】玩家设定自定义变量，用来判断目前拾取的种子的可使用次数变量类型：整数初始值：0 2.【局内编辑器】工具-种子设定自定义变量，用来判断目前自身的可使用次数变量类型：整数初始值：5 3.【千星沙箱】制作种子使用限制效果功能原理：未使用的种子自身具有“5”次初始可使用数量变量——拾取物件时将该变量传递给【玩家】——玩家每次使用时使变量-1——玩家放下或切换工具时，将玩家身上的变量传给新的生成的种子——如果玩家使用后变量=0则种子达到使用上限，移除玩家身上工具和种子相关变量为达到预期的功能效果教程中配置如下：该节点图挂载对象为：各个【工具】  要做的功能对应的配置项功能-1玩家拾取工具时，将拾取种子的可使用次数传递给玩家触发场景玩家拾取种子时/**无需额外配置，直接使用步骤③中的拾取切换节点图条件能否拾取/切换/**无需额外配置，直接使用步骤③中的拾取切换节点图结果将变量传递给玩家【执行节点】：使用【设置自定义变量】将种子身上的变量传给【玩家】该节点图挂载对象为：【角色】  要做的功能对应的配置项功能-2玩家使用种子后，可使用次数减少触发场景使用种子工具/**无需额外配置，直接使用步骤③中的使用工具节点图条件能否使用/**无需额外配置，直接使用步骤③中的使用工具节点图结果使玩家可使用种子次数减少1次【执行节点】：使用【设置自定义变量】将玩家身上记录的自定义变量-1由于切换/放下物品时逻辑一致，仅需将所有相关节点图配置即可，相关的节点图：从“水壶”/“种子”/“耙子”切换为“种子”——该节点图挂载对象为：各个【工具】玩家主动放下“种子”——该节点图挂载对象为：【角色】教程中仅以工具切换为种子作为示例该节点图挂载对象为：各个【工具】  要做的功能对应的配置项功能-3玩家切换/放下种子时，新生成种子的可使用次数和玩家手中的种子可使用次数相同触发场景切换/放下种子/**无需额外配置，直接使用步骤③中的拾取切换节点图条件能否切换/放下/**无需额外配置，直接使用步骤③中的拾取切换节点图结果-1新生成种子的可使用次数与玩家手中的种子可使用次数一致【执行节点】：使用【设置自定义变量】将玩家身上记录的自定义变量传递给新生成的种子结果-2刷新玩家的自定义变量【执行节点】：使用【设置自定义变量】将玩家身上记录的“种子可使用次数”自定义变量清空该节点图挂载对象为：【玩家】  要做的功能对应的配置项功能-4玩家手中种子的可使用次数为0时，种子工具失效触发场景玩家使用种子【事件节点】：玩家的种子可使用次数的自定义变量-1**前置使用种子时，自定义变量-1，所以直接使用该节点图条件能否切换/放下/**无需额外配置，直接使用步骤③中的拾取切换节点图结果-1新生成种子的可使用次数与玩家手中的种子可使用次数一致【执行节点】：使用【设置自定义变量】将玩家身上记录的自定义变量传递给新生成的种子结果-2刷新玩家的自定义变量【执行节点】：使用【设置自定义变量】将玩家身上记录的“种子可使用次数”自定义变量清空 ⑤种子分为“种子期/幼苗期/生长期/成熟期”，种下种子并浇水后，种子每隔一段时间会进行自动生长功能原理：成功给种子浇水后，挂载定时器，每隔固定时间使植物触发1次升级通过销毁和创建新的元件表示植物升级效果 效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 操作步骤：1.【局内编辑器】制作3个不同的种子生长时期的效果教学中演示的做法为，在空物件位置生成不同的其他元件，用于表示植物生长效果，实际制作时可根据需要自行选择所需元件配置**记住元件ID即可，用于后续的节点图配置教程设定参考如下：种植物-幼苗期：仅元件模型不同种植物-生长期：仅元件模型不同种植物-成熟期：模型元件不同，同时添加了循环特效表示此时的果实已成熟 2.【局内编辑器】添加自定义变量管理土地上的种植物由于教程中将使用“删除旧的种植物，生成新的种植物”制作植物生长表现，需要在种植格上保存旧的种植物，因此添加【组件-自定义变量】类型为：实体 3.【千星沙箱】配置种植物升级效果节点图功能原理：玩家使用种子播种时——将生成的种植物-种子期存为土地的变量检测种子成功浇水后——挂载定时器用于触发种子升级用定时器每隔2s触发1次升级——采用销毁旧的-生成新的方式表示植物生长 为达到预期的功能效果教程中配置如下：该节点图挂载对象为：【角色】  要做的功能对应的配置项功能-1种下植物后，将植物存为土地的变量触发场景玩家使用种子/**无需额外配置，直接使用步骤③中的使用工具节点图条件使用的工具是种子，土地可播种/**无需额外配置，直接使用步骤③中的使用工具节点图结果确认种植的植物是哪个（制作生长表现使用）【执行节点】：使用设置自定义变量，将生成的实体存为当前可操作的土地的变量 该节点图挂载对象为：【土地】  要做的功能对应的配置项功能-2成功浇水后触发生长触发场景浇水后【事件节点】：自定义变量变化时**浇水会改变土地等级，因此使用自定义变量变化时作为触发事件条件土地浇水/结果-1种下植物【执行节点】：使用【创建元件】在土地的自身位置生成种子期的种植物结果-3植物开始生长【执行节点】：使用【启动定时器】挂载在种植格上，配置定时器序列为：2、4、6**定时器序列即为定时器运行多久后发出一次时间，由于植物生长是单次且不循环的，因此配置第2/4/6s生长1次功能-3每隔2s植物生长1次触发场景每隔一段时间【事件节点】：定时器触发时结果-1销毁当前种植的植物（教程中通过销毁旧的，生成新的种植物制作植物生长效果）【执行节点】：使用【销毁实体】销毁当前保存的种植物变量条件2、4、6s植物生长状态不同【流程控制节点】：使用【多分支】对定时器阶段进行判断，特定时间进行不同等级的成长结果-2植物生长变化【执行节点】：使用【创建元件】制作植物生长表现结果-3确认种植的植物是哪个（制作生长表现使用）【执行节点】：【设置自定义变量】将生成的种植物保存为变量 ⑥成熟期可以进行采集，玩家可以采集己方或敌方的成熟期果实，同时间最多采集3个功能原理：用自定义变量“是否可以采集”——植物生长到最后一级时——修改自定义变量玩家进入一定区域后——判断自定义变量“是否可以采集”——判断玩家“当前采集数量”<3——判断成功执行采集流程采集时——还原土地等级——清空种植物——给玩家添加采集物数量（用于后续根据采集物数量） 效果演示：**教程为了方便演示增加了UI显示采集的果实数（此处暂不拓展，会在后续课程进行讲解）**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 实现步骤：1.【局内编辑器】给土地添加一个变量用于管理是否可以采集的状态类型：布尔值；初始值：否 2.【局内编辑器】给【玩家】添加一个自定义变量用于记录玩家当前采集的数量类型：整数初始值：0 3.【千星沙箱】在种植物生长到最高级时，改变土地的自定义变量“是否可采集”，让土地可采集为达到预期的功能效果教程中配置如下：该节点图挂载对象为：【土地】  要做的功能对应的配置项功能-1植物生长到成熟期时，可采集触发场景种植物生长/**无需额外配置，直接使用步骤⑤中的种植物生长节点图条件生长到最高级/**无需额外配置，直接使用步骤⑤中的种植物生长节点图结果让土地可采集【执行节点】：使用设置自定义变量，将土地改为可采集状态s 4.【千星沙箱】在种植物生长到最高级时，改变土地的自定义变量“是否可采集”，让土地可采集为达到预期的功能效果教程中配置如下：该节点图挂载对象为：【土地】  要做的功能对应的配置项功能-2种下植物后，将植物存为土地的变量触发场景玩家进入土地区域【事件节点】：进入土地的碰撞触发区条件-1土地可采集【流程控制节点】：用双分支判断目前土地是否可采集条件-2玩家当前采集数量小于3【流程控制节点】：用双分支判断玩家当前采集数量结果-1让玩家采集数量增加【执行节点】：使用设置自定义变量，增加玩家的采集数量结果-2让土地恢复到已开垦状态【执行节点】：使用设置自定义变量，修改土地等级结果-3土地不可采集【执行节点】：使用设置自定义变量，设置为不可采集结果-4删除土地上的植物和浇水状态【执行节点】：使用销毁实体+设置自定义变量，删除土地上的植物【执行节点】：使用删除特效，删除土地的浇水状态⑦将果实交给商人后可获取积分功能原理：用自定义变量“积分值”管理玩家出售果实后的积分——玩家进入果实商区域内出售身上的果实——根据玩家身上的果实数获得积分 效果演示：**教程为了方便演示增加了UI显示积分值（此处暂不拓展，会在后续课程进行讲解）**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 操作步骤：1.【局内编辑器】制作一个果实商，用于出售果实；添加【组件-碰撞触发器】用于检测玩家进入后出售果实 2.【局内编辑器】给【玩家】添加一个自定义变量用于记录玩家当前积分值类型：整数初始值：0 3.【千星沙箱】制作出售果实效果功能原理：玩家进入区域后——根据玩家身上的果实数量获得积分——清空当前玩家身上的果实数量 为达到预期的功能效果教程中配置如下：该节点图挂载对象为：【果实商】积分值计算公式为：新积分值=旧积分值+上交采集物数量*10  要做的功能对应的配置项功能玩家进入果实商区域后，出售身上的果实，获得积分触发场景玩家进入果实商区域【事件节点】：进入果实商的碰撞触发区条件//结果-1让玩家积分值增加【执行节点】：使用设置自定义变量，增加玩家的积分值**教程中以1果实=10积分计算，实际可自由配置结果-2玩家出售所有果实【执行节点】：使用设置自定义变量，清空玩家身上的果实数量 ⑧每队玩家只能对己方土地进行“开垦”、“播种”、“浇水”操作，不能在敌方场地进行操作功能原理：将玩家分为不同阵营，设置的土地格也分配为不同阵营；布设时将同阵营的土地格布设在同一个场地；判断玩家是否可操作土地格时，仅同阵营土地格可操作 效果演示：**已在2个区域上布设不同阵营的土地**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 操作步骤：1.【局内编辑器】分配玩家队伍**由于该玩法中仅涉及4个玩家和队伍，因此使用【阵营】进行设定在【关卡设置-阵营】中添加多个阵营，分别将玩家1~4设定在不同阵营中阵营关系设定中可将各队伍均改为友善 2.【局内编辑器】将土地元件创建4个，分别对应队伍1~4 3.【千星沙箱】制作土地阵营匹配标签，仅同阵营的土地可操作功能原理：玩家进入土地可操作区域时——判定土地阵营与玩家阵营是否一致——一致则可以操作为达到预期的功能效果教程中配置如下：该节点图挂载对象为：【土地】  要做的功能对应的配置项功能-1玩家进入同阵营土地后，土地可操作触发场景玩家进入土地特定区域后/**无需额外配置，直接使用步骤③中的土地可操作节点图条件土地是否是同阵营的【流程控制节点】：使用【双分支】对土地阵营和玩家阵营进行判断，一致则执行后续结果玩家可对该土地操作/**无需额外配置，直接使用步骤③中的土地可操作节点图辅助课件辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-耕种-采集流程】对照学习",
  "mhhfcsifwb7w": "前言相关信息：推荐学习顺序：【前置课程】→【当前课程】 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅）目标拆解功能逻辑以下为在该玩法中与操作提示与反馈相关的功能点，课程中将根据这些功能点进行组合讲解：①各个可交互工具看起来更明显（可拾取引导）②玩家获取工具后有效果表现（装备了某工具）③采集果实后看起来更明显（显示采集效果）④可交互土地的差异化显示（可交互引导）⑤UI提示信息（各类信息提示）①各个可交互工具看起来更明显（可拾取引导）功能原理：通过添加旋转运动器和特效的方式，引导玩家进行拾取 效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 操作步骤：1.【局内编辑器】给各个工具添加【组件-基础运动器】，通过循环旋转表示差异化 2.【局内编辑器】给各个工具添加循环特效，表示可拾取引导 ②玩家获取工具后有效果表现（装备了某工具）功能原理：玩家获取工具时通过创建元件并跟随吸附在玩家附近表示装备了某工具 效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 操作步骤：1.【局内编辑器】制作3个与原工具同模型的用于吸附在玩家身上的装饰工具，并添加【组件-跟随运动器】**由于原工具已有选项卡、特效和旋转，所以需要创建新工具跟随 2.【千星沙箱】配置拾取/切换/丢弃道具后的表现效果功能逻辑：玩家身上的装备的工具发生变化时——移除玩家身上原本装备的工具——根据拾取/切换的工具创建新工具，并吸附在玩家周围**3个道具功能逻辑一致，仅判断玩家身上道具后，生成的道具差异 为达到预期的功能效果教程中配置如下：该节点图挂载对象为：【玩家】  要做的功能对应的配置项功能拾取道具后销毁原道具，触发玩家拾取事件触发场景玩家拾取/切换/丢弃道具后前置触发通过自定义变量改变【事件节点】：自定义变量变化时**已在前置教程中使用结果-1销毁原本身上的工具装饰【执行节点】：销毁实体删除玩家身上原本装备的工具条件玩家拾取某工具【流程控制节点】：使用【多分支】对新值进行判断结果-2拾取后生成新工具【执行节点】：使用【创建元件】在原地创建新的工具结果-3新工具吸附在玩家手上【执行节点】：使用【切换跟随运动器的目标】使刚才创生的工具跟随在玩家的挂接点“RHand”上，配置合适的偏移和旋转【执行节点】：使用【设置自定义变量】更改玩家身上“装饰物工具”的变量 ③采集果实后看起来更明显（显示采集效果）功能原理：玩家采集果实后，添加物件跟随效果；出售果实后将跟随物件全部移除 效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 操作步骤：1.【局内编辑器】给【玩家】添加1个变量列表，记录采集后跟随的采集物，用于后续删除类型：实体列表**选择实体列表是因为同时间可能采集多个，使用了叠加效果，因此后续是对列表中每一个实体进行移除 2.【局内编辑器】制作跟随的果实装饰物，添加【组件-跟随运动器】用于后续节点图控制跟随玩家**此处无需额外配置，后续通过节点图调用 3.【千星沙箱】制作采集果实后的物件跟随效果为达到预期的功能效果教程中配置如下：该节点图挂载对象为：【玩家】  要做的功能对应的配置项功能采集果实后，有物件跟随触发场景玩家采集果实后【事件节点】：自定义变量变化时**已在前置教程中使用条件判断玩家是采集果实【流程控制节点】：通过自定义变量名判断玩家是采集果实的行为结果-1创建装饰物【执行节点】：创建元件结果-2让装饰物跟随玩家【执行节点】：切换跟随运动器的目标，跟随玩家**此处为了凸显采集效果，每个物件的跟随位置有一定偏移，进而产生采集多个果实时的叠加效果结果-3记录装饰物，用于后续提交果实后移除【执行节点】：对列表插入值，将创建的实体存储 4.【千星沙箱】制作玩家上交果实后清空跟随的装饰物效果功能原理：玩家上交果实后，将记录的实体列表中的实体都移除，然后清空列表 为达到预期的功能效果教程中配置如下：该节点图挂载对象为：【果实商】  要做的功能对应的配置项功能采集果实后，有物件跟随触发场景玩家上交果实【事件节点】：自定义变量变化时**已在前置教程中使用条件//结果-1将所有果实装饰物移除【执行节点】：使用【列表循环迭代】+【销毁实体】移除玩家记录的采集物实体结果-2清空列表用于后续记录【执行节点】：在循环结束后，使用【清除列表】清空玩家记录的采集物实体列表 ④可交互土地的差异化显示功能原理：给玩家对于可交互土地，增加白色的方框特效，引导玩家进行交互 效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 操作步骤：1.【千星沙箱】制作可交互引导效果功能逻辑：玩家可操作土地进行变化时——移除原可交互土地的特效——给新可交互土地增加特效 为达到预期的功能效果教程中配置如下：该节点图挂载对象为：【玩家】  要做的功能对应的配置项功能拾取道具后销毁原道具，触发玩家拾取事件触发场景玩家进入/离开可交互土地区域【事件节点】：自定义变量变化时**已在前置教程中使用条件玩家进入/离开可交互土地区域【流程控制节点】：判断玩家进入/离开可交互土地结果-1移除旧土地的特效【执行节点】：移除特效结果-2增加新土地的特效【执行节点】：增加特效 ⑤UI提示信息（各类信息提示）功能原理：增加UI控件，显示各类信息，给予玩家信息引导 效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 操作步骤：1.【局内编辑器】增加UI控件，选择文本框此前教程中已经给玩家增加了各种信息变量，教程中展示的信息如下：1.当前装备的工具2.种子可使用次数3.采集的果实数4.积分值插入变量选择【玩家自身】的变量制作文本框即可**实际制作时可根据自身需要灵活调整辅助课件辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-操作提示与反馈】对照学习",
  "mhqdyt95smtm": "前言相关信息：推荐学习顺序：【前置课程】→【当前课程】 前置课程：该课程与以下前置课程所讲述的功能知识点相关（建议首次使用时，优先学习【前置课程】，学习体验更流畅）目标拆解功能逻辑以下为在该玩法中与操作提示与反馈相关的功能点，课程中将根据这些功能点进行组合讲解：①进入游戏后，所有玩家在等待区进行准备，确认所有玩家准备后游戏正式开始②单局游戏时长5分钟，时间结束后根据玩家“积分值”进行结算，积分最高的玩家获胜①进入游戏后，所有玩家在等待区进行准备，确认所有玩家准备后游戏正式开始功能原理：使用1个分割场地，其中1个作为准备区，1个作为游戏区；玩家进入游戏后出生点均在准备区，交互机关后完成准备，检测玩家人数足够后，将玩家传送到游戏区，正式开始游戏 效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 操作步骤：1.【局内编辑器】在【esc面板-预设点管理】中添加预设点，分别放置在“准备区”和“游戏区” 2.【局内编辑器】将玩家初始出生点绑定在预设的“准备区”预设点，即玩家出生时会自动在准备区出生 3.【局内编辑器】在【关卡实体】上创建2个变量，用于检测判断局内玩家总人数和已准备人数，当2个变量值相等时，即视作游戏正式开始变量1-类型：整数；初始值：0变量2-类型：整数；初始值：0 4.【局内编辑器】在【玩家】上创建1个变量，用于检测判断玩家的准备状态，已准备的玩家无法再次准备类型：布尔值；初始值：否 5.【局内编辑器】添加1个UI控件，以文本框展示信息，告知玩家目前的准备状态**实际展示信息可以根据自身需要灵活调整 6.【局内编辑器】制作1个准备物件，添加【组件-选项卡】，用于玩家触发准备此外，还可以添加特效让玩家更多关注到这个路牌指引 7.【千星沙箱】制作玩家准备后检测当前所有玩家准备状态，均完成准备后开始游戏功能原理：每个玩家角色创生时——关卡变量“局内玩家总人数”+1；每个玩家准备后——关卡变量“当前已准备人数”+1——判断2个变量是否相等——相等则游戏正式开始（触发玩家传送到另一个场地） 为达到预期的功能效果教程中配置如下：该节点图挂载对象为：【玩家】  要做的功能对应的配置项功能-1每个玩家加入游戏后，关卡记录的总人数+1触发场景玩家加入游戏时【事件节点】：实体创建时条件//结果关卡总人数记录+1【执行节点】：使用【设置自定义变量】将关卡变量“局内玩家总人数”+1 该节点图挂载对象为：【准备台】  要做的功能对应的配置项功能-2每个玩家准备后，关卡记录的已准备人数+1，当已准备人数和总人数相等时游戏开始（将玩家传送至另一个场地）触发场景玩家加入游戏时【事件节点】：实体创建时条件-1玩家未准备【流程控制节点】：判断玩家变量“是否已准备”结果-1玩家准备后不能再次准备【执行节点】：使用【设置自定义变量】将玩家变量“是否已准备”改为“是”结果-2已准备人数增加【执行节点】：使用【设置自定义变量】将关卡变量“当前已准备玩家数”+1条件-2准备玩家等于总玩家数【流程控制节点】：判断关卡变量“局内玩家总人数”和“当前已准备玩家数”是否够相等结果-3游戏开始，将所有玩家传送到游戏区【执行节点】：使用【列表循环迭代】+【传送玩家】，将场上所有玩家传送到游戏区 ②单局游戏时长5分钟，时间结束后根据玩家“积分值”进行结算，积分最高的玩家获胜功能原理：触发游戏开始后（玩家传送至游戏区）——设定全局计时器倒计时5分钟——5分钟后游戏结束，将所有玩家传送回准备区——展示积分值排行 效果演示：**演示中的文本显示，需达到特定奇匠等级后解锁【自定义文本外显】功能，教程中以效果展示为主 操作步骤：1.【局内编辑器】ESC面板-计时器管理中，增加1个5分钟的全局计时器，用于后续使用 2.【局内编辑器】关卡实体上增加【组件-全局计时器】**此处仅添加组件无需额外配置，如果在面板添加，则实体创生时全局计时器默认启动 3.【局内编辑器】增加1个UI控件，显示游戏时间预制模版中直接选择【计时器】配置为之前制作的全局计时器，类型为：倒计时 4.【局内编辑器】新增1个界面布局，制作游戏结束后的信息展示面板**界面布局是相互独立的UI控件界面，可用于完全不同的UI展示，减少其他信息干扰预制模版中直接选择【计分板】配置每个玩家分数=之前设定的变量【积分值】，其他辅助文字提示可根据需要灵活调整 5.【千星沙箱】制作游戏计时开始效果为达到预期的功能效果教程中配置如下：该节点图挂载对象为：【准备台】  要做的功能对应的配置项功能游戏开始后，开始计时触发场景所有玩家完成准备/**无需额外配置，直接使用步骤①中的准备台节点图条件所有玩家完成准备/**无需额外配置，直接使用步骤①中的准备台节点图结果开始计时【执行节点】：使用【启动全局计时器】启动【关卡】上的计时器**名称为设定全局计时器的名称 6.【千星沙箱】制作游戏结束流程功能逻辑：5分钟计时结束后——将所有玩家传送至准备区——展示游戏结束的积分排行信息 为达到预期的功能效果教程中配置如下：该节点图挂载对象为：【关卡】  要做的功能对应的配置项功能5分钟后，游戏结束传送玩家，并展示积分排行信息触发场景5分钟后【事件节点】：全局计时器触发时条件//结果-1所有玩家传送至准备区【执行节点】：使用【列表循环迭代】+【传送玩家】，将场上所有玩家传送到准备区结果-2给所有玩家展示积分排行信息【执行节点】：使用【列表循环迭代】+【切换当前界面布局】，展示游戏结束的相关信息辅助课件辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-玩法流程】对照学习",
  "mhd6259kqvyi": "欢迎各位关卡创作者（奇匠）使用编辑器和千星沙箱！我们为您提供了一系列教学课程，帮助您更快了解或学习上手原神编辑器。",
  "mhn7jl05i6o0": "",
  "mhv8u3r4y8r2": "欢迎各位关卡创作者（奇匠）使用编辑器和千星沙箱！以下为视频教程的入门课程，可跟随教程指引制作你的第一个奇域组件。",
  "mhfbsz9agu62": "辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-进度条】【教学存档-文本框】对照学习",
  "mh6d6yikkikc": "",
  "mhxekxruo6ym": "",
  "mhofyx04rvcw": "",
  "mhdbm29p5ljm": "欢迎各位关卡创作者（奇匠）使用编辑器和千星沙箱！以下为视频教程的基础课程，可跟随教程指引制作你的第一个关卡。",
  "mhysk6rycl8m": "辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-金币与节点图】【教学存档-普通攻击】【教学存档-场景地形】对照学习",
  "mhyn09rtxvni": "",
  "mh7lmaiju798": "",
  "mhgk8b99qiuy": "",
  "mhpiuc0zmugo": "",
  "mhyhgcrpj62e": "",
  "mh7g2diffho4": "",
  "mhgeoe95bt9u": "",
  "mhpdaf0v84vk": "",
  "mh7aigib0s30": "",
  "mhg94h90x3oq": "辅助课件我们提供了上述课程内容相关的工程文件，可结合【教学存档-建成我的第一个奇域】对照学习",
  "mhjtk90iodts": "一、常见问题：1、关卡编辑Q：关卡实体（LevelEntity）在哪？经常无法正常点击到关卡实体，如何快速定位关卡实体？A：关卡实体（LevelEntity）实体摆放界面中以蓝色立方体图标表示（如下图），本质是一个没有模型的点。快速定位方法：①Esc界面—②关卡设置—③基础—④关卡实体【查看】Q：关卡实体中挂载【实体创建时】事件逻辑后，为什么我点击试玩进入游戏时，逻辑已经跑一半/跑完了？A：实际在Loading界面中，尽管玩家还没有进入关卡进行游玩，关卡就已经创建完成了，因此会导致一些初始生效的逻辑（如运动器、实体创建时等逻辑）在玩家进入以前就已经开始运行。Q：阵营中的敌对/友善关系可以在游戏运行中通过节点图切换吗？A：现阶段不支持保持原有阵营的情况下，切换该阵营和其他阵营的敌对/友善关系；不过可以通过创建多个阵营，在游戏中通过切换阵营来达到此效果。2、地形编辑Q：能不能通过地形笔刷在已经编辑的地形墙面上挖洞？A：现不支持消除地形中间某几层（如下图，在最上层地形未被删除前，红框部分无法被删除），因此无法在单个地形上通过笔刷快速挖洞、造桥，可以通过两个地形拼接达到效果。Q：为什么游玩过程中的水体无法被冰元素技能冻结？A：“局内编辑器”中的水体和游戏本篇水体不同，无法通过冰元素使其冻结；3、实体摆放3.1实体Q：实体摆放有没有上限？具体上限是多少？A：动态单位摆放上限为1000，静态单位无上限。（静态单位指无法绑定组件和节点图功能的纯实体。）Q：在哪里可以查看场景中已经摆放的实体列表？A：现阶段可以通过千星沙箱下方的【场景编辑空间实体】列表查看已经放置的实体，通过双击可以直接在局内编辑器中跳转到实体所在位置。Q：我能不能对多个实体进行编组？A：可以通过设置实体布设组功能对多个实体进行编组。Q：选择实体时，操作杆只进行缩放操作，无法移动或者旋转是为什么？A：在“局内编辑器”选择“投射物”后，再选择物件、触发盒等，会出现“操作杆只能进行缩放操作的问题”；如奇匠遇到该问题，请通过空格键手动切换到移动/旋转/三合一操作杆。Q：我想要通过操纵杆对实体进行等比缩放操作，应该怎么操作？A：首先，点击目标实体，通过空格键将操纵杆切换为缩放状态：随后，点击操纵杆的中心圆点，长按鼠标左键即可进行等比缩放。3.2造物（怪物）Q：造物（怪物）能不能改变大小？A：造物（怪物）大小为固定值，不支持修改造物（怪物）大小。Q：为什么造物（怪物）的脱战存在异常？A：“禁止移动”单位效果作用于敌人时，可能会导致敌人脱离战斗后表现异常，移除该状态后即可恢复正常。4、元件库/元件编辑Q：为什么我在元件库编辑元件后，切换到实体摆放界面，没有在实体列表里面找到我编辑过的元件？A：在元件库编辑元件后，一定要点击保存，才会在实体摆放界面的自定义实体/造物（怪物）里找到。5、战斗预设Q：我怎么获取不到角色的GUID？A：角色本身没有GUID，因此请注意在节点图GUID参数获取中，不要获取角色的GUID，这会导致功能不运行。Q：玩家和角色之间是什么关系？A：在局内编辑器中，【玩家】是服务器概念上的独立个体，即每个进入游戏的玩家，每名玩家的变量存储也都独立存在；【角色】是由玩家进行操作控制的特殊实体，在关卡中与各类组件进行交互的实体都是【角色】；不过需要注意，【玩家】有GUID，但是【角色】没有GUID。Q：我怎么让角色手持武器？A：现阶段武器是通过特效来配置的，在角色的【特效】组件上挂载【循环特效】，在资产中选择“模型-单手剑/大剑”后，在挂接点上根据自身需求选择挂接点。Q：为什么我的角色复苏之后又立马被击败了？A：关卡内角色的复苏逻辑是：先在原地复苏，再传送到复苏点；因此，在特定情况下，角色复苏后可能会被立即击败。Q：为什么我的技能命中目标数量变多之后，后面的目标无法被正常命中了？A：技能同时命中的目标超过20个时，基于技能选中目标的逻辑，超过20个以外的目标将无法受到任何伤害。Q：在技能节点图的预览中，为什么只能预览到部分技能节点图中的执行效果？A：在“千星沙箱”中，编辑技能相关节点时，仅支持预览部分“执行节点”的执行效果。6、组件6.1碰撞触发器Q：为什么挂载触发器组件且编辑完节点图逻辑后，试玩不触发对应逻辑？A：请确认：①是否在【碰撞触发器组件】配置了触发区，且目标物进入了触发区②触发区为初始生效③正确设置作用对象④已挂载节点图且有正确、完整触发逻辑，并且已经保存。⑤请确认挂载的是【碰撞触发器】而非【碰撞触发源】Q：人物进入/离开碰撞触发器区域时，进入/离开者实体是玩家还是角色？为什么我获取不到进入/离开碰撞触发器的实体GUID？A：玩家操纵人物进出触发区域时，事件节点中进入/离开者实体传出的是角色实体；因此，进出触发区域的实体为角色时，进入/离开者实体GUID引脚传出值为空。Q：为什么实体高速穿过碰撞触发器时不触发效果？A：实体高速通过较窄的碰撞触发器时，有概率无法触发碰撞触发器，建议奇匠根据需要调整碰撞触发器大小；6.2选项卡Q：为什么我在【选项卡】中已经配置了触发区，但是在节点图中【进入/离开碰撞触发区】取不到事件？A：因为【进入/离开碰撞触发区】只监听【碰撞触发器】的进出事件，对【选项卡】组件中的【触发选项区域】不监听。如需要额外监听玩家进入触发选项区域事件，需要额外配置一个【碰撞触发器】。6.3全局计时器Q：为什么我已经在计时器管理中配置了计时器，但是在节点图中动态开关/恢复、取值不生效？A：计时器除了需要在计时器管理界面配置好后，还需要在对应的动态元件上添加【计时器】组件，并且手动选取需要挂载的对应计时器，才会被该元件的节点图调取并执行。例：元件在倒计时5秒后打印字符串：“触发”①计时器管理界面配置倒计时为5秒的全局计时器：②元件挂载【全局计时器】，且勾选上刚刚创建配置好的倒计时：③挂载带有全局计时器事件逻辑的节点图④节点图内逻辑完整⑤成功触发Q：计时器为倒计时/正计时时，节点图中【全局计时器触发时】事件节点什么时候会被触发？A：当全局计时器类型为倒计时时，【全局计时器触发时】事件会在倒计时结束时触发（如倒计时5秒，会在进入游戏5秒后触发）。当全局计时器类型为正计时时，【全局计时器触发时】不会被触发。Q：全局计时器什么时候开始计时？A：全局计时器默认其挂载的元件被创建后立即启动。6.4基础运动器Q：为什么我在运动器组件中配置的向量数据（xyz），在实际试玩中的移动方向和预期不符？A：在运动器组件中（以匀速直线为例），其速度向量中xyz为世界坐标。并且不管在实体摆放页面，元件本身如何旋转，在运动时都会基于已配置好的世界坐标来移动。因此，建议不要通过元件本身的操纵杆（handle）来判断运动器中的xyz，而是主要参考运动预览中蓝色指示线来判断。Q：为什么我在元件上已经配置好了运动组件和节点图，但是配置未生效？A：在“局内编辑器”中，如果“基础运动器组件”设置的生效时间过短，由于通信延迟存在，信息还未传达到节点图，运动就已经结束，会导致节点图无法生效；请奇匠将生效时间设置为大于0.1s的值；6.5角色扰动装置 Q：力场器中逻辑力场球体和触发区域是什么关系？为什么角色已经进入逻辑力场球体范围，但是不会被力场影响？A：角色必须进入扰动装置中的触发区域才会开始受到逻辑力场的影响。因此，如果想要玩家接触逻辑力场球体就会被牵引，其触发区域必须要比逻辑立场球体范围大。例：如下图，角色没有踩上挑战起点元件中心时，是不会被力场牵引的，尽管力场范围已经将元件以及周围都涵盖了。同理，如果进入触发区，但是没有进入逻辑力场球体范围，也不会触发牵引逻辑。Q：为什么我在【角色扰动装置】中已经配置了触发区，但是在节点图中【进入/离开碰撞触发区】取不到事件？A：因为【进入/离开碰撞触发区】只监听【碰撞触发器】的进出事件，对【角色扰动装置】组件中的【触发区域】不监听，如需要额外监听玩家进入触发选项区域事件，需要额外配置一个【碰撞触发器】。6.6跟随运动器Q：为什么在组件中选择跟随目标，下拉列表中没有我想要跟随的实体？A：请确认想要跟随的目标实体已经被放置在【实体摆放】界面中。Q：为什么在节点图中选择跟随目标角色，但实际游玩不生效？A：跟随运动器目标需要GUID来做定位，但角色本身没有GUID，导致功能不运行6.7自定义变量Q：自定义变量、节点图变量有什么不同？A：自定义变量和节点图变量虽然都是变量，但是层级不同：【自定义变量】挂载在实体上后，除了可以被自身节点图逻辑读取和修改外，还可以被其他实体挂载的节点图逻辑读取和修改；【节点图变量】只能在单个节点图中存储并生效，不过可以通过公开变量的方式让其他节点图取到。Q：为什么我的自定义变量出入参不生效？读取不到/值都是0？A：确定已经挂载自定义变量组件，并且其目标自定义变量的名称、数据类型都准确无误。保证从发出、查询、监听所有节点的数据类型都和目标自定义变量数据类型相等。Q：为什么变量已经变化了，但【自定义变量变化时】不生效？A：首先【自定义变量变化时】只能监听它所挂载的元件身上的变量改变，请确保没有跨元件监听变量变化的设计；其次，请重点确认【变化后值】【变化前值】的数据类型与想要监听的数据类型完全匹配！（点击小齿轮可以设置数据类型）如果想要监听的变量数据类型为字符串，但是【自定义变量变化时】中的【变化后/变化前值】为泛型/其他数据类型，会导致监听失败！Q：为什么修改自定义变量的名字后会和部分功能的关联会断开？A：当修改自定义变量、能力单元等组件修改名字后，该组件在其相关界面（例如“交互界面编辑”界面）的关联关系需要重新配置。6.8特效播放Q：为什么在特效资产中，有些之前见过的特效找不到？为什么有时候打开特效资产，发现内容不一样？A：特效实际上分为限时特效和循环特效，两类特效的资产库是完全不同的。因此在设置特效的时候请确保特效资产类型为您需要的类型。6.9音效播放Q：移动端试玩过程中，音效会异常消失？A：移动端的性能优化逻辑导致，同时播放的音效数量有上限。6.10命中检测Q：为什么我的命中检测不生效？A：“命中检测”组件中，针对阵营和实体类型的筛选只会对“受击盒”命中层生效。7、结构体为什么“结构体”有的时候会导入失败？“结构体”的导入功能，目前只有在结构体的参数和类型完全一致的时候，才能进行导入。8、界面控件组编辑Q：文本框内容是否支持换色？文本怎么换行？A：可以使用在文本框设置中通过“\\n”命令进行换行；可以使用\"<color=颜色英文>正文</color>\"命令制作出不同颜色的文本，如下：Q：能否单独获取到弹窗控件/其他控件被开启和关闭的事件？A：现在暂时没有弹窗控件/其他控件被开启和关闭的单独事件。Q：我在元件上挂载了全局计时器，想通过计时器控件来获取计时器时间，为什么获取不到？A：界面控件里的计时器控件，只能读取关卡实体（LevelEntity）以及玩家身上的计时器组件信息，无法读取到实体摆放界面其他实体上的全局计时器数据的，因此如果有读取全局计时器时间需求，请将其挂载在关卡实体（LevelEntity）或玩家身上。Q：为什么我已经点击按钮了，但是没有触发【界面控件组触发时】事件？A：由于此节点只监听特定玩家的点击情况，因此请确认【界面控件组触发时】这一节点的节点图挂载在【玩家】身上且应用给目标玩家。Q：为什么我点击了我的“卡牌选择器”组件的“重置”按钮，直接关闭了我的卡牌选择器窗口？A：界面控件组编辑器的“卡牌选择器”组件的“重置”按钮，需要挂载节点图来实现卡牌选择器功能，如果没有相应的节点图，则默认会直接关闭卡牌选择器弹窗。Q：为什么我找不到“卡牌选择器”的界面？A：界面控件组管理的“卡牌选择器”目前只可添加到界面控件组库中，不支持添加到界面布局上。9、千星沙箱Q：为什么已经编写完节点图并且保存了，在想要在节点图配置界面里进行挂载的时候找不到我写好的节点图？A：节点图有不同的类型页签，请确保您编写的节点图位置是否正确；如需要挂载在【实体】上的节点图，请在【实体节点图】页签下编写并保存，才能在实体上挂载对应节点图；如果您在【状态节点图】页签下编写保存的节点图，是无法在【实体】节点图配置界面中找到的。Q：为什么我的节点图循环/运算执行到一半就停止执行了？A：“千星沙箱”中，当存在计算量较大的节点时（如循环节点，或者一些节点比较多的节点图），其执行次数可能存在上限，当奇匠需要编辑此类节点图时，可以将其拆分；后续更新中会增加功能：当计算量达到上限时，千星沙箱会出现提示；9.1服务器节点图Q：我怎么获取不到角色的GUID？A：角色本身没有GUID，因此请注意在节点图GUID参数获取中，不要获取角色的GUID，这会导致功能不运行。Q：【获取自身实体】获取的是什么？是玩家、角色还是实体？A：节点图挂载在什么实体身上，【获取自身实体】获取的就是什么实体，如挂载在物件实体上，那么此实体上的节点图【获取自身实体】传出的参数就是此物件实体的实体数据；如果挂在角色上，那么此角色上的节点图【获取自身实体】传出的参数就是此角色的实体数据，玩家同理。Q：【玩家】和【角色】之间是什么关系？为什么有些实体引脚输入玩家/角色的实体参数不生效？A：在局内编辑器中，【玩家】：玩家是服务器概念上的独立个体，即每个进入游戏的玩家，每名玩家的变量存储也都独立存在；【角色】：是由玩家进行操作控制的特殊实体，在关卡中与各类组件进行交互的实体都是【角色】；因为两者是不同的实体，因此在编辑节点图中，需要严格区分出入参的实体是【角色】还是【玩家】，两者混淆会导致逻辑无法正常跑通。同时需要注意，玩家有固定的GUID，角色没有GUID。Q：为什么【传送玩家】节点有时会出loading，有时又直接瞬移？A：传送玩家在传送距离与原位置超出一定数值时，会进入Loading状态。如果从传送位置较近，则直接瞬移到目标位置。Q：为什么【传送玩家】节点不被正常执行？A：在保证被传送玩家正常入参的情况下， 可能是因为传送坐标超出了场景生效范围导致的，可以在Esc界面—【关卡设置】中将场景生效范围扩大。Q：为什么在【获取列表对应值】中，【序号】填“1”获取不到参数/获取到的是列表里第2个参数？A：在局内编辑器中，列表采用的是零基索引。这就导致在给列表出入参时，第一个参数的序号是0。比如在获取在场的第一个玩家时，【获取列表对应值】的索引应该填写“0”。但同时也要注意，并非所有地方都采用了零基索引，如在组件中，【选项卡】等索引就是以“1”为初始值，需要注意区分。Q：为什么有时候【自定义变量变化时】事件监听不到变量变化？A：首先请确认目标变量是否正常变化，可以用【打印字符串】节点在变量变化之后输出该变量值来确认是否变化。如果没有正常变化，可以①检查【设置自定义变量】是否定义了【目标实体】；②检查目标实体是否已经挂载自定义变量组件且有对应名称的变量槽位；③检查变量数据类型是否匹配，否则变量变化是不生效的。④给用执行节点给自定义列表插入值是不触发自定义变量变化事件的。如果确认变量正常变化，但是依旧监听不到变量变化的事件，同样请确认监听自定义变量变化的变量数据类型是否匹配。保证从发出、查询、监听所有节点的数据类型都和目标自定义变量数据类型相等。如检查【变化后值】【变化前值】中的数据类型定义是否和要监听的变量数据类型相等，以及改变、获取变量时的数据类型都保持一致。此外还需要检查【设置自定义变量】执行节点中的“是否触发事件”勾选了【是】，否则不发出事件。Q：【全局计时器】和【定时器】有什么区别？A：【全局计时器】指的是已经在【计时管理器】中配置的计时器，通过组件【全局计时器】可以调取，但必须提前配置；挂载之后，物体/元件上的全局计时器相关节点才能取参、生效。并且计时器可以被UI界面中的计时器直接取用。【定时器】是可以通过节点图动态创建，挂载，停止，循环的一种时间轴定时器。可以结合拼装列表触发定时器事件，达到打点计时器或延时触发的效果；根据自身需要可以在两者中灵活取用。(如下图配置，在启动定时器之后，每1秒都能触发一次定时器触发时事件）Q：【启动定时器】是创建新的定时器还是启动已有定时器？A：【启动定时器】是创建一个新定时器并立即启动；如需要重启一个被暂停的定时器，可以使用【恢复定时器】节点。Q：在节点图编辑【特效】中，怎么预览特效？A：点击特效资产后的放大镜图标，之后可以点击列表中的播放按钮进行播放。此时打开实体摆放页面，就可以看到特效会在屏幕中间以默认大小播放。Q：为什么用节点【播放特效】创建特效之后，试玩里特效不显示？A：①首先确认选择的元件/造物具有“播放特效”这一组件。②其次触发特效的节点图逻辑挂载在对应元件/造物中，并且逻辑正确、能正常走到执行节点。③然后确认特效资源ID为可用ID（播放特效中的特效ID为非循环特效，不要复制粘贴循环特效ID），目标实体正常入参。④最后注意参数：目标实体正常挂接，同时挂接点为有效挂接点，同时缩放倍率不为0。Q：为什么用节点图挂载特效，特效位置和挂接点之间不是精准贴合？A：现阶段使用节点图挂载特效时，特效不会精准贴合地挂在具体挂接点上。Q：节点引脚的数据类型是固定的吗？可以用整数0和1替代布尔值的True和Flase吗？A：节点图中引脚的数值均为固定类型，当类型不符时，只会获得一个对应类型的默认值（例如，无法使用整数的0和1，来替代布尔值中的否和是）；请奇匠注意检查引脚的数值类型、必要时可以使用“数据类型转换”节点；Q：为什么“攻击命中时”事件不正常回传攻击者信息？A：在“千星沙箱”中，使用“攻击命中时”节点时，若受击实体被某一次攻击击杀，由于实体已经销毁，节点会无法获取到本次攻击受击者的信息；Q：为什么销毁节点后的逻辑不生效？【实体销毁时】事件为什么不传参？造物（怪物）身上为什么监听不到销毁事件？A：【销毁时】事件需要挂载在【关卡实体】（LevelEntity）上。这是由于：除了【关卡实体】（LevelEntity）的节点图外，实体销毁/移除时事件都不会生效，因为实体监听不到其他实体销毁，如果节点图中有销毁实体，那么在执行销毁实体后，此实体的所有逻辑都会失效。Q：我想在游戏开始/关卡创建时就触发事件执行逻辑，但是没有找到关卡开始时类似事件？A：建议在关卡实体（LevelEntity）上挂载节点图，用【实体创建时】事件来实现此效果Q：我想动态设置某个实体/特效的位置/大小，应该怎么操作？A：现阶段不支持通过节点图动态改变场上某个实体/特效的位置、大小，可以通过销毁+创建的方式来达到效果。Q：应该怎么拆分向量？怎么将1个向量参数拆分为3个可以单独入参的参数？A：可以通过运算节点【拆分三维向量】、【创建三维向量】的方式将向量拆分和合并。Q：【创建实体】节点为什么没有位置的入参？我怎么确认它被正常创建了？A：【创建实体】节点实际上是针对已经在实体摆放界面摆放过且关闭了【初始创建】的实体使用的。因此它只起到开关的作用。如果想要动态生成某个元件的实体，则应该改用【创建元件】节点来实现效果。Q：复合节点两个相同数据类型的引脚怎么进行合并？A：在需要被合并的引脚上右键，选择【合并引脚】。此时相同数据类型的引脚序号会变空，如下图。随后点击变空的引脚，将其勾选后，再在“选择引脚合并至XXX”勾选确认即可完成合并。Q：【创建元件】节点是在元件库内创建一个新的元件吗？还是在实体摆放界面创建元件？A：实际上【创建元件】节点是根据元件库中已编辑保存的元件，在实体摆放界面上创建它的子实体。创建出的实体继承元件的所有逻辑，但是每个实体单独处理自己身上的逻辑。（如在实体摆放界面放置了若干个[可以被吃到的金币]元件的子实体，角色在吃到其中一个金币时，只会使得被吃到的特定金币消失，而非使所有[可以被吃到的金币]元件的子实体金币都消失）Q：【创建元件】后为什么获取不到创建实体的GUID？A：在“千星沙箱”中，“创建元件”的节点创建的实体，其GUID是无法获取到的；Q：为什么玩家、角色身上挂载【状态变化时】【状态移除时】事件不正常生效？A：这两个节点需要在【状态节点图】中创建节点图进行配置，且挂载在对应状态上才会生效，作为实体节点图挂载在玩家、角色、造物（怪物）、物体身上都不会生效。Q：为什么我已经动态将自身仇恨值降为0，但是造物（怪物）依然在攻击我？A：您依然在造物（怪物）的仇恨列表中，可以通过将自身移除出仇恨列表来实现效果。Q：为什么修改追踪小地图表示的玩家列表这个节点无法运行?A：节点“修改追踪小地图标识的玩家列表”，不支持追踪类型是“范围”的小地图标识。9.2千星沙箱Q：我不小心把千星沙箱整个窗口关掉了，应该怎么再次打开？A：在Esc界面左下角，点击千星沙箱图标后等待几秒后，千星沙箱便会打开。10、试玩及调试Q：为什么编写节点图后点击试玩，编写的逻辑不生效，并且结束试玩后发现节点图回退到未编辑前的状态？A：这是由于您在关卡还处于试玩状态时进行了节点图编写，试玩过程中编写的节点图不会被保存。建议结束试玩后再继续进行节点图的编写，以免丢失重要逻辑。Q：房主默认是玩家1吗？A：现阶段游戏中的玩家1-8是根据进入关卡的顺序来设置的，因此就算是房主开启游戏，如果有玩家比房主先Loading完成，先进入的玩家就会依次为玩家1-8。Q：我可以在游戏中设置假人玩家来测试多人效果吗？A：现阶段暂不支持，如果需要测试多人效果，需要找其他真人玩家来参与多人测试。Q：我在哪里查看【打印字符串】节点打印出来的内容？A：在千星沙箱【窗口】中打开【日志】，实际运行中的字符串会显示在日志信息中。Q：为什么我在【日志】中已经勾选了我想调试的节点图，但是实际运行依旧不显示日志信息？A：可能是因为在勾选后，您没有选择【确认选择】导致的。​Q：为什么我还没有进入游戏，但是其他先进入的玩家已经可以开始玩了？A：有玩家进入之后，游戏就会默认开始，因此最好单独写一个确认所有人已进入并准备的功能。Q：为什么关卡游玩过程中出现了反复传送或者反复打开卡牌选择器？A：部分异常可能会导致旅行者在游玩时，遇到反复进行传送，或者反复打开卡牌选择器的问题。遇到该问题的旅行者请退出游戏，并结束游戏进程，等待十五分钟后重新进入游戏即可恢复。11、存档导出及合并Q：为什么我点击导出存档后，在弹出的保存路径页面点击【保存】不生效？A：您没有对导出的文件进行命名导致的，需要编辑好文件名后，保存按钮才能被按下。Q：为什么我导入外部资源后，没有在现有元件库/节点图中找到导入的外部资源？A：导入外部资源后，外部资源统一放置在资产库中，根据需要手动单独转存。​​Q：为什么日志中不打印【实体创建时】事件触发的日志？A：在游戏开始时就创建的实体中的【实体创建时】会无法在日志中显示，这是由于实体创建时日志功能还没有接入，但是实际逻辑是正常运行的。Q：为什么我导出导入的资源有部分逻辑丢失了？A：在“局内编辑器”使用“本地资产加载”或“资源导出”时，若相关资源之间存在关联内容，需要将关联的内容同时导入或导出，否则会丢失部分资源资产之间的引用信息；Q：上传存档或者文件的过程中，编辑器会未响应?A：当前在关卡试玩和关卡上传时，通过来回切换窗口离开/返回编辑器，有概率导致出现未响应状态的情况，耐心等待恢复即可。二、逻辑自查Tips：由于节点图本身较为自由和复杂，会有较多问题导致节点图没有按照预期生效。现提供一套简单的自查流程，来帮助奇匠快速定位到节点图的问题。节点图有没有保存并挂载？——确认节点图编辑完成并挂载在目标元件上，同时元件也进行了覆盖保存，能够影响到关卡中的子实体。逻辑引脚是否都已正常连接？事件是否能正常连接到执行端？——确定各节点上的逻辑引脚都正常连接，没有错连、断连的情况。是否挂载了事件对应的组件？——比如，在节点图中用到了【选项卡选中时】的事件节点，但是所挂载的元件/实体没有选项卡组件，那么这个事件是不会被触发的。是否有销毁实体节点？——如果节点图中有销毁实体，那么在实体被销毁后，此实体的逻辑会失效。是否使用了实体销毁/移除时的事件？——除了关卡实体（LevelEntity）的节点图外，实体销毁/移除时事件都不会生效，因为实体监听不到其他实体销毁。节点图中执行节点的目标实体是否都正常入参？——务必确保节点图中的目标实体都正常入参，特别是涉及到多个查询节点时，要注意最初的目标实体引脚都正常入参。如下图，“目标角色实体”就没有入参，这会导致节点图执行失效。入参/填写数据类型是否匹配？——最常见的问题是，获取到的实体参数是【角色】，但是却入了【玩家】的数据参数。如下图是错误的！“选择者”出参的类型是【角色】，导入玩家参数中就会不生效。同样的，在进行变量传参的时候，也要注意变量的数据类型是否与入参类型、目标变量数据类型相符，否则也不会正常生效。是不是获取了角色的GUID？——角色本身没有guid，只有玩家才拥有guid。如下图给跟随目标GUID传参，最终只会传0值。自定义变量的数据类型是否匹配？——如果有自定义变量事件、自定义变量执行或传参，一定要保证所有的变量数据类型都和预期一致，否则会不生效。  ",
  "mh53ejiegx0k": "Step 0 入驻账号准备入驻创作者中心前，请确保已有正在使用的米哈游通行证账号，且：账号已完成实名认证账号已有原神天空岛(官方服)游戏角色天空岛(官方服)游戏角色为必需(非必需)如果同时有世界树(渠道服)游戏角色，也可前往米哈游通行证平台>>-【账号游戏信息】进行绑定绑定的原神游戏账号已开启祈愿功能后续将持续使用以上绑定的游戏账号发布关卡*部分截图因演示需要，内容仅供参考，最终请以线上表现为准Step 1 登录/入驻创作者中心点击创作者中心链接，点击【立即入驻/登录】，使用米哈游通行证账号登录若出现无法正常登录的情况：如果点击按钮后，提示“实名认证失败”，请点击【重新认证】，通过实名认证后才可入驻如果点击按钮后，提示“当前登录账号下未发现原神游戏账号，无法入驻。若渠道为''世界树''，需先绑定后才可入驻”，请检查右上角通行证ID是否与自己使用的通行证ID是否一致：如不一致，点击右上角按钮登出后，重新使用符合上述要求的米哈游通行证账号进行登录如一致，或确认使用的通行证正确的情况下依然弹出该失败提示，请点击【前往绑定角色】前往米哈游通行证平台进行角色绑定阅读协议，选择【同意并入驻】Step 2 开通创作收益功能前往开通收益功能点击【首页】- 右侧“创作收益”板块 - 点击【去开通】；或者点击【创作服务中心】- “开通收益功能” - 点击【去开通】页面将展示一个二维码，请使用米游社APP扫描二维码，并在APP内完成后续操作米游社APP内上传身份证在米游社APP内，登录和当前创作者账号一致的账号点击【我的】，点击左上角扫码按钮，扫描上述二维码按照界面提示流程，完成身份证正反面上传、面部识别等认证流程* 身份证信息需与实名认证信息保持一致Step 3 参与激励计划*奇匠等级达到Lv.2 且 已开通创作收益功能，将解锁激励计划参与条件提升奇匠等级*已达到Lv.2 的创作者可跳过此步骤点击【首页】- 右侧“创作等级”板块，或者点击【权益中心】，可查看当前奇匠等级Lv.1 的创作者可完成“成长任务”中的【奇域组件知识挑战】和【奇域关卡知识挑战】，将奇匠等级提升至Lv.2可继续完成其他已解锁的成长任务，进一步提升奇匠等级，解锁更多等级奖励参与激励计划点击【首页】- 右侧“奇匠激励”板块，或者点击【奇匠激励】，可查看当前进行中的激励计划活动可点击对应活动查看详情和参与活动"
}